// #################################################################################
// Generated by Symbol Type Viewer 32Bit/64Bit - Version 1.0.0.6 beta
// http://www.syseclabs.com
// Coding by Lionel d'Hauenens
// #################################################################################
// Image         : 64bit
// ImageName     : windows\X64\6.1.7601.17514\win32k.sys
// LoadedPdbName : symbols\win32k.pdb\21E2778DD2954987A9B7212463FFDC5E2\win32k.pdb

#ifdef __cplusplus
extern "C" {
#endif

//////////////////
//   C Define   //
//////////////////

#define VOID void
#define STDCALL __stdcall
#define FASTCALL __fastcall
#define CDECL __cdecl
#define THISCALL __thiscall
#define NEAR 
#define FAR 
//---------------------------------------------------------------------

//////////////////
// C Basic Type //
//////////////////

typedef signed char INT8;
typedef signed char CHAR;
typedef signed short INT16;
typedef signed int INT32;
typedef signed int BOOL;
typedef signed __int64 INT64;
typedef signed __int64 LONG64;
typedef signed long LONG32;
typedef unsigned char UINT8;
typedef unsigned char BYTE;
typedef unsigned short UINT16;
typedef unsigned short WCHAR;
typedef unsigned int UINT32;
typedef unsigned __int64 UINT64;
typedef unsigned __int64 ULONG64;
typedef unsigned long ULONG32;
typedef float FLOAT32;
typedef double FLOAT64;
typedef struct {unsigned short W[5];} FLOAT80;
typedef struct { __int64 LowPart;__int64 HighPart;} FLOAT128;
typedef double DATE;
typedef signed long HRESULT;
typedef union { struct {unsigned long Lo; long Hi;}; __int64 int64;} CURRENCY;
typedef wchar_t OLECHAR;



//---------------------------------------------------------------------

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Enum types

typedef enum ___201901300B190403148D686A5950CF2C1  // 6 elements, 0x4 bytes
{
    DMM_DIAG_INFO_VISTA_BETA2_VERSION = 4097 /*0x1001*/,
    DMM_DIAG_INFO_VISTA_RC1_VERSION   = 4098 /*0x1002*/,
    DMM_DIAG_INFO_VISTA_RTM_VERSION   = 4099 /*0x1003*/,
    DMM_DIAG_INFO_WIN7_MQ_VERSION     = 8192 /*0x2000*/,
    DMM_DIAG_INFO_WIN7_M3_VERSION     = 8193 /*0x2001*/,
    DMM_DIAG_INFO_VERSION             = 8193 /*0x2001*/
}__201901300B190403148D686A5950CF2C1, *P__201901300B190403148D686A5950CF2C1;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE  // 3 elements, 0x4 bytes
{
    StandardDesign  = 0 /*0x0*/,
    NEC98x86        = 1 /*0x1*/,
    EndAlternatives = 2 /*0x2*/
}ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef enum _BUS_QUERY_ID_TYPE  // 6 elements, 0x4 bytes
{
    BusQueryDeviceID           = 0 /*0x0*/,
    BusQueryHardwareIDs        = 1 /*0x1*/,
    BusQueryCompatibleIDs      = 2 /*0x2*/,
    BusQueryInstanceID         = 3 /*0x3*/,
    BusQueryDeviceSerialNumber = 4 /*0x4*/,
    BusQueryContainerID        = 5 /*0x5*/
}BUS_QUERY_ID_TYPE, *PBUS_QUERY_ID_TYPE;

typedef enum _D3DDDI_GAMMARAMP_TYPE  // 4 elements, 0x4 bytes
{
    D3DDDI_GAMMARAMP_UNINITIALIZED = 0 /*0x0*/,
    D3DDDI_GAMMARAMP_DEFAULT       = 1 /*0x1*/,
    D3DDDI_GAMMARAMP_RGB256x3x16   = 2 /*0x2*/,
    D3DDDI_GAMMARAMP_DXGI_1        = 3 /*0x3*/
}D3DDDI_GAMMARAMP_TYPE, *PD3DDDI_GAMMARAMP_TYPE;

typedef enum _D3DDDI_VIDEO_SIGNAL_SCANLINE_ORDERING  // 5 elements, 0x4 bytes
{
    D3DDDI_VSSLO_UNINITIALIZED              = 0 /*0x0*/,
    D3DDDI_VSSLO_PROGRESSIVE                = 1 /*0x1*/,
    D3DDDI_VSSLO_INTERLACED_UPPERFIELDFIRST = 2 /*0x2*/,
    D3DDDI_VSSLO_INTERLACED_LOWERFIELDFIRST = 3 /*0x3*/,
    D3DDDI_VSSLO_OTHER                      = 255 /*0xFF*/
}D3DDDI_VIDEO_SIGNAL_SCANLINE_ORDERING, *PD3DDDI_VIDEO_SIGNAL_SCANLINE_ORDERING;

typedef enum _D3DDDIFORMAT  // 105 elements, 0x4 bytes
{
    D3DDDIFMT_UNKNOWN                 = 0 /*0x0*/,
    D3DDDIFMT_R8G8B8                  = 20 /*0x14*/,
    D3DDDIFMT_A8R8G8B8                = 21 /*0x15*/,
    D3DDDIFMT_X8R8G8B8                = 22 /*0x16*/,
    D3DDDIFMT_R5G6B5                  = 23 /*0x17*/,
    D3DDDIFMT_X1R5G5B5                = 24 /*0x18*/,
    D3DDDIFMT_A1R5G5B5                = 25 /*0x19*/,
    D3DDDIFMT_A4R4G4B4                = 26 /*0x1A*/,
    D3DDDIFMT_R3G3B2                  = 27 /*0x1B*/,
    D3DDDIFMT_A8                      = 28 /*0x1C*/,
    D3DDDIFMT_A8R3G3B2                = 29 /*0x1D*/,
    D3DDDIFMT_X4R4G4B4                = 30 /*0x1E*/,
    D3DDDIFMT_A2B10G10R10             = 31 /*0x1F*/,
    D3DDDIFMT_A8B8G8R8                = 32 /*0x20*/,
    D3DDDIFMT_X8B8G8R8                = 33 /*0x21*/,
    D3DDDIFMT_G16R16                  = 34 /*0x22*/,
    D3DDDIFMT_A2R10G10B10             = 35 /*0x23*/,
    D3DDDIFMT_A16B16G16R16            = 36 /*0x24*/,
    D3DDDIFMT_A8P8                    = 40 /*0x28*/,
    D3DDDIFMT_P8                      = 41 /*0x29*/,
    D3DDDIFMT_L8                      = 50 /*0x32*/,
    D3DDDIFMT_A8L8                    = 51 /*0x33*/,
    D3DDDIFMT_A4L4                    = 52 /*0x34*/,
    D3DDDIFMT_V8U8                    = 60 /*0x3C*/,
    D3DDDIFMT_L6V5U5                  = 61 /*0x3D*/,
    D3DDDIFMT_X8L8V8U8                = 62 /*0x3E*/,
    D3DDDIFMT_Q8W8V8U8                = 63 /*0x3F*/,
    D3DDDIFMT_V16U16                  = 64 /*0x40*/,
    D3DDDIFMT_W11V11U10               = 65 /*0x41*/,
    D3DDDIFMT_A2W10V10U10             = 67 /*0x43*/,
    D3DDDIFMT_UYVY                    = 1498831189 /*0x59565955*/  /*UYVY*/,
    D3DDDIFMT_R8G8_B8G8               = 1195525970 /*0x47424752*/  /*RGBG*/,
    D3DDDIFMT_YUY2                    = 844715353 /*0x32595559*/  /*YUY2*/,
    D3DDDIFMT_G8R8_G8B8               = 1111970375 /*0x42475247*/  /*GRGB*/,
    D3DDDIFMT_DXT1                    = 827611204 /*0x31545844*/  /*DXT1*/,
    D3DDDIFMT_DXT2                    = 844388420 /*0x32545844*/  /*DXT2*/,
    D3DDDIFMT_DXT3                    = 861165636 /*0x33545844*/  /*DXT3*/,
    D3DDDIFMT_DXT4                    = 877942852 /*0x34545844*/  /*DXT4*/,
    D3DDDIFMT_DXT5                    = 894720068 /*0x35545844*/  /*DXT5*/,
    D3DDDIFMT_D16_LOCKABLE            = 70 /*0x46*/,
    D3DDDIFMT_D32                     = 71 /*0x47*/,
    D3DDDIFMT_D15S1                   = 73 /*0x49*/,
    D3DDDIFMT_D24S8                   = 75 /*0x4B*/,
    D3DDDIFMT_D24X8                   = 77 /*0x4D*/,
    D3DDDIFMT_D24X4S4                 = 79 /*0x4F*/,
    D3DDDIFMT_D16                     = 80 /*0x50*/,
    D3DDDIFMT_D32F_LOCKABLE           = 82 /*0x52*/,
    D3DDDIFMT_D24FS8                  = 83 /*0x53*/,
    D3DDDIFMT_D32_LOCKABLE            = 84 /*0x54*/,
    D3DDDIFMT_S8_LOCKABLE             = 85 /*0x55*/,
    D3DDDIFMT_S1D15                   = 72 /*0x48*/,
    D3DDDIFMT_S8D24                   = 74 /*0x4A*/,
    D3DDDIFMT_X8D24                   = 76 /*0x4C*/,
    D3DDDIFMT_X4S4D24                 = 78 /*0x4E*/,
    D3DDDIFMT_L16                     = 81 /*0x51*/,
    D3DDDIFMT_VERTEXDATA              = 100 /*0x64*/,
    D3DDDIFMT_INDEX16                 = 101 /*0x65*/,
    D3DDDIFMT_INDEX32                 = 102 /*0x66*/,
    D3DDDIFMT_Q16W16V16U16            = 110 /*0x6E*/,
    D3DDDIFMT_MULTI2_ARGB8            = 827606349 /*0x3154454D*/  /*MET1*/,
    D3DDDIFMT_R16F                    = 111 /*0x6F*/,
    D3DDDIFMT_G16R16F                 = 112 /*0x70*/,
    D3DDDIFMT_A16B16G16R16F           = 113 /*0x71*/,
    D3DDDIFMT_R32F                    = 114 /*0x72*/,
    D3DDDIFMT_G32R32F                 = 115 /*0x73*/,
    D3DDDIFMT_A32B32G32R32F           = 116 /*0x74*/,
    D3DDDIFMT_CxV8U8                  = 117 /*0x75*/,
    D3DDDIFMT_A1                      = 118 /*0x76*/,
    D3DDDIFMT_A2B10G10R10_XR_BIAS     = 119 /*0x77*/,
    D3DDDIFMT_DXVACOMPBUFFER_BASE     = 150 /*0x96*/,
    D3DDDIFMT_PICTUREPARAMSDATA       = 150 /*0x96*/,
    D3DDDIFMT_MACROBLOCKDATA          = 151 /*0x97*/,
    D3DDDIFMT_RESIDUALDIFFERENCEDATA  = 152 /*0x98*/,
    D3DDDIFMT_DEBLOCKINGDATA          = 153 /*0x99*/,
    D3DDDIFMT_INVERSEQUANTIZATIONDATA = 154 /*0x9A*/,
    D3DDDIFMT_SLICECONTROLDATA        = 155 /*0x9B*/,
    D3DDDIFMT_BITSTREAMDATA           = 156 /*0x9C*/,
    D3DDDIFMT_MOTIONVECTORBUFFER      = 157 /*0x9D*/,
    D3DDDIFMT_FILMGRAINBUFFER         = 158 /*0x9E*/,
    D3DDDIFMT_DXVA_RESERVED9          = 159 /*0x9F*/,
    D3DDDIFMT_DXVA_RESERVED10         = 160 /*0xA0*/,
    D3DDDIFMT_DXVA_RESERVED11         = 161 /*0xA1*/,
    D3DDDIFMT_DXVA_RESERVED12         = 162 /*0xA2*/,
    D3DDDIFMT_DXVA_RESERVED13         = 163 /*0xA3*/,
    D3DDDIFMT_DXVA_RESERVED14         = 164 /*0xA4*/,
    D3DDDIFMT_DXVA_RESERVED15         = 165 /*0xA5*/,
    D3DDDIFMT_DXVA_RESERVED16         = 166 /*0xA6*/,
    D3DDDIFMT_DXVA_RESERVED17         = 167 /*0xA7*/,
    D3DDDIFMT_DXVA_RESERVED18         = 168 /*0xA8*/,
    D3DDDIFMT_DXVA_RESERVED19         = 169 /*0xA9*/,
    D3DDDIFMT_DXVA_RESERVED20         = 170 /*0xAA*/,
    D3DDDIFMT_DXVA_RESERVED21         = 171 /*0xAB*/,
    D3DDDIFMT_DXVA_RESERVED22         = 172 /*0xAC*/,
    D3DDDIFMT_DXVA_RESERVED23         = 173 /*0xAD*/,
    D3DDDIFMT_DXVA_RESERVED24         = 174 /*0xAE*/,
    D3DDDIFMT_DXVA_RESERVED25         = 175 /*0xAF*/,
    D3DDDIFMT_DXVA_RESERVED26         = 176 /*0xB0*/,
    D3DDDIFMT_DXVA_RESERVED27         = 177 /*0xB1*/,
    D3DDDIFMT_DXVA_RESERVED28         = 178 /*0xB2*/,
    D3DDDIFMT_DXVA_RESERVED29         = 179 /*0xB3*/,
    D3DDDIFMT_DXVA_RESERVED30         = 180 /*0xB4*/,
    D3DDDIFMT_DXVA_RESERVED31         = 181 /*0xB5*/,
    D3DDDIFMT_DXVACOMPBUFFER_MAX      = 181 /*0xB5*/,
    D3DDDIFMT_BINARYBUFFER            = 199 /*0xC7*/,
    D3DDDIFMT_FORCE_UINT              = 2147483647 /*0x7FFFFFFF*/
}D3DDDIFORMAT, *PD3DDDIFORMAT;

typedef enum _D3DKMDT_COLOR_BASIS  // 7 elements, 0x4 bytes
{
    D3DKMDT_CB_UNINITIALIZED = 0 /*0x0*/,
    D3DKMDT_CB_INTENSITY     = 1 /*0x1*/,
    D3DKMDT_CB_SRGB          = 2 /*0x2*/,
    D3DKMDT_CB_SCRGB         = 3 /*0x3*/,
    D3DKMDT_CB_YCBCR         = 4 /*0x4*/,
    D3DKMDT_CB_YPBPR         = 5 /*0x5*/,
    D3DKMDT_CB_MAXVALID      = 5 /*0x5*/
}D3DKMDT_COLOR_BASIS, *PD3DKMDT_COLOR_BASIS;

typedef enum _D3DKMDT_MODE_PREFERENCE  // 4 elements, 0x4 bytes
{
    D3DKMDT_MP_UNINITIALIZED = 0 /*0x0*/,
    D3DKMDT_MP_PREFERRED     = 1 /*0x1*/,
    D3DKMDT_MP_NOTPREFERRED  = 2 /*0x2*/,
    D3DKMDT_MP_MAXVALID      = 2 /*0x2*/
}D3DKMDT_MODE_PREFERENCE, *PD3DKMDT_MODE_PREFERENCE;

typedef enum _D3DKMDT_MONITOR_CAPABILITIES_ORIGIN  // 7 elements, 0x4 bytes
{
    D3DKMDT_MCO_UNINITIALIZED                      = 0 /*0x0*/,
    D3DKMDT_MCO_DEFAULTMONITORPROFILE              = 1 /*0x1*/,
    D3DKMDT_MCO_MONITORDESCRIPTOR                  = 2 /*0x2*/,
    D3DKMDT_MCO_MONITORDESCRIPTOR_REGISTRYOVERRIDE = 3 /*0x3*/,
    D3DKMDT_MCO_SPECIFICCAP_REGISTRYOVERRIDE       = 4 /*0x4*/,
    D3DKMDT_MCO_DRIVER                             = 5 /*0x5*/,
    D3DKMDT_MCO_MAXVALID                           = 5 /*0x5*/
}D3DKMDT_MONITOR_CAPABILITIES_ORIGIN, *PD3DKMDT_MONITOR_CAPABILITIES_ORIGIN;

typedef enum _D3DKMDT_MONITOR_DESCRIPTOR_TYPE  // 4 elements, 0x4 bytes
{
    D3DKMDT_MDT_UNINITIALIZED          = 0 /*0x0*/,
    D3DKMDT_MDT_VESA_EDID_V1_BASEBLOCK = 1 /*0x1*/,
    D3DKMDT_MDT_VESA_EDID_V1_BLOCKMAP  = 2 /*0x2*/,
    D3DKMDT_MDT_OTHER                  = 255 /*0xFF*/
}D3DKMDT_MONITOR_DESCRIPTOR_TYPE, *PD3DKMDT_MONITOR_DESCRIPTOR_TYPE;

typedef enum _D3DKMDT_MONITOR_FREQUENCY_RANGE_CONSTRAINT  // 3 elements, 0x4 bytes
{
    D3DKMDT_MFRC_UNINITIALIZED = 0 /*0x0*/,
    D3DKMDT_MFRC_ACTIVESIZE    = 1 /*0x1*/,
    D3DKMDT_MFRC_MAXPIXELRATE  = 2 /*0x2*/
}D3DKMDT_MONITOR_FREQUENCY_RANGE_CONSTRAINT, *PD3DKMDT_MONITOR_FREQUENCY_RANGE_CONSTRAINT;

typedef enum _D3DKMDT_MONITOR_ORIENTATION  // 5 elements, 0x4 bytes
{
    D3DKMDT_MO_UNINITIALIZED = 0 /*0x0*/,
    D3DKMDT_MO_0DEG          = 1 /*0x1*/,
    D3DKMDT_MO_90DEG         = 2 /*0x2*/,
    D3DKMDT_MO_180DEG        = 3 /*0x3*/,
    D3DKMDT_MO_270DEG        = 4 /*0x4*/
}D3DKMDT_MONITOR_ORIENTATION, *PD3DKMDT_MONITOR_ORIENTATION;

typedef enum _D3DKMDT_MONITOR_TIMING_TYPE  // 8 elements, 0x4 bytes
{
    D3DKMDT_MTT_UNINITIALIZED         = 0 /*0x0*/,
    D3DKMDT_MTT_ESTABLISHED           = 1 /*0x1*/,
    D3DKMDT_MTT_STANDARD              = 2 /*0x2*/,
    D3DKMDT_MTT_EXTRASTANDARD         = 3 /*0x3*/,
    D3DKMDT_MTT_DETAILED              = 4 /*0x4*/,
    D3DKMDT_MTT_DEFAULTMONITORPROFILE = 5 /*0x5*/,
    D3DKMDT_MTT_DRIVER                = 6 /*0x6*/,
    D3DKMDT_MTT_MAXVALID              = 6 /*0x6*/
}D3DKMDT_MONITOR_TIMING_TYPE, *PD3DKMDT_MONITOR_TIMING_TYPE;

typedef enum _D3DKMDT_PIXEL_VALUE_ACCESS_MODE  // 5 elements, 0x4 bytes
{
    D3DKMDT_PVAM_UNINITIALIZED   = 0 /*0x0*/,
    D3DKMDT_PVAM_DIRECT          = 1 /*0x1*/,
    D3DKMDT_PVAM_PRESETPALETTE   = 2 /*0x2*/,
    D3DKMDT_PVAM_SETTABLEPALETTE = 3 /*0x3*/,
    D3DKMDT_PVAM_MAXVALID        = 3 /*0x3*/
}D3DKMDT_PIXEL_VALUE_ACCESS_MODE, *PD3DKMDT_PIXEL_VALUE_ACCESS_MODE;

typedef enum _D3DKMDT_TEXT_RENDERING_FORMAT  // 1 elements, 0x4 bytes
{
    D3DKMDT_TRF_UNINITIALIZED = 0 /*0x0*/
}D3DKMDT_TEXT_RENDERING_FORMAT, *PD3DKMDT_TEXT_RENDERING_FORMAT;

typedef enum _D3DKMDT_VIDEO_OUTPUT_TECHNOLOGY  // 22 elements, 0x4 bytes
{
    D3DKMDT_VOT_UNINITIALIZED        = -2 /*0xFE*/,
    D3DKMDT_VOT_OTHER                = -1 /*0xFF*/,
    D3DKMDT_VOT_HD15                 = 0 /*0x0*/,
    D3DKMDT_VOT_SVIDEO               = 1 /*0x1*/,
    D3DKMDT_VOT_COMPOSITE_VIDEO      = 2 /*0x2*/,
    D3DKMDT_VOT_COMPONENT_VIDEO      = 3 /*0x3*/,
    D3DKMDT_VOT_DVI                  = 4 /*0x4*/,
    D3DKMDT_VOT_HDMI                 = 5 /*0x5*/,
    D3DKMDT_VOT_LVDS                 = 6 /*0x6*/,
    D3DKMDT_VOT_D_JPN                = 8 /*0x8*/,
    D3DKMDT_VOT_SDI                  = 9 /*0x9*/,
    D3DKMDT_VOT_DISPLAYPORT_EXTERNAL = 10 /*0xA*/,
    D3DKMDT_VOT_DISPLAYPORT_EMBEDDED = 11 /*0xB*/,
    D3DKMDT_VOT_UDI_EXTERNAL         = 12 /*0xC*/,
    D3DKMDT_VOT_UDI_EMBEDDED         = 13 /*0xD*/,
    D3DKMDT_VOT_SDTVDONGLE           = 14 /*0xE*/,
    D3DKMDT_VOT_INTERNAL             = -2147483648 /*0x80000000*/,
    D3DKMDT_VOT_SVIDEO_4PIN          = 1 /*0x1*/,
    D3DKMDT_VOT_SVIDEO_7PIN          = 1 /*0x1*/,
    D3DKMDT_VOT_RF                   = 2 /*0x2*/,
    D3DKMDT_VOT_RCA_3COMPONENT       = 3 /*0x3*/,
    D3DKMDT_VOT_BNC                  = 3 /*0x3*/
}D3DKMDT_VIDEO_OUTPUT_TECHNOLOGY, *PD3DKMDT_VIDEO_OUTPUT_TECHNOLOGY;

typedef enum _D3DKMDT_VIDEO_OUTPUT_TECHNOLOGY_DEPRECATED  // 14 elements, 0x4 bytes
{
    D3DKMDT_VOT_DEPRECATED_UNINITIALIZED  = 0 /*0x0*/,
    D3DKMDT_VOT_DEPRECATED_HD15           = 1 /*0x1*/,
    D3DKMDT_VOT_DEPRECATED_DVI            = 2 /*0x2*/,
    D3DKMDT_VOT_DEPRECATED_HDMI           = 3 /*0x3*/,
    D3DKMDT_VOT_DEPRECATED_HDMI2          = 4 /*0x4*/,
    D3DKMDT_VOT_DEPRECATED_SVIDEO_4PIN    = 5 /*0x5*/,
    D3DKMDT_VOT_DEPRECATED_SVIDEO_7PIN    = 6 /*0x6*/,
    D3DKMDT_VOT_DEPRECATED_RCA_COMPOSITE  = 7 /*0x7*/,
    D3DKMDT_VOT_DEPRECATED_RCA_3COMPONENT = 8 /*0x8*/,
    D3DKMDT_VOT_DEPRECATED_BNC            = 9 /*0x9*/,
    D3DKMDT_VOT_DEPRECATED_RF             = 10 /*0xA*/,
    D3DKMDT_VOT_DEPRECATED_SDTVDONGLE     = 11 /*0xB*/,
    D3DKMDT_VOT_DEPRECATED_INTERNAL       = 12 /*0xC*/,
    D3DKMDT_VOT_DEPRECATED_OTHER          = 255 /*0xFF*/
}D3DKMDT_VIDEO_OUTPUT_TECHNOLOGY_DEPRECATED, *PD3DKMDT_VIDEO_OUTPUT_TECHNOLOGY_DEPRECATED;

typedef enum _D3DKMDT_VIDEO_SIGNAL_STANDARD  // 33 elements, 0x4 bytes
{
    D3DKMDT_VSS_UNINITIALIZED = 0 /*0x0*/,
    D3DKMDT_VSS_VESA_DMT      = 1 /*0x1*/,
    D3DKMDT_VSS_VESA_GTF      = 2 /*0x2*/,
    D3DKMDT_VSS_VESA_CVT      = 3 /*0x3*/,
    D3DKMDT_VSS_IBM           = 4 /*0x4*/,
    D3DKMDT_VSS_APPLE         = 5 /*0x5*/,
    D3DKMDT_VSS_NTSC_M        = 6 /*0x6*/,
    D3DKMDT_VSS_NTSC_J        = 7 /*0x7*/,
    D3DKMDT_VSS_NTSC_443      = 8 /*0x8*/,
    D3DKMDT_VSS_PAL_B         = 9 /*0x9*/,
    D3DKMDT_VSS_PAL_B1        = 10 /*0xA*/,
    D3DKMDT_VSS_PAL_G         = 11 /*0xB*/,
    D3DKMDT_VSS_PAL_H         = 12 /*0xC*/,
    D3DKMDT_VSS_PAL_I         = 13 /*0xD*/,
    D3DKMDT_VSS_PAL_D         = 14 /*0xE*/,
    D3DKMDT_VSS_PAL_N         = 15 /*0xF*/,
    D3DKMDT_VSS_PAL_NC        = 16 /*0x10*/,
    D3DKMDT_VSS_SECAM_B       = 17 /*0x11*/,
    D3DKMDT_VSS_SECAM_D       = 18 /*0x12*/,
    D3DKMDT_VSS_SECAM_G       = 19 /*0x13*/,
    D3DKMDT_VSS_SECAM_H       = 20 /*0x14*/,
    D3DKMDT_VSS_SECAM_K       = 21 /*0x15*/,
    D3DKMDT_VSS_SECAM_K1      = 22 /*0x16*/,
    D3DKMDT_VSS_SECAM_L       = 23 /*0x17*/,
    D3DKMDT_VSS_SECAM_L1      = 24 /*0x18*/,
    D3DKMDT_VSS_EIA_861       = 25 /*0x19*/,
    D3DKMDT_VSS_EIA_861A      = 26 /*0x1A*/,
    D3DKMDT_VSS_EIA_861B      = 27 /*0x1B*/,
    D3DKMDT_VSS_PAL_K         = 28 /*0x1C*/,
    D3DKMDT_VSS_PAL_K1        = 29 /*0x1D*/,
    D3DKMDT_VSS_PAL_L         = 30 /*0x1E*/,
    D3DKMDT_VSS_PAL_M         = 31 /*0x1F*/,
    D3DKMDT_VSS_OTHER         = 255 /*0xFF*/
}D3DKMDT_VIDEO_SIGNAL_STANDARD, *PD3DKMDT_VIDEO_SIGNAL_STANDARD;

typedef enum _D3DKMDT_VIDPN_PRESENT_PATH_CONTENT  // 4 elements, 0x4 bytes
{
    D3DKMDT_VPPC_UNINITIALIZED = 0 /*0x0*/,
    D3DKMDT_VPPC_GRAPHICS      = 1 /*0x1*/,
    D3DKMDT_VPPC_VIDEO         = 2 /*0x2*/,
    D3DKMDT_VPPC_NOTSPECIFIED  = 255 /*0xFF*/
}D3DKMDT_VIDPN_PRESENT_PATH_CONTENT, *PD3DKMDT_VIDPN_PRESENT_PATH_CONTENT;

typedef enum _D3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION_TYPE  // 5 elements, 0x4 bytes
{
    D3DKMDT_VPPMT_UNINITIALIZED           = 0 /*0x0*/,
    D3DKMDT_VPPMT_NOPROTECTION            = 1 /*0x1*/,
    D3DKMDT_VPPMT_MACROVISION_APSTRIGGER  = 2 /*0x2*/,
    D3DKMDT_VPPMT_MACROVISION_FULLSUPPORT = 3 /*0x3*/,
    D3DKMDT_VPPMT_NOTSPECIFIED            = 255 /*0xFF*/
}D3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION_TYPE, *PD3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION_TYPE;

typedef enum _D3DKMDT_VIDPN_PRESENT_PATH_IMPORTANCE  // 13 elements, 0x4 bytes
{
    D3DKMDT_VPPI_UNINITIALIZED = 0 /*0x0*/,
    D3DKMDT_VPPI_PRIMARY       = 1 /*0x1*/,
    D3DKMDT_VPPI_SECONDARY     = 2 /*0x2*/,
    D3DKMDT_VPPI_TERTIARY      = 3 /*0x3*/,
    D3DKMDT_VPPI_QUATERNARY    = 4 /*0x4*/,
    D3DKMDT_VPPI_QUINARY       = 5 /*0x5*/,
    D3DKMDT_VPPI_SENARY        = 6 /*0x6*/,
    D3DKMDT_VPPI_SEPTENARY     = 7 /*0x7*/,
    D3DKMDT_VPPI_OCTONARY      = 8 /*0x8*/,
    D3DKMDT_VPPI_NONARY        = 9 /*0x9*/,
    D3DKMDT_VPPI_DENARY        = 10 /*0xA*/,
    D3DKMDT_VPPI_MAX           = 32 /*0x20*/,
    D3DKMDT_VPPI_NOTSPECIFIED  = 255 /*0xFF*/
}D3DKMDT_VIDPN_PRESENT_PATH_IMPORTANCE, *PD3DKMDT_VIDPN_PRESENT_PATH_IMPORTANCE;

typedef enum _D3DKMDT_VIDPN_PRESENT_PATH_ROTATION  // 7 elements, 0x4 bytes
{
    D3DKMDT_VPPR_UNINITIALIZED = 0 /*0x0*/,
    D3DKMDT_VPPR_IDENTITY      = 1 /*0x1*/,
    D3DKMDT_VPPR_ROTATE90      = 2 /*0x2*/,
    D3DKMDT_VPPR_ROTATE180     = 3 /*0x3*/,
    D3DKMDT_VPPR_ROTATE270     = 4 /*0x4*/,
    D3DKMDT_VPPR_UNPINNED      = 254 /*0xFE*/,
    D3DKMDT_VPPR_NOTSPECIFIED  = 255 /*0xFF*/
}D3DKMDT_VIDPN_PRESENT_PATH_ROTATION, *PD3DKMDT_VIDPN_PRESENT_PATH_ROTATION;

typedef enum _D3DKMDT_VIDPN_PRESENT_PATH_SCALING  // 9 elements, 0x4 bytes
{
    D3DKMDT_VPPS_UNINITIALIZED          = 0 /*0x0*/,
    D3DKMDT_VPPS_IDENTITY               = 1 /*0x1*/,
    D3DKMDT_VPPS_CENTERED               = 2 /*0x2*/,
    D3DKMDT_VPPS_STRETCHED              = 3 /*0x3*/,
    D3DKMDT_VPPS_ASPECTRATIOCENTEREDMAX = 4 /*0x4*/,
    D3DKMDT_VPPS_CUSTOM                 = 5 /*0x5*/,
    D3DKMDT_VPPS_RESERVED1              = 253 /*0xFD*/,
    D3DKMDT_VPPS_UNPINNED               = 254 /*0xFE*/,
    D3DKMDT_VPPS_NOTSPECIFIED           = 255 /*0xFF*/
}D3DKMDT_VIDPN_PRESENT_PATH_SCALING, *PD3DKMDT_VIDPN_PRESENT_PATH_SCALING;

typedef enum _D3DKMDT_VIDPN_SOURCE_MODE_TYPE  // 3 elements, 0x4 bytes
{
    D3DKMDT_RMT_UNINITIALIZED = 0 /*0x0*/,
    D3DKMDT_RMT_GRAPHICS      = 1 /*0x1*/,
    D3DKMDT_RMT_TEXT          = 2 /*0x2*/
}D3DKMDT_VIDPN_SOURCE_MODE_TYPE, *PD3DKMDT_VIDPN_SOURCE_MODE_TYPE;

typedef enum _D3DKMT_QUERYRESULT_PREEMPTION_ATTEMPT_RESULT  // 17 elements, 0x4 bytes
{
    D3DKMT_PreemptionAttempt                               = 0 /*0x0*/,
    D3DKMT_PreemptionAttemptSuccess                        = 1 /*0x1*/,
    D3DKMT_PreemptionAttemptMissNoCommand                  = 2 /*0x2*/,
    D3DKMT_PreemptionAttemptMissNotEnabled                 = 3 /*0x3*/,
    D3DKMT_PreemptionAttemptMissNextFence                  = 4 /*0x4*/,
    D3DKMT_PreemptionAttemptMissPagingCommand              = 5 /*0x5*/,
    D3DKMT_PreemptionAttemptMissSplittedCommand            = 6 /*0x6*/,
    D3DKMT_PreemptionAttemptMissFenceCommand               = 7 /*0x7*/,
    D3DKMT_PreemptionAttemptMissRenderPendingFlip          = 8 /*0x8*/,
    D3DKMT_PreemptionAttemptMissNotMakingProgress          = 9 /*0x9*/,
    D3DKMT_PreemptionAttemptMissLessPriority               = 10 /*0xA*/,
    D3DKMT_PreemptionAttemptMissRemainingQuantum           = 11 /*0xB*/,
    D3DKMT_PreemptionAttemptMissRemainingPreemptionQuantum = 12 /*0xC*/,
    D3DKMT_PreemptionAttemptMissAlreadyPreempting          = 13 /*0xD*/,
    D3DKMT_PreemptionAttemptMissGlobalBlock                = 14 /*0xE*/,
    D3DKMT_PreemptionAttemptMissAlreadyRunning             = 15 /*0xF*/,
    D3DKMT_PreemptionAttemptStatisticsMax                  = 16 /*0x10*/
}D3DKMT_QUERYRESULT_PREEMPTION_ATTEMPT_RESULT, *PD3DKMT_QUERYRESULT_PREEMPTION_ATTEMPT_RESULT;

typedef enum _D3DKMT_QUERYSTATISTICS_ALLOCATION_PRIORITY_CLASS  // 6 elements, 0x4 bytes
{
    D3DKMT_AllocationPriorityClassMinimum = 0 /*0x0*/,
    D3DKMT_AllocationPriorityClassLow     = 1 /*0x1*/,
    D3DKMT_AllocationPriorityClassNormal  = 2 /*0x2*/,
    D3DKMT_AllocationPriorityClassHigh    = 3 /*0x3*/,
    D3DKMT_AllocationPriorityClassMaximum = 4 /*0x4*/,
    D3DKMT_MaxAllocationPriorityClass     = 5 /*0x5*/
}D3DKMT_QUERYSTATISTICS_ALLOCATION_PRIORITY_CLASS, *PD3DKMT_QUERYSTATISTICS_ALLOCATION_PRIORITY_CLASS;

typedef enum _D3DKMT_QUERYSTATISTICS_DMA_PACKET_TYPE  // 5 elements, 0x4 bytes
{
    D3DKMT_ClientRenderBuffer     = 0 /*0x0*/,
    D3DKMT_ClientPagingBuffer     = 1 /*0x1*/,
    D3DKMT_SystemPagingBuffer     = 2 /*0x2*/,
    D3DKMT_SystemPreemptionBuffer = 3 /*0x3*/,
    D3DKMT_DmaPacketTypeMax       = 4 /*0x4*/
}D3DKMT_QUERYSTATISTICS_DMA_PACKET_TYPE, *PD3DKMT_QUERYSTATISTICS_DMA_PACKET_TYPE;

typedef enum _D3DKMT_QUERYSTATISTICS_QUEUE_PACKET_TYPE  // 9 elements, 0x4 bytes
{
    D3DKMT_RenderCommandBuffer   = 0 /*0x0*/,
    D3DKMT_DeferredCommandBuffer = 1 /*0x1*/,
    D3DKMT_SystemCommandBuffer   = 2 /*0x2*/,
    D3DKMT_MmIoFlipCommandBuffer = 3 /*0x3*/,
    D3DKMT_WaitCommandBuffer     = 4 /*0x4*/,
    D3DKMT_SignalCommandBuffer   = 5 /*0x5*/,
    D3DKMT_DeviceCommandBuffer   = 6 /*0x6*/,
    D3DKMT_SoftwareCommandBuffer = 7 /*0x7*/,
    D3DKMT_QueuePacketTypeMax    = 8 /*0x8*/
}D3DKMT_QUERYSTATISTICS_QUEUE_PACKET_TYPE, *PD3DKMT_QUERYSTATISTICS_QUEUE_PACKET_TYPE;

typedef enum _DEVICE_POWER_STATE  // 6 elements, 0x4 bytes
{
    PowerDeviceUnspecified = 0 /*0x0*/,
    PowerDeviceD0          = 1 /*0x1*/,
    PowerDeviceD1          = 2 /*0x2*/,
    PowerDeviceD2          = 3 /*0x3*/,
    PowerDeviceD3          = 4 /*0x4*/,
    PowerDeviceMaximum     = 5 /*0x5*/
}DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_RELATION_TYPE  // 7 elements, 0x4 bytes
{
    BusRelations         = 0 /*0x0*/,
    EjectionRelations    = 1 /*0x1*/,
    PowerRelations       = 2 /*0x2*/,
    RemovalRelations     = 3 /*0x3*/,
    TargetDeviceRelation = 4 /*0x4*/,
    SingleBusRelations   = 5 /*0x5*/,
    TransportRelations   = 6 /*0x6*/
}DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _DEVICE_TEXT_TYPE  // 2 elements, 0x4 bytes
{
    DeviceTextDescription         = 0 /*0x0*/,
    DeviceTextLocationInformation = 1 /*0x1*/
}DEVICE_TEXT_TYPE, *PDEVICE_TEXT_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE  // 4 elements, 0x4 bytes
{
    DeviceUsageTypeUndefined   = 0 /*0x0*/,
    DeviceUsageTypePaging      = 1 /*0x1*/,
    DeviceUsageTypeHibernation = 2 /*0x2*/,
    DeviceUsageTypeDumpFile    = 3 /*0x3*/
}DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum _DISPLAYCONFIG_SCANLINE_ORDERING  // 6 elements, 0x4 bytes
{
    DISPLAYCONFIG_SCANLINE_ORDERING_UNSPECIFIED                = 0 /*0x0*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_PROGRESSIVE                = 1 /*0x1*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED                 = 2 /*0x2*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_UPPERFIELDFIRST = 2 /*0x2*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_LOWERFIELDFIRST = 3 /*0x3*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_FORCE_UINT32               = -1 /*0xFF*/
}DISPLAYCONFIG_SCANLINE_ORDERING, *PDISPLAYCONFIG_SCANLINE_ORDERING;

typedef enum _DMM_CLIENT_TYPE  // 5 elements, 0x4 bytes
{
    DMM_CT_UNINITIALIZED  = 0 /*0x0*/,
    DMM_CT_CDD_NOPATHDATA = 1 /*0x1*/,
    DMM_CT_USERMODE       = 2 /*0x2*/,
    DMM_CT_CDD_PATHDATA   = 3 /*0x3*/,
    DMM_CT_DXGPORT        = 4 /*0x4*/
}DMM_CLIENT_TYPE, *PDMM_CLIENT_TYPE;

typedef enum _DMM_MODE_PRUNING_ALGORITHM  // 5 elements, 0x4 bytes
{
    DMM_MPA_UNINITIALIZED   = 0 /*0x0*/,
    DMM_MPA_GDI             = 1 /*0x1*/,
    DMM_MPA_VISTA           = 2 /*0x2*/,
    DMM_MPA_GDI_VISTA_UNION = 3 /*0x3*/,
    DMM_MPA_MAXVALID        = 3 /*0x3*/
}DMM_MODE_PRUNING_ALGORITHM, *PDMM_MODE_PRUNING_ALGORITHM;

typedef enum _DMM_MONITOR_PRESENCE_EVENT_TYPE  // 17 elements, 0x4 bytes
{
    DMM_MPET_UNINITIALIZED          = 0 /*0x0*/,
    DMM_MPET_ADDMONITOR             = 1 /*0x1*/,
    DMM_MPET_REMOVEMONITOR          = 2 /*0x2*/,
    DMM_MPET_DRIVERARRIVAL          = 3 /*0x3*/,
    DMM_MPET_DRIVERQUERYREMOVE      = 4 /*0x4*/,
    DMM_MPET_DRIVERREMOVECANCELLED  = 5 /*0x5*/,
    DMM_MPET_DRIVERREMOVECOMPLETE   = 6 /*0x6*/,
    DMM_MPET_DEVICENODEREADY        = 7 /*0x7*/,
    DMM_MPET_EDIDCHANGE             = 8 /*0x8*/,
    DMM_MPET_MONITORDISABLE         = 9 /*0x9*/,
    DMM_MPET_MONITORENABLE          = 10 /*0xA*/,
    DMM_MPET_ADAPTERADD             = 11 /*0xB*/,
    DMM_MPET_ADAPTERREMOVAL         = 12 /*0xC*/,
    DMM_MPET_INVALIDATION           = 13 /*0xD*/,
    DMM_MPET_ADDSIMULATEDMONITOR    = 1073741825 /*0x40000001*/,
    DMM_MPET_REMOVESIMULATEDMONITOR = 1073741826 /*0x40000002*/,
    DMM_MPET_MAXVALID               = 1073741826 /*0x40000002*/
}DMM_MONITOR_PRESENCE_EVENT_TYPE, *PDMM_MONITOR_PRESENCE_EVENT_TYPE;

typedef enum _DMM_VIDPN_MONITOR_TYPE  // 6 elements, 0x4 bytes
{
    DMM_VMT_UNINITIALIZED           = 0 /*0x0*/,
    DMM_VMT_PHYSICAL_MONITOR        = 1 /*0x1*/,
    DMM_VMT_BOOT_PERSISTENT_MONITOR = 2 /*0x2*/,
    DMM_VMT_PERSISTENT_MONITOR      = 3 /*0x3*/,
    DMM_VMT_TEMPORARY_MONITOR       = 4 /*0x4*/,
    DMM_VMT_SIMULATED_MONITOR       = 5 /*0x5*/
}DMM_VIDPN_MONITOR_TYPE, *PDMM_VIDPN_MONITOR_TYPE;

typedef enum _DMM_VIDPNCHANGE_TYPE  // 6 elements, 0x4 bytes
{
    DMM_CVR_UNINITIALIZED  = 0 /*0x0*/,
    DMM_CVR_UPDATEMODALITY = 1 /*0x1*/,
    DMM_CVR_ADDPATH        = 2 /*0x2*/,
    DMM_CVR_ADDPATHS       = 3 /*0x3*/,
    DMM_CVR_REMOVEPATH     = 4 /*0x4*/,
    DMM_CVR_REMOVEALLPATHS = 5 /*0x5*/
}DMM_VIDPNCHANGE_TYPE, *PDMM_VIDPNCHANGE_TYPE;

typedef enum _DXGK_DIAG_CODE_POINT_TYPE  // 66 elements, 0x4 bytes
{
    DXGK_DIAG_CODE_POINT_TYPE_NONE                                           = 0 /*0x0*/,
    DXGK_DIAG_CODE_POINT_TYPE_RECOMMEND_FUNC_VIDPN                           = 1 /*0x1*/,
    DXGK_DIAG_CODE_POINT_TYPE_OS_RECOMMENDED_VIDPN                           = 2 /*0x2*/,
    DXGK_DIAG_CODE_POINT_TYPE_SDC_LOG_FAILURE                                = 3 /*0x3*/,
    DXGK_DIAG_CODE_POINT_TYPE_SDC_INVALIDATE_ERROR                           = 4 /*0x4*/,
    DXGK_DIAG_CODE_POINT_TYPE_CDS_LOG_FAILURE                                = 5 /*0x5*/,
    DXGK_DIAG_CODE_POINT_TYPE_CDS_FAILURE_DB                                 = 7 /*0x7*/,
    DXGK_DIAG_CODE_POINT_TYPE_RETRIEVE_BTL                                   = 8 /*0x8*/,
    DXGK_DIAG_CODE_POINT_TYPE_RETRIEVE_DB                                    = 9 /*0x9*/,
    DXGK_DIAG_CODE_POINT_TYPE_QDC_LOG_FAILURE                                = 10 /*0xA*/,
    DXGK_DIAG_CODE_POINT_TYPE_POWER_ON_GDI                                   = 11 /*0xB*/,
    DXGK_DIAG_CODE_POINT_TYPE_POWER_OFF_GDI                                  = 12 /*0xC*/,
    DXGK_DIAG_CODE_POINT_TYPE_POWER_ON_MONITOR                               = 13 /*0xD*/,
    DXGK_DIAG_CODE_POINT_TYPE_POWER_OFF_MONITOR                              = 14 /*0xE*/,
    DXGK_DIAG_CODE_POINT_TYPE_POWER_DIM_MONITOR                              = 15 /*0xF*/,
    DXGK_DIAG_CODE_POINT_TYPE_POWER_UNDIM_MONITOR                            = 16 /*0x10*/,
    DXGK_DIAG_CODE_POINT_TYPE_BML_BACKTRACK                                  = 17 /*0x11*/,
    DXGK_DIAG_CODE_POINT_TYPE_BML_CLOSEST_TARGET_MODE                        = 18 /*0x12*/,
    DXGK_DIAG_CODE_POINT_TYPE_BML_NO_EXACT_SOURCE_MODE                       = 19 /*0x13*/,
    DXGK_DIAG_CODE_POINT_TYPE_BML_NO_EXACT_TARGET_MODE                       = 20 /*0x14*/,
    DXGK_DIAG_CODE_POINT_TYPE_BML_SOURCE_MODE_NOT_PINNED                     = 21 /*0x15*/,
    DXGK_DIAG_CODE_POINT_TYPE_BML_TARGET_MODE_NOT_PINNED                     = 22 /*0x16*/,
    DXGK_DIAG_CODE_POINT_TYPE_BML_RESTARTED                                  = 23 /*0x17*/,
    DXGK_DIAG_CODE_POINT_TYPE_TDR                                            = 24 /*0x18*/,
    DXGK_DIAG_CODE_POINT_TYPE_ACPI_EVENT_NOTIFICATION                        = 25 /*0x19*/,
    DXGK_DIAG_CODE_POINT_TYPE_CREATEMDEV_USE_DEFAULT_MODE                    = 26 /*0x1A*/,
    DXGK_DIAG_CODE_POINT_TYPE_CONNECTED_SET_LOG_FAILURE                      = 27 /*0x1B*/,
    DXGK_DIAG_CODE_POINT_TYPE_INVALIDATE_DXGK_MODE_CACHE                     = 28 /*0x1C*/,
    DXGK_DIAG_CODE_POINT_TYPE_REBUILD_DXGK_MODE_CACHE                        = 29 /*0x1D*/,
    DXGK_DIAG_CODE_POINT_TYPE_CREATEFUNVIDPN_RELAX_REFRESH_MATCH             = 30 /*0x1E*/,
    DXGK_DIAG_CODE_POINT_TYPE_CREATEFUNVIDPN_CCDBML_FAIL_VISTABML_SUCCESSED  = 31 /*0x1F*/,
    DXGK_DIAG_CODE_POINT_TYPE_BML_BEST_SOURCE_MODE                           = 32 /*0x20*/,
    DXGK_DIAG_CODE_POINT_TYPE_BML_BEST_TARGET_MODE                           = 33 /*0x21*/,
    DXGK_DIAG_CODE_POINT_TYPE_ADD_DEVICE                                     = 34 /*0x22*/,
    DXGK_DIAG_CODE_POINT_TYPE_START_ADAPTER                                  = 35 /*0x23*/,
    DXGK_DIAG_CODE_POINT_TYPE_STOP_ADAPTER                                   = 36 /*0x24*/,
    DXGK_DIAG_CODE_POINT_TYPE_CHILD_POLLING                                  = 37 /*0x25*/,
    DXGK_DIAG_CODE_POINT_TYPE_CHILD_POLLING_TARGET                           = 38 /*0x26*/,
    DXGK_DIAG_CODE_POINT_TYPE_INDICATE_CHILD_STATUS                          = 39 /*0x27*/,
    DXGK_DIAG_CODE_POINT_TYPE_HANDLE_IRP                                     = 40 /*0x28*/,
    DXGK_DIAG_CODE_POINT_TYPE_CHANGE_UNSUPPORTED_MONITOR_MODE_FLAG           = 41 /*0x29*/,
    DXGK_DIAG_CODE_POINT_TYPE_ACPI_NOTIFY_CALLBACK                           = 42 /*0x2A*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_EXCLUDE_EVICTALL_DISABLEGDI   = 43 /*0x2B*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_EXCLUDE_EVICTALL_ENABLEGDI    = 44 /*0x2C*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_EXCLUDE_MODESWITCH            = 45 /*0x2D*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_SYNC_MONITOR_EVENT            = 46 /*0x2E*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_PNP_NOTIFY_GDI                = 47 /*0x2F*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_PNP_ENABLE_VGA                = 48 /*0x30*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_TDR_SWITCH_GDI                = 49 /*0x31*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_CDD_CREATE_DEVICE_FAILED      = 50 /*0x32*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_CDD_DEVICE_REMOVED            = 51 /*0x33*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_CDD_DRVASSERTMODE_TRUE_FAILED = 52 /*0x34*/,
    DXGK_DIAG_CODE_POINT_TYPE_VIDEOPORTCALLOUT_CDD_RECREATE_DEVICE_FAILED    = 53 /*0x35*/,
    DXGK_DIAG_CODE_POINT_TYPE_CDD_MAPSHADOWBUFFER_FAILED                     = 54 /*0x36*/,
    DXGK_DIAG_CODE_POINT_TYPE_COMMIT_VIDPN_LOG_FAILURE                       = 55 /*0x37*/,
    DXGK_DIAG_CODE_POINT_TYPE_DRIVER_RECOMMEND_LOG_FAILURE                   = 56 /*0x38*/,
    DXGK_DIAG_CODE_POINT_TYPE_SDC_ENFORCED_CLONE_PATH_INVALID_SOURCE_IDX     = 57 /*0x39*/,
    DXGK_DIAG_CODE_POINT_TYPE_DRVPROBEANDCAPTURE_FAILED                      = 58 /*0x3A*/,
    DXGK_DIAG_CODE_POINT_TYPE_DXGKCDDENABLE_OPTIMIZED_MODE_CHANGE            = 59 /*0x3B*/,
    DXGK_DIAG_CODE_POINT_TYPE_DXGKSETDISPLAYMODE_OPTIMIZED_MODE_CHANGE       = 60 /*0x3C*/,
    DXGK_DIAG_CODE_POINT_TYPE_MON_DEPART_GETRECENTTOP_FAIL                   = 61 /*0x3D*/,
    DXGK_DIAG_CODE_POINT_TYPE_MON_ARRIVE_INC_ADD_FAIL                        = 62 /*0x3E*/,
    DXGK_DIAG_CODE_POINT_TYPE_CCD_DATABASE_PERSIST                           = 63 /*0x3F*/,
    DXGK_DIAG_CODE_POINT_TYPE_CCD_DATABASE_PERSIST_NO_CONNECTIVITY_HASH      = 64 /*0x40*/,
    DXGK_DIAG_CODE_POINT_TYPE_MAX                                            = 64 /*0x40*/,
    DXGK_DIAG_CODE_POINT_TYPE_FORCE_UINT32                                   = -1 /*0xFF*/
}DXGK_DIAG_CODE_POINT_TYPE, *PDXGK_DIAG_CODE_POINT_TYPE;

typedef enum _DXGK_DIAG_TYPE  // 17 elements, 0x4 bytes
{
    DXGK_DIAG_TYPE_NONE                   = 0 /*0x0*/,
    DXGK_DIAG_TYPE_SDC                    = 1 /*0x1*/,
    DXGK_DIAG_TYPE_HPD                    = 2 /*0x2*/,
    DXGK_DIAG_TYPE_DC_ORIGIN              = 3 /*0x3*/,
    DXGK_DIAG_TYPE_USER_CDS               = 4 /*0x4*/,
    DXGK_DIAG_TYPE_DRV_CDS                = 5 /*0x5*/,
    DXGK_DIAG_TYPE_CODE_POINT             = 6 /*0x6*/,
    DXGK_DIAG_TYPE_QDC                    = 7 /*0x7*/,
    DXGK_DIAG_TYPE_MONITOR_MGR            = 8 /*0x8*/,
    DXGK_DIAG_TYPE_CONNECTEDSET_NOT_FOUND = 9 /*0x9*/,
    DXGK_DIAG_TYPE_DISPDIAG_COLLECTED     = 10 /*0xA*/,
    DXGK_DIAG_TYPE_BML_PACKET             = 11 /*0xB*/,
    DXGK_DIAG_TYPE_BML_PACKET_EX          = 12 /*0xC*/,
    DXGK_DIAG_TYPE_COMMIT_VIDPN_FAILED    = 13 /*0xD*/,
    DXGK_DIAG_TYPE_DRIVER_RECOMMEND_VIDPN = 14 /*0xE*/,
    DXGK_DIAG_TYPE_MAX                    = 14 /*0xE*/,
    DXGK_DIAG_TYPE_FORCE_UINT32           = -1 /*0xFF*/
}DXGK_DIAG_TYPE, *PDXGK_DIAG_TYPE;

typedef enum _DXGK_RECOMMENDFUNCTIONALVIDPN_REASON  // 3 elements, 0x4 bytes
{
    DXGK_RFVR_UNINITIALIZED = 0 /*0x0*/,
    DXGK_RFVR_HOTKEY        = 1 /*0x1*/,
    DXGK_RFVR_USERMODE      = 2 /*0x2*/
}DXGK_RECOMMENDFUNCTIONALVIDPN_REASON, *PDXGK_RECOMMENDFUNCTIONALVIDPN_REASON;

typedef enum _eTHRESHOLD_MARGIN_DIRECTION  // 5 elements, 0x4 bytes
{
    ThresholdMarginTop    = 0 /*0x0*/,
    ThresholdMarginLeft   = 1 /*0x1*/,
    ThresholdMarginRight  = 2 /*0x2*/,
    ThresholdMarginBottom = 3 /*0x3*/,
    ThresholdMarginMax    = 4 /*0x4*/
}eTHRESHOLD_MARGIN_DIRECTION, *PeTHRESHOLD_MARGIN_DIRECTION;

typedef enum _ETW_THREAD_FLAG  // 4 elements, 0x4 bytes
{
    ETW_THREAD_FLAG_HAD_INPUT           = 0 /*0x0*/,
    ETW_THREAD_FLAG_HAD_VISIBLE_WINDOWS = 1 /*0x1*/,
    ETW_THREAD_FLAG_HAS_NEW_INPUT       = 2 /*0x2*/,
    ETW_THREAD_FLAG_MAX                 = 3 /*0x3*/
}ETW_THREAD_FLAG, *PETW_THREAD_FLAG;

typedef enum _EVENT_TYPE  // 2 elements, 0x4 bytes
{
    NotificationEvent    = 0 /*0x0*/,
    SynchronizationEvent = 1 /*0x1*/
}EVENT_TYPE, *PEVENT_TYPE;

typedef enum _EX_POOL_PRIORITY  // 9 elements, 0x4 bytes
{
    LowPoolPriority                       = 0 /*0x0*/,
    LowPoolPrioritySpecialPoolOverrun     = 8 /*0x8*/,
    LowPoolPrioritySpecialPoolUnderrun    = 9 /*0x9*/,
    NormalPoolPriority                    = 16 /*0x10*/,
    NormalPoolPrioritySpecialPoolOverrun  = 24 /*0x18*/,
    NormalPoolPrioritySpecialPoolUnderrun = 25 /*0x19*/,
    HighPoolPriority                      = 32 /*0x20*/,
    HighPoolPrioritySpecialPoolOverrun    = 40 /*0x28*/,
    HighPoolPrioritySpecialPoolUnderrun   = 41 /*0x29*/
}EX_POOL_PRIORITY, *PEX_POOL_PRIORITY;

typedef enum _EXCEPTION_DISPOSITION  // 4 elements, 0x4 bytes
{
    ExceptionContinueExecution = 0 /*0x0*/,
    ExceptionContinueSearch    = 1 /*0x1*/,
    ExceptionNestedException   = 2 /*0x2*/,
    ExceptionCollidedUnwind    = 3 /*0x3*/
}EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _FILE_INFORMATION_CLASS  // 56 elements, 0x4 bytes
{
    FileDirectoryInformation                = 1 /*0x1*/,
    FileFullDirectoryInformation            = 2 /*0x2*/,
    FileBothDirectoryInformation            = 3 /*0x3*/,
    FileBasicInformation                    = 4 /*0x4*/,
    FileStandardInformation                 = 5 /*0x5*/,
    FileInternalInformation                 = 6 /*0x6*/,
    FileEaInformation                       = 7 /*0x7*/,
    FileAccessInformation                   = 8 /*0x8*/,
    FileNameInformation                     = 9 /*0x9*/,
    FileRenameInformation                   = 10 /*0xA*/,
    FileLinkInformation                     = 11 /*0xB*/,
    FileNamesInformation                    = 12 /*0xC*/,
    FileDispositionInformation              = 13 /*0xD*/,
    FilePositionInformation                 = 14 /*0xE*/,
    FileFullEaInformation                   = 15 /*0xF*/,
    FileModeInformation                     = 16 /*0x10*/,
    FileAlignmentInformation                = 17 /*0x11*/,
    FileAllInformation                      = 18 /*0x12*/,
    FileAllocationInformation               = 19 /*0x13*/,
    FileEndOfFileInformation                = 20 /*0x14*/,
    FileAlternateNameInformation            = 21 /*0x15*/,
    FileStreamInformation                   = 22 /*0x16*/,
    FilePipeInformation                     = 23 /*0x17*/,
    FilePipeLocalInformation                = 24 /*0x18*/,
    FilePipeRemoteInformation               = 25 /*0x19*/,
    FileMailslotQueryInformation            = 26 /*0x1A*/,
    FileMailslotSetInformation              = 27 /*0x1B*/,
    FileCompressionInformation              = 28 /*0x1C*/,
    FileObjectIdInformation                 = 29 /*0x1D*/,
    FileCompletionInformation               = 30 /*0x1E*/,
    FileMoveClusterInformation              = 31 /*0x1F*/,
    FileQuotaInformation                    = 32 /*0x20*/,
    FileReparsePointInformation             = 33 /*0x21*/,
    FileNetworkOpenInformation              = 34 /*0x22*/,
    FileAttributeTagInformation             = 35 /*0x23*/,
    FileTrackingInformation                 = 36 /*0x24*/,
    FileIdBothDirectoryInformation          = 37 /*0x25*/,
    FileIdFullDirectoryInformation          = 38 /*0x26*/,
    FileValidDataLengthInformation          = 39 /*0x27*/,
    FileShortNameInformation                = 40 /*0x28*/,
    FileIoCompletionNotificationInformation = 41 /*0x29*/,
    FileIoStatusBlockRangeInformation       = 42 /*0x2A*/,
    FileIoPriorityHintInformation           = 43 /*0x2B*/,
    FileSfioReserveInformation              = 44 /*0x2C*/,
    FileSfioVolumeInformation               = 45 /*0x2D*/,
    FileHardLinkInformation                 = 46 /*0x2E*/,
    FileProcessIdsUsingFileInformation      = 47 /*0x2F*/,
    FileNormalizedNameInformation           = 48 /*0x30*/,
    FileNetworkPhysicalNameInformation      = 49 /*0x31*/,
    FileIdGlobalTxDirectoryInformation      = 50 /*0x32*/,
    FileIsRemoteDeviceInformation           = 51 /*0x33*/,
    FileAttributeCacheInformation           = 52 /*0x34*/,
    FileNumaNodeInformation                 = 53 /*0x35*/,
    FileStandardLinkInformation             = 54 /*0x36*/,
    FileRemoteProtocolInformation           = 55 /*0x37*/,
    FileMaximumInformation                  = 56 /*0x38*/
}FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FSINFOCLASS  // 11 elements, 0x4 bytes
{
    FileFsVolumeInformation      = 1 /*0x1*/,
    FileFsLabelInformation       = 2 /*0x2*/,
    FileFsSizeInformation        = 3 /*0x3*/,
    FileFsDeviceInformation      = 4 /*0x4*/,
    FileFsAttributeInformation   = 5 /*0x5*/,
    FileFsControlInformation     = 6 /*0x6*/,
    FileFsFullSizeInformation    = 7 /*0x7*/,
    FileFsObjectIdInformation    = 8 /*0x8*/,
    FileFsDriverPathInformation  = 9 /*0x9*/,
    FileFsVolumeFlagsInformation = 10 /*0xA*/,
    FileFsMaximumInformation     = 11 /*0xB*/
}FSINFOCLASS, *PFSINFOCLASS;

typedef enum _INTERFACE_TYPE  // 19 elements, 0x4 bytes
{
    InterfaceTypeUndefined = -1 /*0xFF*/,
    Internal               = 0 /*0x0*/,
    Isa                    = 1 /*0x1*/,
    Eisa                   = 2 /*0x2*/,
    MicroChannel           = 3 /*0x3*/,
    TurboChannel           = 4 /*0x4*/,
    PCIBus                 = 5 /*0x5*/,
    VMEBus                 = 6 /*0x6*/,
    NuBus                  = 7 /*0x7*/,
    PCMCIABus              = 8 /*0x8*/,
    CBus                   = 9 /*0x9*/,
    MPIBus                 = 10 /*0xA*/,
    MPSABus                = 11 /*0xB*/,
    ProcessorInternal      = 12 /*0xC*/,
    InternalPowerBus       = 13 /*0xD*/,
    PNPISABus              = 14 /*0xE*/,
    PNPBus                 = 15 /*0xF*/,
    Vmcs                   = 16 /*0x10*/,
    MaximumInterfaceType   = 17 /*0x11*/
}INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _INTERLOCKED_RESULT  // 3 elements, 0x4 bytes
{
    ResultNegative = 1 /*0x1*/,
    ResultZero     = 0 /*0x0*/,
    ResultPositive = 2 /*0x2*/
}INTERLOCKED_RESULT, *PINTERLOCKED_RESULT;

typedef enum _IO_ALLOCATION_ACTION  // 3 elements, 0x4 bytes
{
    KeepObject                    = 1 /*0x1*/,
    DeallocateObject              = 2 /*0x2*/,
    DeallocateObjectKeepRegisters = 3 /*0x3*/
}IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _IRQ_PRIORITY  // 4 elements, 0x4 bytes
{
    IrqPriorityUndefined = 0 /*0x0*/,
    IrqPriorityLow       = 1 /*0x1*/,
    IrqPriorityNormal    = 2 /*0x2*/,
    IrqPriorityHigh      = 3 /*0x3*/
}IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef enum _MEMORY_CACHING_TYPE_ORIG  // 1 elements, 0x4 bytes
{
    MmFrameBufferCached = 2 /*0x2*/
}MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _MODE  // 3 elements, 0x4 bytes
{
    KernelMode  = 0 /*0x0*/,
    UserMode    = 1 /*0x1*/,
    MaximumMode = 2 /*0x2*/
}MODE, *PMODE;

typedef enum _MOVERECT_STYLE  // 4 elements, 0x4 bytes
{
    MoveRectKeepPositionAtCursor         = 0 /*0x0*/,
    MoveRectMidTopAtCursor               = 1 /*0x1*/,
    MoveRectKeepAspectRatioAtCursor      = 2 /*0x2*/,
    MoveRectSidewiseKeepPositionAtCursor = 3 /*0x3*/
}MOVERECT_STYLE, *PMOVERECT_STYLE;

typedef enum _NT_PRODUCT_TYPE  // 3 elements, 0x4 bytes
{
    NtProductWinNt    = 1 /*0x1*/,
    NtProductLanManNt = 2 /*0x2*/,
    NtProductServer   = 3 /*0x3*/
}NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _OB_OPEN_REASON  // 5 elements, 0x4 bytes
{
    ObCreateHandle    = 0 /*0x0*/,
    ObOpenHandle      = 1 /*0x1*/,
    ObDuplicateHandle = 2 /*0x2*/,
    ObInheritHandle   = 3 /*0x3*/,
    ObMaxOpenReason   = 4 /*0x4*/
}OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _POOL_TYPE  // 15 elements, 0x4 bytes
{
    NonPagedPool                         = 0 /*0x0*/,
    PagedPool                            = 1 /*0x1*/,
    NonPagedPoolMustSucceed              = 2 /*0x2*/,
    DontUseThisType                      = 3 /*0x3*/,
    NonPagedPoolCacheAligned             = 4 /*0x4*/,
    PagedPoolCacheAligned                = 5 /*0x5*/,
    NonPagedPoolCacheAlignedMustS        = 6 /*0x6*/,
    MaxPoolType                          = 7 /*0x7*/,
    NonPagedPoolSession                  = 32 /*0x20*/,
    PagedPoolSession                     = 33 /*0x21*/,
    NonPagedPoolMustSucceedSession       = 34 /*0x22*/,
    DontUseThisTypeSession               = 35 /*0x23*/,
    NonPagedPoolCacheAlignedSession      = 36 /*0x24*/,
    PagedPoolCacheAlignedSession         = 37 /*0x25*/,
    NonPagedPoolCacheAlignedMustSSession = 38 /*0x26*/
}POOL_TYPE, *PPOOL_TYPE;

typedef enum _POWER_ACTION  // 8 elements, 0x4 bytes
{
    PowerActionNone          = 0 /*0x0*/,
    PowerActionReserved      = 1 /*0x1*/,
    PowerActionSleep         = 2 /*0x2*/,
    PowerActionHibernate     = 3 /*0x3*/,
    PowerActionShutdown      = 4 /*0x4*/,
    PowerActionShutdownReset = 5 /*0x5*/,
    PowerActionShutdownOff   = 6 /*0x6*/,
    PowerActionWarmEject     = 7 /*0x7*/
}POWER_ACTION, *PPOWER_ACTION;

typedef enum _POWER_STATE_TYPE  // 2 elements, 0x4 bytes
{
    SystemPowerState = 0 /*0x0*/,
    DevicePowerState = 1 /*0x1*/
}POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef enum _PROFILE_MAP  // 51 elements, 0x4 bytes
{
    PMAP_COLORS                     = 0 /*0x0*/,
    PMAP_CURSORS                    = 1 /*0x1*/,
    PMAP_WINDOWSM                   = 2 /*0x2*/,
    PMAP_WINDOWSU                   = 3 /*0x3*/,
    PMAP_DESKTOP                    = 4 /*0x4*/,
    PMAP_ICONS                      = 5 /*0x5*/,
    PMAP_FONTS                      = 6 /*0x6*/,
    PMAP_TRUETYPE                   = 7 /*0x7*/,
    PMAP_KBDLAYOUT                  = 8 /*0x8*/,
    PMAP_INPUT                      = 9 /*0x9*/,
    PMAP_SUBSYSTEMS                 = 10 /*0xA*/,
    PMAP_BEEP                       = 11 /*0xB*/,
    PMAP_MOUSE                      = 12 /*0xC*/,
    PMAP_KEYBOARD                   = 13 /*0xD*/,
    PMAP_STICKYKEYS                 = 14 /*0xE*/,
    PMAP_KEYBOARDRESPONSE           = 15 /*0xF*/,
    PMAP_MOUSEKEYS                  = 16 /*0x10*/,
    PMAP_TOGGLEKEYS                 = 17 /*0x11*/,
    PMAP_TIMEOUT                    = 18 /*0x12*/,
    PMAP_SOUNDSENTRY                = 19 /*0x13*/,
    PMAP_SHOWSOUNDS                 = 20 /*0x14*/,
    PMAP_AEDEBUG                    = 21 /*0x15*/,
    PMAP_NETWORK                    = 22 /*0x16*/,
    PMAP_METRICS                    = 23 /*0x17*/,
    PMAP_UKBDLAYOUT                 = 24 /*0x18*/,
    PMAP_UKBDLAYOUTTOGGLE           = 25 /*0x19*/,
    PMAP_WINLOGON                   = 26 /*0x1A*/,
    PMAP_KEYBOARDPREF               = 27 /*0x1B*/,
    PMAP_SCREENREADER               = 28 /*0x1C*/,
    PMAP_HIGHCONTRAST               = 29 /*0x1D*/,
    PMAP_IMECOMPAT                  = 30 /*0x1E*/,
    PMAP_IMM                        = 31 /*0x1F*/,
    PMAP_POOLLIMITS                 = 32 /*0x20*/,
    PMAP_COMPAT32                   = 33 /*0x21*/,
    PMAP_SETUPPROGRAMNAMES          = 34 /*0x22*/,
    PMAP_INPUTMETHOD                = 35 /*0x23*/,
    PMAP_MOUCLASS_PARAMS            = 36 /*0x24*/,
    PMAP_KBDCLASS_PARAMS            = 37 /*0x25*/,
    PMAP_COMPUTERNAME               = 38 /*0x26*/,
    PMAP_TS                         = 39 /*0x27*/,
    PMAP_TABLETPC                   = 40 /*0x28*/,
    PMAP_MEDIACENTER                = 41 /*0x29*/,
    PMAP_TS_EXCLUDE_DESKTOP_VERSION = 42 /*0x2A*/,
    PMAP_WOW64_COMPAT32             = 43 /*0x2B*/,
    PMAP_WOW64_IMECOMPAT            = 44 /*0x2C*/,
    PMAP_SERVERR2                   = 45 /*0x2D*/,
    PMAP_STARTER                    = 46 /*0x2E*/,
    PMAP_ACCESS                     = 47 /*0x2F*/,
    PMAP_AUDIODESCRIPTION           = 48 /*0x30*/,
    PMAP_CONTROL                    = 49 /*0x31*/,
    PMAP_LAST                       = 49 /*0x31*/
}PROFILE_MAP, *PPROFILE_MAP;

typedef enum _PS_ATTRIBUTE_NUM  // 18 elements, 0x4 bytes
{
    PsAttributeParentProcess  = 0 /*0x0*/,
    PsAttributeDebugObject    = 1 /*0x1*/,
    PsAttributeToken          = 2 /*0x2*/,
    PsAttributeClientId       = 3 /*0x3*/,
    PsAttributeTebAddress     = 4 /*0x4*/,
    PsAttributeImageName      = 5 /*0x5*/,
    PsAttributeImageInfo      = 6 /*0x6*/,
    PsAttributeMemoryReserve  = 7 /*0x7*/,
    PsAttributePriorityClass  = 8 /*0x8*/,
    PsAttributeErrorMode      = 9 /*0x9*/,
    PsAttributeStdHandleInfo  = 10 /*0xA*/,
    PsAttributeHandleList     = 11 /*0xB*/,
    PsAttributeGroupAffinity  = 12 /*0xC*/,
    PsAttributePreferredNode  = 13 /*0xD*/,
    PsAttributeIdealProcessor = 14 /*0xE*/,
    PsAttributeUmsThread      = 15 /*0xF*/,
    PsAttributeExecuteOptions = 16 /*0x10*/,
    PsAttributeMax            = 17 /*0x11*/
}PS_ATTRIBUTE_NUM, *PPS_ATTRIBUTE_NUM;

typedef enum _PS_CREATE_STATE  // 8 elements, 0x4 bytes
{
    PsCreateInitialState        = 0 /*0x0*/,
    PsCreateFailOnFileOpen      = 1 /*0x1*/,
    PsCreateFailOnSectionCreate = 2 /*0x2*/,
    PsCreateFailExeFormat       = 3 /*0x3*/,
    PsCreateFailMachineMismatch = 4 /*0x4*/,
    PsCreateFailExeName         = 5 /*0x5*/,
    PsCreateSuccess             = 6 /*0x6*/,
    PsCreateMaximumStates       = 7 /*0x7*/
}PS_CREATE_STATE, *PPS_CREATE_STATE;

typedef enum _PS_IFEO_KEY_STATE  // 4 elements, 0x4 bytes
{
    PsReadIFEOAllValues = 0 /*0x0*/,
    PsSkipIFEODebugger  = 1 /*0x1*/,
    PsSkipAllIFEO       = 2 /*0x2*/,
    PsMaxIFEOKeyStates  = 3 /*0x3*/
}PS_IFEO_KEY_STATE, *PPS_IFEO_KEY_STATE;

typedef enum _PS_STD_HANDLE_STATE  // 4 elements, 0x4 bytes
{
    PsNeverDuplicate     = 0 /*0x0*/,
    PsRequestDuplicate   = 1 /*0x1*/,
    PsAlwaysDuplicate    = 2 /*0x2*/,
    PsMaxStdHandleStates = 3 /*0x3*/
}PS_STD_HANDLE_STATE, *PPS_STD_HANDLE_STATE;

typedef enum _REG_NOTIFY_CLASS  // 59 elements, 0x4 bytes
{
    RegNtDeleteKey                    = 0 /*0x0*/,
    RegNtPreDeleteKey                 = 0 /*0x0*/,
    RegNtSetValueKey                  = 1 /*0x1*/,
    RegNtPreSetValueKey               = 1 /*0x1*/,
    RegNtDeleteValueKey               = 2 /*0x2*/,
    RegNtPreDeleteValueKey            = 2 /*0x2*/,
    RegNtSetInformationKey            = 3 /*0x3*/,
    RegNtPreSetInformationKey         = 3 /*0x3*/,
    RegNtRenameKey                    = 4 /*0x4*/,
    RegNtPreRenameKey                 = 4 /*0x4*/,
    RegNtEnumerateKey                 = 5 /*0x5*/,
    RegNtPreEnumerateKey              = 5 /*0x5*/,
    RegNtEnumerateValueKey            = 6 /*0x6*/,
    RegNtPreEnumerateValueKey         = 6 /*0x6*/,
    RegNtQueryKey                     = 7 /*0x7*/,
    RegNtPreQueryKey                  = 7 /*0x7*/,
    RegNtQueryValueKey                = 8 /*0x8*/,
    RegNtPreQueryValueKey             = 8 /*0x8*/,
    RegNtQueryMultipleValueKey        = 9 /*0x9*/,
    RegNtPreQueryMultipleValueKey     = 9 /*0x9*/,
    RegNtPreCreateKey                 = 10 /*0xA*/,
    RegNtPostCreateKey                = 11 /*0xB*/,
    RegNtPreOpenKey                   = 12 /*0xC*/,
    RegNtPostOpenKey                  = 13 /*0xD*/,
    RegNtKeyHandleClose               = 14 /*0xE*/,
    RegNtPreKeyHandleClose            = 14 /*0xE*/,
    RegNtPostDeleteKey                = 15 /*0xF*/,
    RegNtPostSetValueKey              = 16 /*0x10*/,
    RegNtPostDeleteValueKey           = 17 /*0x11*/,
    RegNtPostSetInformationKey        = 18 /*0x12*/,
    RegNtPostRenameKey                = 19 /*0x13*/,
    RegNtPostEnumerateKey             = 20 /*0x14*/,
    RegNtPostEnumerateValueKey        = 21 /*0x15*/,
    RegNtPostQueryKey                 = 22 /*0x16*/,
    RegNtPostQueryValueKey            = 23 /*0x17*/,
    RegNtPostQueryMultipleValueKey    = 24 /*0x18*/,
    RegNtPostKeyHandleClose           = 25 /*0x19*/,
    RegNtPreCreateKeyEx               = 26 /*0x1A*/,
    RegNtPostCreateKeyEx              = 27 /*0x1B*/,
    RegNtPreOpenKeyEx                 = 28 /*0x1C*/,
    RegNtPostOpenKeyEx                = 29 /*0x1D*/,
    RegNtPreFlushKey                  = 30 /*0x1E*/,
    RegNtPostFlushKey                 = 31 /*0x1F*/,
    RegNtPreLoadKey                   = 32 /*0x20*/,
    RegNtPostLoadKey                  = 33 /*0x21*/,
    RegNtPreUnLoadKey                 = 34 /*0x22*/,
    RegNtPostUnLoadKey                = 35 /*0x23*/,
    RegNtPreQueryKeySecurity          = 36 /*0x24*/,
    RegNtPostQueryKeySecurity         = 37 /*0x25*/,
    RegNtPreSetKeySecurity            = 38 /*0x26*/,
    RegNtPostSetKeySecurity           = 39 /*0x27*/,
    RegNtCallbackObjectContextCleanup = 40 /*0x28*/,
    RegNtPreRestoreKey                = 41 /*0x29*/,
    RegNtPostRestoreKey               = 42 /*0x2A*/,
    RegNtPreSaveKey                   = 43 /*0x2B*/,
    RegNtPostSaveKey                  = 44 /*0x2C*/,
    RegNtPreReplaceKey                = 45 /*0x2D*/,
    RegNtPostReplaceKey               = 46 /*0x2E*/,
    MaxRegNtNotifyClass               = 47 /*0x2F*/
}REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef enum _ReplacesCorHdrNumericDefines  // 24 elements, 0x4 bytes
{
    COMIMAGE_FLAGS_ILONLY                      = 1 /*0x1*/,
    COMIMAGE_FLAGS_32BITREQUIRED               = 2 /*0x2*/,
    COMIMAGE_FLAGS_IL_LIBRARY                  = 4 /*0x4*/,
    COMIMAGE_FLAGS_STRONGNAMESIGNED            = 8 /*0x8*/,
    COMIMAGE_FLAGS_NATIVE_ENTRYPOINT           = 16 /*0x10*/,
    COMIMAGE_FLAGS_TRACKDEBUGDATA              = 65536 /*0x10000*/,
    COR_VERSION_MAJOR_V2                       = 2 /*0x2*/,
    COR_VERSION_MAJOR                          = 2 /*0x2*/,
    COR_VERSION_MINOR                          = 0 /*0x0*/,
    COR_DELETED_NAME_LENGTH                    = 8 /*0x8*/,
    COR_VTABLEGAP_NAME_LENGTH                  = 8 /*0x8*/,
    NATIVE_TYPE_MAX_CB                         = 1 /*0x1*/,
    COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE       = 255 /*0xFF*/,
    IMAGE_COR_MIH_METHODRVA                    = 1 /*0x1*/,
    IMAGE_COR_MIH_EHRVA                        = 2 /*0x2*/,
    IMAGE_COR_MIH_BASICBLOCK                   = 8 /*0x8*/,
    COR_VTABLE_32BIT                           = 1 /*0x1*/,
    COR_VTABLE_64BIT                           = 2 /*0x2*/,
    COR_VTABLE_FROM_UNMANAGED                  = 4 /*0x4*/,
    COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8 /*0x8*/,
    COR_VTABLE_CALL_MOST_DERIVED               = 16 /*0x10*/,
    IMAGE_COR_EATJ_THUNK_SIZE                  = 32 /*0x20*/,
    MAX_CLASS_NAME                             = 1024 /*0x400*/,
    MAX_PACKAGE_NAME                           = 1024 /*0x400*/
}ReplacesCorHdrNumericDefines, *PReplacesCorHdrNumericDefines;

typedef enum _RTL_GENERIC_COMPARE_RESULTS  // 3 elements, 0x4 bytes
{
    GenericLessThan    = 0 /*0x0*/,
    GenericGreaterThan = 1 /*0x1*/,
    GenericEqual       = 2 /*0x2*/
}RTL_GENERIC_COMPARE_RESULTS, *PRTL_GENERIC_COMPARE_RESULTS;

typedef enum _SECURITY_IMPERSONATION_LEVEL  // 4 elements, 0x4 bytes
{
    SecurityAnonymous      = 0 /*0x0*/,
    SecurityIdentification = 1 /*0x1*/,
    SecurityImpersonation  = 2 /*0x2*/,
    SecurityDelegation     = 3 /*0x3*/
}SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _SECURITY_OPERATION_CODE  // 4 elements, 0x4 bytes
{
    SetSecurityDescriptor    = 0 /*0x0*/,
    QuerySecurityDescriptor  = 1 /*0x1*/,
    DeleteSecurityDescriptor = 2 /*0x2*/,
    AssignSecurityDescriptor = 3 /*0x3*/
}SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _SM_RANGE_TYPES  // 3 elements, 0x4 bytes
{
    SmRangeSharedInfo    = 0 /*0x0*/,
    SmRangeNonSharedInfo = 1 /*0x1*/,
    SmRangeBool          = 2 /*0x2*/
}SM_RANGE_TYPES, *PSM_RANGE_TYPES;

typedef enum _SM_STORAGE_MODIFIER  // 2 elements, 0x4 bytes
{
    SmStorageActual    = 0 /*0x0*/,
    SmStorageNonActual = 1 /*0x1*/
}SM_STORAGE_MODIFIER, *PSM_STORAGE_MODIFIER;

typedef enum _SYSTEM_POWER_STATE  // 8 elements, 0x4 bytes
{
    PowerSystemUnspecified = 0 /*0x0*/,
    PowerSystemWorking     = 1 /*0x1*/,
    PowerSystemSleeping1   = 2 /*0x2*/,
    PowerSystemSleeping2   = 3 /*0x3*/,
    PowerSystemSleeping3   = 4 /*0x4*/,
    PowerSystemHibernate   = 5 /*0x5*/,
    PowerSystemShutdown    = 6 /*0x6*/,
    PowerSystemMaximum     = 7 /*0x7*/
}SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _THRESHOLD_SELECTOR  // 8 elements, 0x4 bytes
{
    ThresholdMouse         = 0 /*0x0*/,
    ThresholdPen           = 1 /*0x1*/,
    ThresholdMouseDragOut  = 2 /*0x2*/,
    ThresholdPenDragOut    = 3 /*0x3*/,
    ThresholdMouseSideMove = 4 /*0x4*/,
    ThresholdPenSideMove   = 5 /*0x5*/,
    ThresholdAlways        = 6 /*0x6*/,
    ThresholdLast          = 7 /*0x7*/
}THRESHOLD_SELECTOR, *PTHRESHOLD_SELECTOR;

typedef enum _TOUCHSTATE  // 9 elements, 0x4 bytes
{
    TOUCHSTATE_INVALID         = -1 /*0xFF*/,
    TOUCHSTATE_NONE            = 0 /*0x0*/,
    TOUCHSTATE_DOWN            = 1 /*0x1*/,
    TOUCHSTATE_MOVE            = 2 /*0x2*/,
    TOUCHSTATE_UPOUTOFRANGE    = 3 /*0x3*/,
    TOUCHSTATE_INAIR           = 4 /*0x4*/,
    TOUCHSTATE_INAIRMOVE       = 5 /*0x5*/,
    TOUCHSTATE_INAIROUTOFRANGE = 6 /*0x6*/,
    TOUCHSTATE_COUNT           = 7 /*0x7*/
}TOUCHSTATE, *PTOUCHSTATE;

typedef enum _TP_CALLBACK_PRIORITY  // 4 elements, 0x4 bytes
{
    TP_CALLBACK_PRIORITY_HIGH    = 0 /*0x0*/,
    TP_CALLBACK_PRIORITY_NORMAL  = 1 /*0x1*/,
    TP_CALLBACK_PRIORITY_LOW     = 2 /*0x2*/,
    TP_CALLBACK_PRIORITY_INVALID = 3 /*0x3*/
}TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT  // 9 elements, 0x4 bytes
{
    WheaDataFormatIPFSalRecord = 0 /*0x0*/,
    WheaDataFormatXPFMCA       = 1 /*0x1*/,
    WheaDataFormatMemory       = 2 /*0x2*/,
    WheaDataFormatPCIExpress   = 3 /*0x3*/,
    WheaDataFormatNMIPort      = 4 /*0x4*/,
    WheaDataFormatPCIXBus      = 5 /*0x5*/,
    WheaDataFormatPCIXDevice   = 6 /*0x6*/,
    WheaDataFormatGeneric      = 7 /*0x7*/,
    WheaDataFormatMax          = 8 /*0x8*/
}WHEA_ERROR_PACKET_DATA_FORMAT, *PWHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _WHEA_ERROR_SEVERITY  // 4 elements, 0x4 bytes
{
    WheaErrSevRecoverable   = 0 /*0x0*/,
    WheaErrSevFatal         = 1 /*0x1*/,
    WheaErrSevCorrected     = 2 /*0x2*/,
    WheaErrSevInformational = 3 /*0x3*/
}WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_SOURCE_TYPE  // 13 elements, 0x4 bytes
{
    WheaErrSrcTypeMCE        = 0 /*0x0*/,
    WheaErrSrcTypeCMC        = 1 /*0x1*/,
    WheaErrSrcTypeCPE        = 2 /*0x2*/,
    WheaErrSrcTypeNMI        = 3 /*0x3*/,
    WheaErrSrcTypePCIe       = 4 /*0x4*/,
    WheaErrSrcTypeGeneric    = 5 /*0x5*/,
    WheaErrSrcTypeINIT       = 6 /*0x6*/,
    WheaErrSrcTypeBOOT       = 7 /*0x7*/,
    WheaErrSrcTypeSCIGeneric = 8 /*0x8*/,
    WheaErrSrcTypeIPFMCA     = 9 /*0x9*/,
    WheaErrSrcTypeIPFCMC     = 10 /*0xA*/,
    WheaErrSrcTypeIPFCPE     = 11 /*0xB*/,
    WheaErrSrcTypeMax        = 12 /*0xC*/
}WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_TYPE  // 7 elements, 0x4 bytes
{
    WheaErrTypeProcessor  = 0 /*0x0*/,
    WheaErrTypeMemory     = 1 /*0x1*/,
    WheaErrTypePCIExpress = 2 /*0x2*/,
    WheaErrTypeNMI        = 3 /*0x3*/,
    WheaErrTypePCIXBus    = 4 /*0x4*/,
    WheaErrTypePCIXDevice = 5 /*0x5*/,
    WheaErrTypeGeneric    = 6 /*0x6*/
}WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef enum _WINDOW_ARRANGEMENT_COMMAND  // 10 elements, 0x4 bytes
{
    WARR_MOVE_FIRST              = 10 /*0xA*/,
    WARR_RESTORE_UP              = 10 /*0xA*/,
    WARR_RESTORE_DOWN            = 11 /*0xB*/,
    WARR_VRESTORE_UP             = 12 /*0xC*/,
    WARR_VRESTORE_DOWN           = 13 /*0xD*/,
    WARR_VMAXIMIZE_RIGHT         = 14 /*0xE*/,
    WARR_VMAXIMIZE_LEFT          = 15 /*0xF*/,
    WARR_MOVE_NEXT_MONITOR_LEFT  = 16 /*0x10*/,
    WARR_MOVE_NEXT_MONITOR_RIGHT = 17 /*0x11*/,
    WARR_MOVE_LAST               = 18 /*0x12*/
}WINDOW_ARRANGEMENT_COMMAND, *PWINDOW_ARRANGEMENT_COMMAND;

typedef enum _WINDOWCOMPOSITIONATTRIB  // 19 elements, 0x4 bytes
{
    WCA_UNDEFINED                     = 0 /*0x0*/,
    WCA_NCRENDERING_ENABLED           = 1 /*0x1*/,
    WCA_NCRENDERING_POLICY            = 2 /*0x2*/,
    WCA_TRANSITIONS_FORCEDISABLED     = 3 /*0x3*/,
    WCA_ALLOW_NCPAINT                 = 4 /*0x4*/,
    WCA_CAPTION_BUTTON_BOUNDS         = 5 /*0x5*/,
    WCA_NONCLIENT_RTL_LAYOUT          = 6 /*0x6*/,
    WCA_FORCE_ICONIC_REPRESENTATION   = 7 /*0x7*/,
    WCA_FLIP3D_POLICY                 = 8 /*0x8*/,
    WCA_EXTENDED_FRAME_BOUNDS         = 9 /*0x9*/,
    WCA_HAS_ICONIC_BITMAP             = 10 /*0xA*/,
    WCA_THEME_ATTRIBUTES              = 11 /*0xB*/,
    WCA_NCRENDERING_EXILED            = 12 /*0xC*/,
    WCA_NCADORNMENTINFO               = 13 /*0xD*/,
    WCA_EXCLUDED_FROM_LIVEPREVIEW     = 14 /*0xE*/,
    WCA_VIDEO_OVERLAY_ACTIVE          = 15 /*0xF*/,
    WCA_FORCE_ACTIVEWINDOW_APPEARANCE = 16 /*0x10*/,
    WCA_DISALLOW_PEEK                 = 17 /*0x11*/,
    WCA_LAST                          = 18 /*0x12*/
}WINDOWCOMPOSITIONATTRIB, *PWINDOWCOMPOSITIONATTRIB;

typedef enum _WOW64_SHARED_INFORMATION  // 13 elements, 0x4 bytes
{
    SharedNtdll32LdrInitializeThunk                  = 0 /*0x0*/,
    SharedNtdll32KiUserExceptionDispatcher           = 1 /*0x1*/,
    SharedNtdll32KiUserApcDispatcher                 = 2 /*0x2*/,
    SharedNtdll32KiUserCallbackDispatcher            = 3 /*0x3*/,
    SharedNtdll32LdrHotPatchRoutine                  = 4 /*0x4*/,
    SharedNtdll32ExpInterlockedPopEntrySListFault    = 5 /*0x5*/,
    SharedNtdll32ExpInterlockedPopEntrySListResume   = 6 /*0x6*/,
    SharedNtdll32ExpInterlockedPopEntrySListEnd      = 7 /*0x7*/,
    SharedNtdll32RtlUserThreadStart                  = 8 /*0x8*/,
    SharedNtdll32pQueryProcessDebugInformationRemote = 9 /*0x9*/,
    SharedNtdll32EtwpNotificationThread              = 10 /*0xA*/,
    SharedNtdll32BaseAddress                         = 11 /*0xB*/,
    Wow64SharedPageEntriesCount                      = 12 /*0xC*/
}WOW64_SHARED_INFORMATION, *PWOW64_SHARED_INFORMATION;


//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Function types

typedef VOID (NEAR CDECL FUNCT_00A3_00A2_CleanupGroupCancelCallback_DeRefSecurityDescriptor) (VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_00AA_FinalizationCallback) (struct _TP_CALLBACK_INSTANCE*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_00C7_ExecuteCallback) (struct _TP_CALLBACK_INSTANCE*, struct _TP_TASK*);
typedef VOID (NEAR CDECL FUNCT_00A3_00CC_Unposted) (struct _TP_TASK*, struct _TP_POOL*);
typedef VOID (NEAR CDECL FUNCT_00A3_00DF_Callback) (struct _TP_CALLBACK_INSTANCE*, struct _TP_DIRECT*, VOID*, struct _IO_STATUS_BLOCK*);
typedef enum _EXCEPTION_DISPOSITION (NEAR CDECL FUNCT_0160_015F_Handler) (struct _EXCEPTION_RECORD*, VOID*, struct _CONTEXT*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_0284_PostProcessInitRoutine) ();
typedef VOID* (NEAR CDECL FUNCT_00A6_0458_AllocateEx) (enum _POOL_TYPE, UINT64, ULONG32, struct _LOOKASIDE_LIST_EX*);
typedef VOID* (NEAR CDECL FUNCT_00A6_045F_Allocate) (enum _POOL_TYPE, UINT64, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_0464_FreeEx) (VOID*, struct _LOOKASIDE_LIST_EX*);
typedef VOID (NEAR CDECL FUNCT_00A3_0468_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_pfnFree) (VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_04CA_UserApcRoutine) (VOID*, struct _IO_STATUS_BLOCK*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_04CF_CancelRoutine_DriverStartIo) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0505_AddDevice) (struct _DRIVER_OBJECT*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0528_FastIoCheckIfPossible) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0568_FastIoRead_FastIoWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, VOID*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0572_FastIoQueryBasicInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_BASIC_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0580_FastIoQueryStandardInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_STANDARD_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_058E_FastIoLock) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, UINT8, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0599_FastIoUnlockSingle) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_05A2_FastIoUnlockAll) (struct _FILE_OBJECT*, struct _EPROCESS*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_05A8_FastIoUnlockAllByKey) (struct _FILE_OBJECT*, VOID*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_05AF_FastIoDeviceControl) (struct _FILE_OBJECT*, UINT8, VOID*, ULONG32, VOID*, ULONG32, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR CDECL FUNCT_00A3_05BA_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection) (struct _FILE_OBJECT*);
typedef VOID (NEAR CDECL FUNCT_00A3_05BD_FastIoDetachDevice) (struct _DEVICE_OBJECT*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_05C1_FastIoQueryNetworkOpenInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_05D1_AcquireForModWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _ERESOURCE**, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_05F4_MdlRead_PrepareMdlWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_05FE_MdlReadComplete_MdlReadCompleteCompressed) (struct _FILE_OBJECT*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0603_MdlWriteComplete_MdlWriteCompleteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0609_FastIoReadCompressed_FastIoWriteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, VOID*, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _COMPRESSED_DATA_INFO*, ULONG32, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_061E_FastIoQueryOpen) (struct _IRP*, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0623_ReleaseForModWrite) (struct _FILE_OBJECT*, struct _ERESOURCE*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0628_AcquireForCcFlush_ReleaseForCcFlush) (struct _FILE_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_062C_DriverInit) (struct _DRIVER_OBJECT*, struct _UNICODE_STRING*);
typedef VOID (NEAR CDECL FUNCT_00A3_0630_DriverUnload) (struct _DRIVER_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0634_MajorFunction) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef enum _IO_ALLOCATION_ACTION (NEAR CDECL FUNCT_0648_0647_DeviceRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_065C_DeferredRoutine) (struct _KDPC*, VOID*, VOID*, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_005B_08DA_CompletionRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_08F9_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_08F0_KernelRoutine) (struct _KAPC*, FUNCT_00A3_08F9_NormalRoutine**, VOID**, VOID**, VOID**);
typedef VOID (NEAR CDECL FUNCT_00A3_08F9_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_08FE_RundownRoutine) (struct _KAPC*);
typedef VOID (NEAR CDECL FUNCT_00A3_0928_PutDmaAdapter_FreeAdapterChannel) (struct _DMA_ADAPTER*);
typedef VOID* (NEAR CDECL FUNCT_00A6_092C_AllocateCommonBuffer) (struct _DMA_ADAPTER*, ULONG32, union _LARGE_INTEGER*, UINT8);
typedef VOID (NEAR CDECL FUNCT_00A3_0932_FreeCommonBuffer) (struct _DMA_ADAPTER*, ULONG32, union _LARGE_INTEGER, VOID*, UINT8);
typedef LONG32 (NEAR CDECL FUNCT_005B_0939_AllocateAdapterChannel) (struct _DMA_ADAPTER*, struct _DEVICE_OBJECT*, ULONG32, FUNCT_0648_0647_DeviceRoutine*, VOID*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0940_FlushAdapterBuffers) (struct _DMA_ADAPTER*, struct _MDL*, VOID*, VOID*, ULONG32, UINT8);
typedef VOID (NEAR CDECL FUNCT_00A3_0948_FreeMapRegisters) (struct _DMA_ADAPTER*, VOID*, ULONG32);
typedef union _LARGE_INTEGER (NEAR CDECL FUNCT_006D_094D_MapTransfer) (struct _DMA_ADAPTER*, struct _MDL*, VOID*, VOID*, ULONG32*, UINT8);
typedef ULONG32 (NEAR CDECL FUNCT_0009_0955_GetDmaAlignment_ReadDmaCounter) (struct _DMA_ADAPTER*);
typedef VOID (NEAR CDECL FUNCT_00A3_0961) (struct _DEVICE_OBJECT*, struct _IRP*, struct _SCATTER_GATHER_LIST*, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0957_GetScatterGatherList) (struct _DMA_ADAPTER*, struct _DEVICE_OBJECT*, struct _MDL*, VOID*, ULONG32, FUNCT_00A3_0961*, VOID*, UINT8);
typedef VOID (NEAR CDECL FUNCT_00A3_0961) (struct _DEVICE_OBJECT*, struct _IRP*, struct _SCATTER_GATHER_LIST*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_0971_PutScatterGatherList) (struct _DMA_ADAPTER*, struct _SCATTER_GATHER_LIST*, UINT8);
typedef LONG32 (NEAR CDECL FUNCT_005B_0976_CalculateScatterGatherList) (struct _DMA_ADAPTER*, struct _MDL*, VOID*, ULONG32, ULONG32*, ULONG32*);
typedef LONG32 (NEAR CDECL FUNCT_005B_097E_BuildScatterGatherList) (struct _DMA_ADAPTER*, struct _DEVICE_OBJECT*, struct _MDL*, VOID*, ULONG32, FUNCT_00A3_0961*, VOID*, UINT8, VOID*, ULONG32);
typedef LONG32 (NEAR CDECL FUNCT_005B_098A_BuildMdlFromScatterGatherList) (struct _DMA_ADAPTER*, struct _SCATTER_GATHER_LIST*, struct _MDL*, struct _MDL**);
typedef VOID (NEAR CDECL FUNCT_00A3_09D1_DumpProcedure) (VOID*, struct _OBJECT_DUMP_CONTROL*);
typedef LONG32 (NEAR CDECL FUNCT_005B_09D9_OpenProcedure) (enum _OB_OPEN_REASON, CHAR, struct _EPROCESS*, VOID*, ULONG32*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_09E7_CloseProcedure) (struct _EPROCESS*, VOID*, UINT64, UINT64);
typedef LONG32 (NEAR CDECL FUNCT_005B_09ED_ParseProcedure) (VOID*, VOID*, struct _ACCESS_STATE*, CHAR, ULONG32, struct _UNICODE_STRING*, struct _UNICODE_STRING*, VOID*, struct _SECURITY_QUALITY_OF_SERVICE*, VOID**);
typedef LONG32 (NEAR CDECL FUNCT_005B_09F9_SecurityProcedure) (VOID*, enum _SECURITY_OPERATION_CODE, ULONG32*, VOID*, ULONG32*, VOID**, enum _POOL_TYPE, struct _GENERIC_MAPPING*, CHAR);
typedef LONG32 (NEAR CDECL FUNCT_005B_0A0A_QueryNameProcedure) (VOID*, UINT8, struct _OBJECT_NAME_INFORMATION*, ULONG32, ULONG32*, CHAR);
typedef UINT8 (NEAR CDECL FUNCT_0065_0A15_OkayToCloseProcedure) (struct _EPROCESS*, VOID*, VOID*, CHAR);
typedef enum _RTL_GENERIC_COMPARE_RESULTS (NEAR CDECL FUNCT_0EBB_0EBA_CompareRoutine) (struct _RTL_AVL_TABLE*, VOID*, VOID*);
typedef VOID* (NEAR CDECL FUNCT_00A6_0EC4_AllocateRoutine) (struct _RTL_AVL_TABLE*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_0EC8_FreeRoutine) (struct _RTL_AVL_TABLE*, VOID*);
typedef INT64 (NEAR CDECL FUNCT_0075_0FAD_lpfnWndProc_aStoCidPfn) (struct _tagWND*, UINT32, UINT64, INT64);
typedef VOID (NEAR CDECL FUNCT_00A3_1255_lpResultCallBack) (struct _HWND__*, UINT32, UINT64, INT64);
typedef VOID (NEAR CDECL FUNCT_00A3_1310_xxxpfnSB) (struct _tagWND*, UINT32, UINT64, INT64, struct _tagSBCALC*);
typedef INT64 (NEAR CDECL FUNCT_0075_144C_mpFnidPfn) (struct _tagWND*, UINT32, UINT64, INT64, UINT64);
typedef INT64 (NEAR CDECL FUNCT_0075_146D_pfnScrollBarWndProc_pfnTitleWndProc_pfnMenuWndProc_pfnDesktopWndProc_pfnDefWindowProc_pfnMessageWindowProc_pfnSwitchWindowProc_pfnButtonWndProc_pfnComboBoxWndProc_pfnComboListBoxProc_pfnDialogWndProc_pfnEditWndProc_pfnListBoxWndProc_pfnMDIClientWndProc_pfnStaticWndProc_pfnImeWndProc_pfnGhostWndProc_pfnHkINLPCWPSTRUCT_pfnHkINLPCWPRETSTRUCT_pfnDispatchHook_pfnDispatchDefWindowProc_pfnDispatchMessage_pfnMDIActivateDlgProc_pfnCtfHookProc) (/*NoType*/);

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Structure types

          typedef struct _ACCESS_REASONS // 1 elements, 0x80 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      Data[32];                                        
          }ACCESS_REASONS, *PACCESS_REASONS;                                   
                                                                            
          typedef struct _LUID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     ULONG32      LowPart;                                    
/*0x004*/     LONG32       HighPart;                                   
          }LUID, *PLUID;                                               
                                                                       
          typedef struct _SECURITY_SUBJECT_CONTEXT                   // 4 elements, 0x20 bytes (sizeof) 
          {                                                                                             
/*0x000*/     VOID*        ClientToken;                                                                 
/*0x008*/     enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                                    
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                             
/*0x010*/     VOID*        PrimaryToken;                                                                
/*0x018*/     VOID*        ProcessAuditId;                                                              
          }SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT;                                        
                                                                                                        
          typedef struct _LUID_AND_ATTRIBUTES // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _LUID Luid;              // 2 elements, 0x8 bytes (sizeof) 
/*0x008*/     ULONG32      Attributes;                                          
          }LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES;                                  
                                                                                
          typedef struct _INITIAL_PRIVILEGE_SET         // 3 elements, 0x2C bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[3];                                    
          }INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET;                                   
                                                                                           
          typedef struct _PRIVILEGE_SET                 // 3 elements, 0x14 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[1];                                    
          }PRIVILEGE_SET, *PPRIVILEGE_SET;                                                 
                                                                                           
          typedef struct _UNICODE_STRING    // 3 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT16       Length;                                             
/*0x002*/     UINT16       MaximumLength;                                      
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     UINT16*      Buffer;                                             
          }UNICODE_STRING, *PUNICODE_STRING;                                   
                                                                               
          typedef struct _ACCESS_STATE                                 // 16 elements, 0xA0 bytes (sizeof) 
          {                                                                                                
/*0x000*/     struct _LUID OperationID;                                // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     UINT8        SecurityEvaluated;                                                              
/*0x009*/     UINT8        GenerateAudit;                                                                  
/*0x00A*/     UINT8        GenerateOnClose;                                                                
/*0x00B*/     UINT8        PrivilegesAllocated;                                                            
/*0x00C*/     ULONG32      Flags;                                                                          
/*0x010*/     ULONG32      RemainingDesiredAccess;                                                         
/*0x014*/     ULONG32      PreviouslyGrantedAccess;                                                        
/*0x018*/     ULONG32      OriginalDesiredAccess;                                                          
/*0x01C*/     UINT8        _PADDING0_[0x4];                                                                
/*0x020*/     struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext; // 4 elements, 0x20 bytes (sizeof)  
/*0x040*/     VOID*        SecurityDescriptor;                                                             
/*0x048*/     VOID*        AuxData;                                                                        
              union                                                    // 2 elements, 0x2C bytes (sizeof)  
              {                                                                                            
/*0x050*/         struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;   // 3 elements, 0x2C bytes (sizeof)  
/*0x050*/         struct _PRIVILEGE_SET PrivilegeSet;                  // 3 elements, 0x14 bytes (sizeof)  
              }Privileges;                                                                                 
/*0x07C*/     UINT8        AuditPrivileges;                                                                
/*0x07D*/     UINT8        _PADDING1_[0x3];                                                                
/*0x080*/     struct _UNICODE_STRING ObjectName;                       // 3 elements, 0x10 bytes (sizeof)  
/*0x090*/     struct _UNICODE_STRING ObjectTypeName;                   // 3 elements, 0x10 bytes (sizeof)  
          }ACCESS_STATE, *PACCESS_STATE;                                                                   
                                                                                                           
typedef struct _ACTIVATION_CONTEXT // 0 elements, 0x0 bytes (sizeof) 
{                                                                    
}ACTIVATION_CONTEXT, *PACTIVATION_CONTEXT;                                  
                                                                     
typedef struct _ACTIVATION_CONTEXT_DATA // 0 elements, 0x0 bytes (sizeof) 
{                                                                         
}ACTIVATION_CONTEXT_DATA, *PACTIVATION_CONTEXT_DATA;                                  
                                                                          
          typedef struct _LIST_ENTRY     // 2 elements, 0x10 bytes (sizeof) 
          {                                                                 
/*0x000*/     struct _LIST_ENTRY* Flink;                                    
/*0x008*/     struct _LIST_ENTRY* Blink;                                    
          }LIST_ENTRY, *PLIST_ENTRY;                                        
                                                                            
          typedef struct _ACTIVATION_CONTEXT_STACK                     // 5 elements, 0x28 bytes (sizeof) 
          {                                                                                               
/*0x000*/     struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;                                    
/*0x008*/     struct _LIST_ENTRY FrameListCache;                       // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     ULONG32      Flags;                                                                         
/*0x01C*/     ULONG32      NextCookieSequenceNumber;                                                      
/*0x020*/     ULONG32      StackId;                                                                       
/*0x024*/     UINT8        _PADDING0_[0x4];                                                               
          }ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK;                                          
                                                                                                          
typedef struct _ASSEMBLY_STORAGE_MAP // 0 elements, 0x0 bytes (sizeof) 
{                                                                      
}ASSEMBLY_STORAGE_MAP, *PASSEMBLY_STORAGE_MAP;                                  
                                                                       
          typedef struct _GENERIC_MAPPING  // 4 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     ULONG32      GenericRead;                                       
/*0x004*/     ULONG32      GenericWrite;                                      
/*0x008*/     ULONG32      GenericExecute;                                    
/*0x00C*/     ULONG32      GenericAll;                                        
          }GENERIC_MAPPING, *PGENERIC_MAPPING;                                   
                                                                              
          typedef struct _GUID       // 4 elements, 0x10 bytes (sizeof) 
          {                                                             
/*0x000*/     ULONG32      Data1;                                       
/*0x004*/     UINT16       Data2;                                       
/*0x006*/     UINT16       Data3;                                       
/*0x008*/     UINT8        Data4[8];                                    
          }GUID, *PGUID;                                                
                                                                        
          typedef struct _AUX_ACCESS_DATA                                                                  // 11 elements, 0xD8 bytes (sizeof) 
          {                                                                                                                                    
/*0x000*/     struct _PRIVILEGE_SET* PrivilegesUsed;                                                                                           
/*0x008*/     struct _GENERIC_MAPPING GenericMapping;                                                      // 4 elements, 0x10 bytes (sizeof)  
/*0x018*/     ULONG32      AccessesToAudit;                                                                                                    
/*0x01C*/     ULONG32      MaximumAuditMask;                                                                                                   
/*0x020*/     struct _GUID TransactionId;                                                                  // 4 elements, 0x10 bytes (sizeof)  
/*0x030*/     VOID*        NewSecurityDescriptor;                                                                                              
/*0x038*/     VOID*        ExistingSecurityDescriptor;                                                                                         
/*0x040*/     VOID*        ParentSecurityDescriptor;                                                                                           
/*0x048*/     FUNCT_00A3_00A2_CleanupGroupCancelCallback_DeRefSecurityDescriptor* DeRefSecurityDescriptor;                                     
/*0x050*/     VOID*        SDLock;                                                                                                             
/*0x058*/     struct _ACCESS_REASONS AccessReasons;                                                        // 1 elements, 0x80 bytes (sizeof)  
          }AUX_ACCESS_DATA, *PAUX_ACCESS_DATA;                                                                                                 
                                                                                                                                               
          typedef struct _CALLBACKWND              // 3 elements, 0x18 bytes (sizeof) 
          {                                                                           
/*0x000*/     struct _HWND__* hwnd;                                                   
/*0x008*/     struct _tagWND* pwnd;                                                   
/*0x010*/     struct _ACTIVATION_CONTEXT* pActCtx;                                    
          }CALLBACKWND, *PCALLBACKWND;                                                
                                                                                      
          typedef struct _PROCDESKHEAD      // 5 elements, 0x28 bytes (sizeof) 
          {                                                                    
/*0x000*/     VOID*        h;                                                  
/*0x008*/     ULONG32      cLockObj;                                           
/*0x00C*/     UINT8        _PADDING0_[0x4];                                    
/*0x010*/     ULONG32      hTaskWow;                                           
/*0x014*/     UINT8        _PADDING1_[0x4];                                    
/*0x018*/     struct _tagDESKTOP* rpdesk;                                      
/*0x020*/     UINT8*       pSelf;                                              
          }PROCDESKHEAD, *PPROCDESKHEAD;                                       
                                                                               
          typedef struct _CALLPROCDATA         // 4 elements, 0x40 bytes (sizeof) 
          {                                                                       
/*0x000*/     struct _PROCDESKHEAD head;       // 5 elements, 0x28 bytes (sizeof) 
/*0x028*/     struct _CALLPROCDATA* spcpdNext;                                    
/*0x030*/     UINT64       pfnClientPrevious;                                     
/*0x038*/     UINT16       wType;                                                 
/*0x03A*/     UINT8        _PADDING0_[0x6];                                       
          }CALLPROCDATA, *PCALLPROCDATA;                                          
                                                                                  
          typedef struct _CLIENT_ID       // 2 elements, 0x10 bytes (sizeof) 
          {                                                                  
/*0x000*/     VOID*        UniqueProcess;                                    
/*0x008*/     VOID*        UniqueThread;                                     
          }CLIENT_ID, *PCLIENT_ID;                                           
                                                                             
          typedef union _LARGE_INTEGER   // 4 elements, 0x8 bytes (sizeof) 
          {                                                                
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              };                                                           
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              }u;                                                          
/*0x000*/     INT64        QuadPart;                                       
          }LARGE_INTEGER, *PLARGE_INTEGER;                                  
                                                                           
          typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR // 4 elements, 0x14 bytes (sizeof)  
          {                                                                                  
/*0x000*/     UINT8        Type;                                                             
/*0x001*/     UINT8        ShareDisposition;                                                 
/*0x002*/     UINT16       Flags;                                                            
              union                                      // 12 elements, 0x10 bytes (sizeof) 
              {                                                                              
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length;                                                   
                  }Generic;                                                                  
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length;                                                   
                  }Port;                                                                     
                  struct                                 // 4 elements, 0x10 bytes (sizeof)  
                  {                                                                          
/*0x004*/             UINT16       Level;                                                    
/*0x006*/             UINT16       Group;                                                    
/*0x008*/             ULONG32      Vector;                                                   
/*0x00C*/             UINT64       Affinity;                                                 
                  }Interrupt;                                                                
                  struct                                 // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                          
                      union                              // 2 elements, 0x10 bytes (sizeof)  
                      {                                                                      
                          struct                         // 4 elements, 0x10 bytes (sizeof)  
                          {                                                                  
/*0x004*/                     UINT16       Group;                                            
/*0x006*/                     UINT16       MessageCount;                                     
/*0x008*/                     ULONG32      Vector;                                           
/*0x00C*/                     UINT64       Affinity;                                         
                          }Raw;                                                              
                          struct                         // 4 elements, 0x10 bytes (sizeof)  
                          {                                                                  
/*0x004*/                     UINT16       Level;                                            
/*0x006*/                     UINT16       Group;                                            
/*0x008*/                     ULONG32      Vector;                                           
/*0x00C*/                     UINT64       Affinity;                                         
                          }Translated;                                                       
                      };                                                                     
                  }MessageInterrupt;                                                         
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length;                                                   
                  }Memory;                                                                   
                  struct                                 // 3 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Channel;                                                  
/*0x008*/             ULONG32      Port;                                                     
/*0x00C*/             ULONG32      Reserved1;                                                
                  }Dma;                                                                      
                  struct                                 // 1 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Data[3];                                                  
                  }DevicePrivate;                                                            
                  struct                                 // 3 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Start;                                                    
/*0x008*/             ULONG32      Length;                                                   
/*0x00C*/             ULONG32      Reserved;                                                 
                  }BusNumber;                                                                
                  struct                                 // 3 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      DataSize;                                                 
/*0x008*/             ULONG32      Reserved1;                                                
/*0x00C*/             ULONG32      Reserved2;                                                
                  }DeviceSpecificData;                                                       
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length40;                                                 
                  }Memory40;                                                                 
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length48;                                                 
                  }Memory48;                                                                 
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length64;                                                 
                  }Memory64;                                                                 
              }u;                                                                            
          }CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR;                                    
                                                                                             
          typedef struct _CM_PARTIAL_RESOURCE_LIST                          // 4 elements, 0x1C bytes (sizeof) 
          {                                                                                                    
/*0x000*/     UINT16       Version;                                                                            
/*0x002*/     UINT16       Revision;                                                                           
/*0x004*/     ULONG32      Count;                                                                              
/*0x008*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];                                    
          }CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST;                                               
                                                                                                               
          typedef struct _CM_FULL_RESOURCE_DESCRIPTOR               // 3 elements, 0x24 bytes (sizeof) 
          {                                                                                            
/*0x000*/     enum _INTERFACE_TYPE InterfaceType;                                                      
/*0x004*/     ULONG32      BusNumber;                                                                  
/*0x008*/     struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList; // 4 elements, 0x1C bytes (sizeof) 
          }CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR;                                   
                                                                                                       
          typedef struct _CM_RESOURCE_LIST                 // 2 elements, 0x28 bytes (sizeof) 
          {                                                                                   
/*0x000*/     ULONG32      Count;                                                             
/*0x004*/     struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];                                    
          }CM_RESOURCE_LIST, *PCM_RESOURCE_LIST;                                              
                                                                                              
          typedef struct _COMPRESSED_DATA_INFO         // 7 elements, 0xC bytes (sizeof) 
          {                                                                              
/*0x000*/     UINT16       CompressionFormatAndEngine;                                   
/*0x002*/     UINT8        CompressionUnitShift;                                         
/*0x003*/     UINT8        ChunkShift;                                                   
/*0x004*/     UINT8        ClusterShift;                                                 
/*0x005*/     UINT8        Reserved;                                                     
/*0x006*/     UINT16       NumberOfChunks;                                               
/*0x008*/     ULONG32      CompressedChunkSizes[1];                                      
          }COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO;                                  
                                                                                         
          typedef struct _tagRECT  // 4 elements, 0x10 bytes (sizeof) 
          {                                                           
/*0x000*/     LONG32       left;                                      
/*0x004*/     LONG32       top;                                       
/*0x008*/     LONG32       right;                                     
/*0x00C*/     LONG32       bottom;                                    
          }tagRECT, *PtagRECT;                                        
                                                                      
          typedef struct _CONSOLE_CARET_INFO // 2 elements, 0x18 bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _HWND__* hwnd;                                             
/*0x008*/     struct _tagRECT rc;            // 4 elements, 0x10 bytes (sizeof) 
          }CONSOLE_CARET_INFO, *PCONSOLE_CARET_INFO;                                   
                                                                                
          typedef struct _M128A  // 2 elements, 0x10 bytes (sizeof) 
          {                                                         
/*0x000*/     UINT64       Low;                                     
/*0x008*/     INT64        High;                                    
          }M128A, *PM128A;                                          
                                                                    
          typedef struct _XSAVE_FORMAT         // 16 elements, 0x200 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT16       ControlWord;                                             
/*0x002*/     UINT16       StatusWord;                                              
/*0x004*/     UINT8        TagWord;                                                 
/*0x005*/     UINT8        Reserved1;                                               
/*0x006*/     UINT16       ErrorOpcode;                                             
/*0x008*/     ULONG32      ErrorOffset;                                             
/*0x00C*/     UINT16       ErrorSelector;                                           
/*0x00E*/     UINT16       Reserved2;                                               
/*0x010*/     ULONG32      DataOffset;                                              
/*0x014*/     UINT16       DataSelector;                                            
/*0x016*/     UINT16       Reserved3;                                               
/*0x018*/     ULONG32      MxCsr;                                                   
/*0x01C*/     ULONG32      MxCsr_Mask;                                              
/*0x020*/     struct _M128A FloatRegisters[8];                                      
/*0x0A0*/     struct _M128A XmmRegisters[16];                                       
/*0x1A0*/     UINT8        Reserved4[96];                                           
          }XSAVE_FORMAT, *PXSAVE_FORMAT;                                            
                                                                                    
          typedef struct _CONTEXT                    // 64 elements, 0x4D0 bytes (sizeof) 
          {                                                                               
/*0x000*/     UINT64       P1Home;                                                        
/*0x008*/     UINT64       P2Home;                                                        
/*0x010*/     UINT64       P3Home;                                                        
/*0x018*/     UINT64       P4Home;                                                        
/*0x020*/     UINT64       P5Home;                                                        
/*0x028*/     UINT64       P6Home;                                                        
/*0x030*/     ULONG32      ContextFlags;                                                  
/*0x034*/     ULONG32      MxCsr;                                                         
/*0x038*/     UINT16       SegCs;                                                         
/*0x03A*/     UINT16       SegDs;                                                         
/*0x03C*/     UINT16       SegEs;                                                         
/*0x03E*/     UINT16       SegFs;                                                         
/*0x040*/     UINT16       SegGs;                                                         
/*0x042*/     UINT16       SegSs;                                                         
/*0x044*/     ULONG32      EFlags;                                                        
/*0x048*/     UINT64       Dr0;                                                           
/*0x050*/     UINT64       Dr1;                                                           
/*0x058*/     UINT64       Dr2;                                                           
/*0x060*/     UINT64       Dr3;                                                           
/*0x068*/     UINT64       Dr6;                                                           
/*0x070*/     UINT64       Dr7;                                                           
/*0x078*/     UINT64       Rax;                                                           
/*0x080*/     UINT64       Rcx;                                                           
/*0x088*/     UINT64       Rdx;                                                           
/*0x090*/     UINT64       Rbx;                                                           
/*0x098*/     UINT64       Rsp;                                                           
/*0x0A0*/     UINT64       Rbp;                                                           
/*0x0A8*/     UINT64       Rsi;                                                           
/*0x0B0*/     UINT64       Rdi;                                                           
/*0x0B8*/     UINT64       R8;                                                            
/*0x0C0*/     UINT64       R9;                                                            
/*0x0C8*/     UINT64       R10;                                                           
/*0x0D0*/     UINT64       R11;                                                           
/*0x0D8*/     UINT64       R12;                                                           
/*0x0E0*/     UINT64       R13;                                                           
/*0x0E8*/     UINT64       R14;                                                           
/*0x0F0*/     UINT64       R15;                                                           
/*0x0F8*/     UINT64       Rip;                                                           
              union                                  // 2 elements, 0x200 bytes (sizeof)  
              {                                                                           
/*0x100*/         struct _XSAVE_FORMAT FltSave;      // 16 elements, 0x200 bytes (sizeof) 
                  struct                             // 18 elements, 0x200 bytes (sizeof) 
                  {                                                                       
/*0x100*/             struct _M128A Header[2];                                            
/*0x120*/             struct _M128A Legacy[8];                                            
/*0x1A0*/             struct _M128A Xmm0;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1B0*/             struct _M128A Xmm1;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1C0*/             struct _M128A Xmm2;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1D0*/             struct _M128A Xmm3;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1E0*/             struct _M128A Xmm4;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1F0*/             struct _M128A Xmm5;            // 2 elements, 0x10 bytes (sizeof)   
/*0x200*/             struct _M128A Xmm6;            // 2 elements, 0x10 bytes (sizeof)   
/*0x210*/             struct _M128A Xmm7;            // 2 elements, 0x10 bytes (sizeof)   
/*0x220*/             struct _M128A Xmm8;            // 2 elements, 0x10 bytes (sizeof)   
/*0x230*/             struct _M128A Xmm9;            // 2 elements, 0x10 bytes (sizeof)   
/*0x240*/             struct _M128A Xmm10;           // 2 elements, 0x10 bytes (sizeof)   
/*0x250*/             struct _M128A Xmm11;           // 2 elements, 0x10 bytes (sizeof)   
/*0x260*/             struct _M128A Xmm12;           // 2 elements, 0x10 bytes (sizeof)   
/*0x270*/             struct _M128A Xmm13;           // 2 elements, 0x10 bytes (sizeof)   
/*0x280*/             struct _M128A Xmm14;           // 2 elements, 0x10 bytes (sizeof)   
/*0x290*/             struct _M128A Xmm15;           // 2 elements, 0x10 bytes (sizeof)   
/*0x2A0*/             UINT8        _PADDING0_[0x60];                                      
                  };                                                                      
              };                                                                          
/*0x300*/     struct _M128A VectorRegister[26];                                           
/*0x4A0*/     UINT64       VectorControl;                                                 
/*0x4A8*/     UINT64       DebugControl;                                                  
/*0x4B0*/     UINT64       LastBranchToRip;                                               
/*0x4B8*/     UINT64       LastBranchFromRip;                                             
/*0x4C0*/     UINT64       LastExceptionToRip;                                            
/*0x4C8*/     UINT64       LastExceptionFromRip;                                          
          }CONTEXT, *PCONTEXT;                                                            
                                                                                          
          typedef struct _CONTEXT32_UPDATE // 1 elements, 0x4 bytes (sizeof) 
          {                                                                  
/*0x000*/     ULONG32      NumberEntries;                                    
          }CONTEXT32_UPDATE, *PCONTEXT32_UPDATE;                                  
                                                                             
          typedef struct _CURDIR              // 2 elements, 0x18 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _UNICODE_STRING DosPath; // 3 elements, 0x10 bytes (sizeof) 
/*0x010*/     VOID*        Handle;                                               
          }CURDIR, *PCURDIR;                                                     
                                                                                 
          typedef struct _D3DDDI_DXGI_RGB // 3 elements, 0xC bytes (sizeof) 
          {                                                                 
/*0x000*/     FLOAT32      Red;                                             
/*0x004*/     FLOAT32      Green;                                           
/*0x008*/     FLOAT32      Blue;                                            
          }D3DDDI_DXGI_RGB, *PD3DDDI_DXGI_RGB;                                  
                                                                            
          typedef struct _D3DDDI_GAMMA_RAMP_DXGI_1      // 3 elements, 0x3024 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _D3DDDI_DXGI_RGB Scale;            // 3 elements, 0xC bytes (sizeof)    
/*0x00C*/     struct _D3DDDI_DXGI_RGB Offset;           // 3 elements, 0xC bytes (sizeof)    
/*0x018*/     struct _D3DDDI_DXGI_RGB GammaCurve[1025];                                      
          }D3DDDI_GAMMA_RAMP_DXGI_1, *PD3DDDI_GAMMA_RAMP_DXGI_1;                                     
                                                                                             
          typedef struct _D3DDDI_GAMMA_RAMP_RGB256x3x16 // 3 elements, 0x600 bytes (sizeof) 
          {                                                                                 
/*0x000*/     UINT16       Red[256];                                                        
/*0x200*/     UINT16       Green[256];                                                      
/*0x400*/     UINT16       Blue[256];                                                       
          }D3DDDI_GAMMA_RAMP_RGB256x3x16, *PD3DDDI_GAMMA_RAMP_RGB256x3x16;                                    
                                                                                            
          typedef struct _D3DDDI_RATIONAL // 2 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     UINT32       Numerator;                                       
/*0x004*/     UINT32       Denominator;                                     
          }D3DDDI_RATIONAL, *PD3DDDI_RATIONAL;                                  
                                                                            
          typedef struct _D3DKMDT_2DREGION // 2 elements, 0x8 bytes (sizeof) 
          {                                                                  
/*0x000*/     UINT32       cx;                                               
/*0x004*/     UINT32       cy;                                               
          }D3DKMDT_2DREGION, *PD3DKMDT_2DREGION;                                  
                                                                             
          typedef struct _D3DKMDT_COLOR_COEFF_DYNAMIC_RANGES // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                     
/*0x000*/     UINT32       FirstChannel;                                                        
/*0x004*/     UINT32       SecondChannel;                                                       
/*0x008*/     UINT32       ThirdChannel;                                                        
/*0x00C*/     UINT32       FourthChannel;                                                       
          }D3DKMDT_COLOR_COEFF_DYNAMIC_RANGES, *PD3DKMDT_COLOR_COEFF_DYNAMIC_RANGES;                                   
                                                                                                
          typedef struct _D3DKMDT_FREQUENCY_RANGE   // 4 elements, 0x20 bytes (sizeof) 
          {                                                                            
/*0x000*/     struct _D3DDDI_RATIONAL MinVSyncFreq; // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _D3DDDI_RATIONAL MaxVSyncFreq; // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/     struct _D3DDDI_RATIONAL MinHSyncFreq; // 2 elements, 0x8 bytes (sizeof)  
/*0x018*/     struct _D3DDDI_RATIONAL MaxHSyncFreq; // 2 elements, 0x8 bytes (sizeof)  
          }D3DKMDT_FREQUENCY_RANGE, *PD3DKMDT_FREQUENCY_RANGE;                                   
                                                                                       
          typedef struct _D3DKMDT_GAMMA_RAMP                           // 3 elements, 0x18 bytes (sizeof) 
          {                                                                                               
/*0x000*/     enum _D3DDDI_GAMMARAMP_TYPE Type;                                                           
/*0x004*/     UINT8        _PADDING0_[0x4];                                                               
/*0x008*/     UINT64       DataSize;                                                                      
              union                                                    // 3 elements, 0x8 bytes (sizeof)  
              {                                                                                           
/*0x010*/         struct _D3DDDI_GAMMA_RAMP_RGB256x3x16* pRgb256x3x16;                                    
/*0x010*/         struct _D3DDDI_GAMMA_RAMP_DXGI_1* pDxgi1;                                               
/*0x010*/         VOID*        pRaw;                                                                      
              }Data;                                                                                      
          }D3DKMDT_GAMMA_RAMP, *PD3DKMDT_GAMMA_RAMP;                                                      
                                                                                                          
          typedef struct _D3DKMDT_GRAPHICS_RENDERING_FORMAT               // 6 elements, 0x20 bytes (sizeof) 
          {                                                                                                  
/*0x000*/     struct _D3DKMDT_2DREGION PrimSurfSize;                      // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _D3DKMDT_2DREGION VisibleRegionSize;                 // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/     ULONG32      Stride;                                                                           
/*0x014*/     enum _D3DDDIFORMAT PixelFormat;                                                                
/*0x018*/     enum _D3DKMDT_COLOR_BASIS ColorBasis;                                                          
/*0x01C*/     enum _D3DKMDT_PIXEL_VALUE_ACCESS_MODE PixelValueAccessMode;                                    
          }D3DKMDT_GRAPHICS_RENDERING_FORMAT, *PD3DKMDT_GRAPHICS_RENDERING_FORMAT;                                   
                                                                                                             
          typedef struct _D3DKMDT_MONITOR_FREQUENCY_RANGE                      // 4 elements, 0x30 bytes (sizeof) 
          {                                                                                                       
/*0x000*/     enum _D3DKMDT_MONITOR_CAPABILITIES_ORIGIN Origin;                                                   
/*0x004*/     struct _D3DKMDT_FREQUENCY_RANGE RangeLimits;                     // 4 elements, 0x20 bytes (sizeof) 
/*0x024*/     enum _D3DKMDT_MONITOR_FREQUENCY_RANGE_CONSTRAINT ConstraintType;                                    
              union                                                            // 2 elements, 0x8 bytes (sizeof)  
              {                                                                                                   
/*0x028*/         struct _D3DKMDT_2DREGION ActiveSize;                         // 2 elements, 0x8 bytes (sizeof)  
/*0x028*/         UINT64       MaxPixelRate;                                                                      
              }Constraint;                                                                                        
          }D3DKMDT_MONITOR_FREQUENCY_RANGE, *PD3DKMDT_MONITOR_FREQUENCY_RANGE;                                    
                                                                                                                  
          typedef struct _D3DKMDT_VIDEO_SIGNAL_INFO                         // 7 elements, 0x38 bytes (sizeof) 
          {                                                                                                    
/*0x000*/     enum _D3DKMDT_VIDEO_SIGNAL_STANDARD VideoStandard;                                               
/*0x004*/     struct _D3DKMDT_2DREGION TotalSize;                           // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     struct _D3DKMDT_2DREGION ActiveSize;                          // 2 elements, 0x8 bytes (sizeof)  
/*0x014*/     struct _D3DDDI_RATIONAL VSyncFreq;                            // 2 elements, 0x8 bytes (sizeof)  
/*0x01C*/     struct _D3DDDI_RATIONAL HSyncFreq;                            // 2 elements, 0x8 bytes (sizeof)  
/*0x024*/     UINT8        _PADDING0_[0x4];                                                                    
/*0x028*/     UINT64       PixelRate;                                                                          
/*0x030*/     enum _D3DDDI_VIDEO_SIGNAL_SCANLINE_ORDERING ScanLineOrdering;                                    
/*0x034*/     UINT8        _PADDING1_[0x4];                                                                    
          }D3DKMDT_VIDEO_SIGNAL_INFO, *PD3DKMDT_VIDEO_SIGNAL_INFO;                                             
                                                                                                               
          typedef struct _D3DKMDT_MONITOR_SOURCE_MODE                             // 6 elements, 0x60 bytes (sizeof) 
          {                                                                                                          
/*0x000*/     UINT32       Id;                                                                                       
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                          
/*0x008*/     struct _D3DKMDT_VIDEO_SIGNAL_INFO VideoSignalInfo;                  // 7 elements, 0x38 bytes (sizeof) 
/*0x040*/     enum _D3DKMDT_COLOR_BASIS ColorBasis;                                                                  
/*0x044*/     struct _D3DKMDT_COLOR_COEFF_DYNAMIC_RANGES ColorCoeffDynamicRanges; // 4 elements, 0x10 bytes (sizeof) 
/*0x054*/     enum _D3DKMDT_MONITOR_CAPABILITIES_ORIGIN Origin;                                                      
/*0x058*/     enum _D3DKMDT_MODE_PREFERENCE Preference;                                                              
/*0x05C*/     UINT8        _PADDING1_[0x4];                                                                          
          }D3DKMDT_MONITOR_SOURCE_MODE, *PD3DKMDT_MONITOR_SOURCE_MODE;                                               
                                                                                                                     
          typedef struct _D3DKMDT_VIDPN_PRESENT_PATH_SCALING_SUPPORT // 5 elements, 0x4 bytes (sizeof) 
          {                                                                                            
/*0x000*/     UINT32       Identity : 1;                             // 0 BitPosition                  
/*0x000*/     UINT32       Centered : 1;                             // 1 BitPosition                  
/*0x000*/     UINT32       Stretched : 1;                            // 2 BitPosition                  
/*0x000*/     UINT32       AspectRatioCenteredMax : 1;               // 3 BitPosition                  
/*0x000*/     UINT32       Custom : 1;                               // 4 BitPosition                  
          }D3DKMDT_VIDPN_PRESENT_PATH_SCALING_SUPPORT, *PD3DKMDT_VIDPN_PRESENT_PATH_SCALING_SUPPORT;                                  
                                                                                                       
          typedef struct _D3DKMDT_VIDPN_PRESENT_PATH_ROTATION_SUPPORT // 4 elements, 0x4 bytes (sizeof) 
          {                                                                                             
/*0x000*/     UINT32       Identity : 1;                              // 0 BitPosition                  
/*0x000*/     UINT32       Rotate90 : 1;                              // 1 BitPosition                  
/*0x000*/     UINT32       Rotate180 : 1;                             // 2 BitPosition                  
/*0x000*/     UINT32       Rotate270 : 1;                             // 3 BitPosition                  
          }D3DKMDT_VIDPN_PRESENT_PATH_ROTATION_SUPPORT, *PD3DKMDT_VIDPN_PRESENT_PATH_ROTATION_SUPPORT;                                  
                                                                                                        
          typedef struct _D3DKMDT_VIDPN_PRESENT_PATH_TRANSFORMATION                // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                                           
/*0x000*/     enum _D3DKMDT_VIDPN_PRESENT_PATH_SCALING Scaling;                                                       
/*0x004*/     struct _D3DKMDT_VIDPN_PRESENT_PATH_SCALING_SUPPORT ScalingSupport;   // 5 elements, 0x4 bytes (sizeof)  
/*0x008*/     enum _D3DKMDT_VIDPN_PRESENT_PATH_ROTATION Rotation;                                                     
/*0x00C*/     struct _D3DKMDT_VIDPN_PRESENT_PATH_ROTATION_SUPPORT RotationSupport; // 4 elements, 0x4 bytes (sizeof)  
          }D3DKMDT_VIDPN_PRESENT_PATH_TRANSFORMATION, *PD3DKMDT_VIDPN_PRESENT_PATH_TRANSFORMATION;                                   
                                                                                                                      
          typedef struct _D3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION_SUPPORT // 4 elements, 0x4 bytes (sizeof) 
          {                                                                                                   
/*0x000*/     UINT32       NoProtection : 1;                                // 0 BitPosition                  
/*0x000*/     UINT32       MacroVisionApsTrigger : 1;                       // 1 BitPosition                  
/*0x000*/     UINT32       MacroVisionFull : 1;                             // 2 BitPosition                  
/*0x000*/     UINT32       Reserved : 29;                                   // 3 BitPosition                  
          }D3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION_SUPPORT, *PD3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION_SUPPORT;                                  
                                                                                                              
          typedef struct _D3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION                            // 4 elements, 0x10C bytes (sizeof) 
          {                                                                                                                        
/*0x000*/     enum _D3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION_TYPE CopyProtectionType;                                             
/*0x004*/     UINT32       APSTriggerBits;                                                                                         
/*0x008*/     UINT8        OEMCopyProtection[256];                                                                                 
/*0x108*/     struct _D3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION_SUPPORT CopyProtectionSupport; // 4 elements, 0x4 bytes (sizeof)   
          }D3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION, *PD3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION;                                    
                                                                                                                                   
          typedef struct _D3DKMDT_VIDPN_PRESENT_PATH                                         // 11 elements, 0x168 bytes (sizeof) 
          {                                                                                                                       
/*0x000*/     UINT32       VidPnSourceId;                                                                                         
/*0x004*/     UINT32       VidPnTargetId;                                                                                         
/*0x008*/     enum _D3DKMDT_VIDPN_PRESENT_PATH_IMPORTANCE ImportanceOrdinal;                                                      
/*0x00C*/     struct _D3DKMDT_VIDPN_PRESENT_PATH_TRANSFORMATION ContentTransformation;       // 4 elements, 0x10 bytes (sizeof)   
/*0x01C*/     struct _D3DKMDT_2DREGION VisibleFromActiveTLOffset;                            // 2 elements, 0x8 bytes (sizeof)    
/*0x024*/     struct _D3DKMDT_2DREGION VisibleFromActiveBROffset;                            // 2 elements, 0x8 bytes (sizeof)    
/*0x02C*/     enum _D3DKMDT_COLOR_BASIS VidPnTargetColorBasis;                                                                    
/*0x030*/     struct _D3DKMDT_COLOR_COEFF_DYNAMIC_RANGES VidPnTargetColorCoeffDynamicRanges; // 4 elements, 0x10 bytes (sizeof)   
/*0x040*/     enum _D3DKMDT_VIDPN_PRESENT_PATH_CONTENT Content;                                                                   
/*0x044*/     struct _D3DKMDT_VIDPN_PRESENT_PATH_COPYPROTECTION CopyProtection;              // 4 elements, 0x10C bytes (sizeof)  
/*0x150*/     struct _D3DKMDT_GAMMA_RAMP GammaRamp;                                          // 3 elements, 0x18 bytes (sizeof)   
          }D3DKMDT_VIDPN_PRESENT_PATH, *PD3DKMDT_VIDPN_PRESENT_PATH;                                                              
                                                                                                                                  
          typedef struct _D3DKMDT_VIDPN_SOURCE_MODE                   // 3 elements, 0x28 bytes (sizeof) 
          {                                                                                              
/*0x000*/     UINT32       Id;                                                                           
/*0x004*/     enum _D3DKMDT_VIDPN_SOURCE_MODE_TYPE Type;                                                 
              union                                                   // 2 elements, 0x20 bytes (sizeof) 
              {                                                                                          
/*0x008*/         struct _D3DKMDT_GRAPHICS_RENDERING_FORMAT Graphics; // 6 elements, 0x20 bytes (sizeof) 
/*0x008*/         enum _D3DKMDT_TEXT_RENDERING_FORMAT Text;                                              
              }Format;                                                                                   
          }D3DKMDT_VIDPN_SOURCE_MODE, *PD3DKMDT_VIDPN_SOURCE_MODE;                                       
                                                                                                         
          typedef struct _D3DKMDT_VIDPN_TARGET_MODE              // 3 elements, 0x48 bytes (sizeof) 
          {                                                                                         
/*0x000*/     UINT32       Id;                                                                      
/*0x004*/     UINT8        _PADDING0_[0x4];                                                         
/*0x008*/     struct _D3DKMDT_VIDEO_SIGNAL_INFO VideoSignalInfo; // 7 elements, 0x38 bytes (sizeof) 
/*0x040*/     enum _D3DKMDT_MODE_PREFERENCE Preference;                                             
/*0x044*/     UINT8        _PADDING1_[0x4];                                                         
          }D3DKMDT_VIDPN_TARGET_MODE, *PD3DKMDT_VIDPN_TARGET_MODE;                                   
                                                                                                    
          typedef struct _D3DMATRIX // 16 elements, 0x40 bytes (sizeof) 
          {                                                             
/*0x000*/     FLOAT32      _11;                                         
/*0x004*/     FLOAT32      _12;                                         
/*0x008*/     FLOAT32      _13;                                         
/*0x00C*/     FLOAT32      _14;                                         
/*0x010*/     FLOAT32      _21;                                         
/*0x014*/     FLOAT32      _22;                                         
/*0x018*/     FLOAT32      _23;                                         
/*0x01C*/     FLOAT32      _24;                                         
/*0x020*/     FLOAT32      _31;                                         
/*0x024*/     FLOAT32      _32;                                         
/*0x028*/     FLOAT32      _33;                                         
/*0x02C*/     FLOAT32      _34;                                         
/*0x030*/     FLOAT32      _41;                                         
/*0x034*/     FLOAT32      _42;                                         
/*0x038*/     FLOAT32      _43;                                         
/*0x03C*/     FLOAT32      _44;                                         
          }D3DMATRIX, *PD3DMATRIX;                                      
                                                                        
          typedef struct _DEADKEY       // 3 elements, 0x8 bytes (sizeof) 
          {                                                               
/*0x000*/     ULONG32      dwBoth;                                        
/*0x004*/     WCHAR        wchComposed;                                   
/*0x006*/     UINT16       uFlags;                                        
          }DEADKEY, *PDEADKEY;                                            
                                                                          
          typedef struct _DEVICE_CAPABILITIES          // 30 elements, 0x40 bytes (sizeof) 
          {                                                                                
/*0x000*/     UINT16       Size;                                                           
/*0x002*/     UINT16       Version;                                                        
              struct                                   // 20 elements, 0x4 bytes (sizeof)  
              {                                                                            
/*0x004*/         ULONG32      DeviceD1 : 1;           // 0 BitPosition                    
/*0x004*/         ULONG32      DeviceD2 : 1;           // 1 BitPosition                    
/*0x004*/         ULONG32      LockSupported : 1;      // 2 BitPosition                    
/*0x004*/         ULONG32      EjectSupported : 1;     // 3 BitPosition                    
/*0x004*/         ULONG32      Removable : 1;          // 4 BitPosition                    
/*0x004*/         ULONG32      DockDevice : 1;         // 5 BitPosition                    
/*0x004*/         ULONG32      UniqueID : 1;           // 6 BitPosition                    
/*0x004*/         ULONG32      SilentInstall : 1;      // 7 BitPosition                    
/*0x004*/         ULONG32      RawDeviceOK : 1;        // 8 BitPosition                    
/*0x004*/         ULONG32      SurpriseRemovalOK : 1;  // 9 BitPosition                    
/*0x004*/         ULONG32      WakeFromD0 : 1;         // 10 BitPosition                   
/*0x004*/         ULONG32      WakeFromD1 : 1;         // 11 BitPosition                   
/*0x004*/         ULONG32      WakeFromD2 : 1;         // 12 BitPosition                   
/*0x004*/         ULONG32      WakeFromD3 : 1;         // 13 BitPosition                   
/*0x004*/         ULONG32      HardwareDisabled : 1;   // 14 BitPosition                   
/*0x004*/         ULONG32      NonDynamic : 1;         // 15 BitPosition                   
/*0x004*/         ULONG32      WarmEjectSupported : 1; // 16 BitPosition                   
/*0x004*/         ULONG32      NoDisplayInUI : 1;      // 17 BitPosition                   
/*0x004*/         ULONG32      Reserved1 : 1;          // 18 BitPosition                   
/*0x004*/         ULONG32      Reserved : 13;          // 19 BitPosition                   
              };                                                                           
/*0x008*/     ULONG32      Address;                                                        
/*0x00C*/     ULONG32      UINumber;                                                       
/*0x010*/     enum _DEVICE_POWER_STATE DeviceState[7];                                     
/*0x02C*/     enum _SYSTEM_POWER_STATE SystemWake;                                         
/*0x030*/     enum _DEVICE_POWER_STATE DeviceWake;                                         
/*0x034*/     ULONG32      D1Latency;                                                      
/*0x038*/     ULONG32      D2Latency;                                                      
/*0x03C*/     ULONG32      D3Latency;                                                      
          }DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES;                                     
                                                                                           
          typedef struct _KDEVICE_QUEUE_ENTRY     // 3 elements, 0x18 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _LIST_ENTRY DeviceListEntry; // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     ULONG32      SortKey;                                                  
/*0x014*/     UINT8        Inserted;                                                 
/*0x015*/     UINT8        _PADDING0_[0x3];                                          
          }KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY;                                   
                                                                                     
          typedef struct _WAIT_CONTEXT_BLOCK                // 7 elements, 0x48 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _KDEVICE_QUEUE_ENTRY WaitQueueEntry;   // 3 elements, 0x18 bytes (sizeof) 
/*0x018*/     FUNCT_0648_0647_DeviceRoutine* DeviceRoutine;                                    
/*0x020*/     VOID*        DeviceContext;                                                      
/*0x028*/     ULONG32      NumberOfMapRegisters;                                               
/*0x02C*/     UINT8        _PADDING0_[0x4];                                                    
/*0x030*/     VOID*        DeviceObject;                                                       
/*0x038*/     VOID*        CurrentIrp;                                                         
/*0x040*/     struct _KDPC* BufferChainingDpc;                                                 
          }WAIT_CONTEXT_BLOCK, *PWAIT_CONTEXT_BLOCK;                                           
                                                                                               
          typedef struct _KDEVICE_QUEUE          // 7 elements, 0x28 bytes (sizeof) 
          {                                                                         
/*0x000*/     INT16        Type;                                                    
/*0x002*/     INT16        Size;                                                    
/*0x004*/     UINT8        _PADDING0_[0x4];                                         
/*0x008*/     struct _LIST_ENTRY DeviceListHead; // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     UINT64       Lock;                                                    
              union                              // 2 elements, 0x8 bytes (sizeof)  
              {                                                                     
/*0x020*/         UINT8        Busy;                                                
                  struct                         // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                 
/*0x020*/             INT64        Reserved : 8; // 0 BitPosition                   
/*0x020*/             INT64        Hint : 56;    // 8 BitPosition                   
                  };                                                                
              };                                                                    
          }KDEVICE_QUEUE, *PKDEVICE_QUEUE;                                          
                                                                                    
          typedef struct _KDPC                                  // 9 elements, 0x40 bytes (sizeof) 
          {                                                                                        
/*0x000*/     UINT8        Type;                                                                   
/*0x001*/     UINT8        Importance;                                                             
/*0x002*/     UINT16       Number;                                                                 
/*0x004*/     UINT8        _PADDING0_[0x4];                                                        
/*0x008*/     struct _LIST_ENTRY DpcListEntry;                  // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     FUNCT_00A3_065C_DeferredRoutine* DeferredRoutine;                                    
/*0x020*/     VOID*        DeferredContext;                                                        
/*0x028*/     VOID*        SystemArgument1;                                                        
/*0x030*/     VOID*        SystemArgument2;                                                        
/*0x038*/     VOID*        DpcData;                                                                
          }KDPC, *PKDPC;                                                                           
                                                                                                   
          typedef struct _DISPATCHER_HEADER                           // 29 elements, 0x18 bytes (sizeof) 
          {                                                                                               
              union                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                           
                  struct                                              // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                       
/*0x000*/             UINT8        Type;                                                                  
                      union                                           // 4 elements, 0x1 bytes (sizeof)   
                      {                                                                                   
/*0x001*/                 UINT8        TimerControlFlags;                                                 
                          struct                                      // 4 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x001*/                     UINT8        Absolute : 1;              // 0 BitPosition                    
/*0x001*/                     UINT8        Coalescable : 1;           // 1 BitPosition                    
/*0x001*/                     UINT8        KeepShifting : 1;          // 2 BitPosition                    
/*0x001*/                     UINT8        EncodedTolerableDelay : 5; // 3 BitPosition                    
                          };                                                                              
/*0x001*/                 UINT8        Abandoned;                                                         
/*0x001*/                 UINT8        Signalling;                                                        
                      };                                                                                  
                      union                                           // 4 elements, 0x1 bytes (sizeof)   
                      {                                                                                   
/*0x002*/                 UINT8        ThreadControlFlags;                                                
                          struct                                      // 4 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x002*/                     UINT8        CpuThrottled : 1;          // 0 BitPosition                    
/*0x002*/                     UINT8        CycleProfiling : 1;        // 1 BitPosition                    
/*0x002*/                     UINT8        CounterProfiling : 1;      // 2 BitPosition                    
/*0x002*/                     UINT8        Reserved : 5;              // 3 BitPosition                    
                          };                                                                              
/*0x002*/                 UINT8        Hand;                                                              
/*0x002*/                 UINT8        Size;                                                              
                      };                                                                                  
                      union                                           // 5 elements, 0x1 bytes (sizeof)   
                      {                                                                                   
/*0x003*/                 UINT8        TimerMiscFlags;                                                    
                          struct                                      // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x003*/                     UINT8        Index : 6;                 // 0 BitPosition                    
/*0x003*/                     UINT8        Inserted : 1;              // 6 BitPosition                    
/*0x003*/                     UINT8        Expired : 1;               // 7 BitPosition                    
                          };                                                                              
/*0x003*/                 UINT8        DebugActive;                                                       
                          struct                                      // 5 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x003*/                     UINT8        ActiveDR7 : 1;             // 0 BitPosition                    
/*0x003*/                     UINT8        Instrumented : 1;          // 1 BitPosition                    
/*0x003*/                     UINT8        Reserved2 : 4;             // 2 BitPosition                    
/*0x003*/                     UINT8        UmsScheduled : 1;          // 6 BitPosition                    
/*0x003*/                     UINT8        UmsPrimary : 1;            // 7 BitPosition                    
                          };                                                                              
/*0x003*/                 UINT8        DpcActive;                                                         
                      };                                                                                  
                  };                                                                                      
/*0x000*/         LONG32       Lock;                                                                      
              };                                                                                          
/*0x004*/     LONG32       SignalState;                                                                   
/*0x008*/     struct _LIST_ENTRY WaitListHead;                        // 2 elements, 0x10 bytes (sizeof)  
          }DISPATCHER_HEADER, *PDISPATCHER_HEADER;                                                        
                                                                                                          
          typedef struct _KEVENT                // 1 elements, 0x18 bytes (sizeof)  
          {                                                                         
/*0x000*/     struct _DISPATCHER_HEADER Header; // 29 elements, 0x18 bytes (sizeof) 
          }KEVENT, *PKEVENT;                                                        
                                                                                    
          typedef struct _DEVICE_OBJECT                        // 25 elements, 0x150 bytes (sizeof) 
          {                                                                                         
/*0x000*/     INT16        Type;                                                                    
/*0x002*/     UINT16       Size;                                                                    
/*0x004*/     LONG32       ReferenceCount;                                                          
/*0x008*/     struct _DRIVER_OBJECT* DriverObject;                                                  
/*0x010*/     struct _DEVICE_OBJECT* NextDevice;                                                    
/*0x018*/     struct _DEVICE_OBJECT* AttachedDevice;                                                
/*0x020*/     struct _IRP* CurrentIrp;                                                              
/*0x028*/     struct _IO_TIMER* Timer;                                                              
/*0x030*/     ULONG32      Flags;                                                                   
/*0x034*/     ULONG32      Characteristics;                                                         
/*0x038*/     struct _VPB* Vpb;                                                                     
/*0x040*/     VOID*        DeviceExtension;                                                         
/*0x048*/     ULONG32      DeviceType;                                                              
/*0x04C*/     CHAR         StackSize;                                                               
/*0x04D*/     UINT8        _PADDING0_[0x3];                                                         
              union                                            // 2 elements, 0x48 bytes (sizeof)   
              {                                                                                     
/*0x050*/         struct _LIST_ENTRY ListEntry;                // 2 elements, 0x10 bytes (sizeof)   
/*0x050*/         struct _WAIT_CONTEXT_BLOCK Wcb;              // 7 elements, 0x48 bytes (sizeof)   
              }Queue;                                                                               
/*0x098*/     ULONG32      AlignmentRequirement;                                                    
/*0x09C*/     UINT8        _PADDING1_[0x4];                                                         
/*0x0A0*/     struct _KDEVICE_QUEUE DeviceQueue;               // 7 elements, 0x28 bytes (sizeof)   
/*0x0C8*/     struct _KDPC Dpc;                                // 9 elements, 0x40 bytes (sizeof)   
/*0x108*/     ULONG32      ActiveThreadCount;                                                       
/*0x10C*/     UINT8        _PADDING2_[0x4];                                                         
/*0x110*/     VOID*        SecurityDescriptor;                                                      
/*0x118*/     struct _KEVENT DeviceLock;                       // 1 elements, 0x18 bytes (sizeof)   
/*0x130*/     UINT16       SectorSize;                                                              
/*0x132*/     UINT16       Spare1;                                                                  
/*0x134*/     UINT8        _PADDING3_[0x4];                                                         
/*0x138*/     struct _DEVOBJ_EXTENSION* DeviceObjectExtension;                                      
/*0x140*/     VOID*        Reserved;                                                                
/*0x148*/     UINT8        _PADDING4_[0x8];                                                         
          }DEVICE_OBJECT, *PDEVICE_OBJECT;                                                          
                                                                                                    
typedef struct _DEVICE_OBJECT_POWER_EXTENSION // 0 elements, 0x0 bytes (sizeof) 
{                                                                               
}DEVICE_OBJECT_POWER_EXTENSION, *PDEVICE_OBJECT_POWER_EXTENSION;                                  
                                                                                
          typedef struct _DEVOBJ_EXTENSION                 // 14 elements, 0x70 bytes (sizeof) 
          {                                                                                    
/*0x000*/     INT16        Type;                                                               
/*0x002*/     UINT16       Size;                                                               
/*0x004*/     UINT8        _PADDING0_[0x4];                                                    
/*0x008*/     struct _DEVICE_OBJECT* DeviceObject;                                             
/*0x010*/     ULONG32      PowerFlags;                                                         
/*0x014*/     UINT8        _PADDING1_[0x4];                                                    
/*0x018*/     struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;                                     
/*0x020*/     ULONG32      ExtensionFlags;                                                     
/*0x024*/     UINT8        _PADDING2_[0x4];                                                    
/*0x028*/     VOID*        DeviceNode;                                                         
/*0x030*/     struct _DEVICE_OBJECT* AttachedTo;                                               
/*0x038*/     LONG32       StartIoCount;                                                       
/*0x03C*/     LONG32       StartIoKey;                                                         
/*0x040*/     ULONG32      StartIoFlags;                                                       
/*0x044*/     UINT8        _PADDING3_[0x4];                                                    
/*0x048*/     struct _VPB* Vpb;                                                                
/*0x050*/     struct _LIST_ENTRY DependentList;            // 2 elements, 0x10 bytes (sizeof)  
/*0x060*/     struct _LIST_ENTRY ProviderList;             // 2 elements, 0x10 bytes (sizeof)  
          }DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION;                                               
                                                                                               
          typedef struct _DMA_ADAPTER                // 3 elements, 0x10 bytes (sizeof) 
          {                                                                             
/*0x000*/     UINT16       Version;                                                     
/*0x002*/     UINT16       Size;                                                        
/*0x004*/     UINT8        _PADDING0_[0x4];                                             
/*0x008*/     struct _DMA_OPERATIONS* DmaOperations;                                    
          }DMA_ADAPTER, *PDMA_ADAPTER;                                                  
                                                                                        
          typedef struct _DMA_OPERATIONS                                                    // 16 elements, 0x80 bytes (sizeof) 
          {                                                                                                                     
/*0x000*/     ULONG32      Size;                                                                                                
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                                     
/*0x008*/     FUNCT_00A3_0928_PutDmaAdapter_FreeAdapterChannel* PutDmaAdapter;                                                  
/*0x010*/     FUNCT_00A6_092C_AllocateCommonBuffer* AllocateCommonBuffer;                                                       
/*0x018*/     FUNCT_00A3_0932_FreeCommonBuffer* FreeCommonBuffer;                                                               
/*0x020*/     FUNCT_005B_0939_AllocateAdapterChannel* AllocateAdapterChannel;                                                   
/*0x028*/     FUNCT_0065_0940_FlushAdapterBuffers* FlushAdapterBuffers;                                                         
/*0x030*/     FUNCT_00A3_0928_PutDmaAdapter_FreeAdapterChannel* FreeAdapterChannel;                                             
/*0x038*/     FUNCT_00A3_0948_FreeMapRegisters* FreeMapRegisters;                                                               
/*0x040*/     FUNCT_006D_094D_MapTransfer* MapTransfer;                                                                         
/*0x048*/     FUNCT_0009_0955_GetDmaAlignment_ReadDmaCounter* GetDmaAlignment;                                                  
/*0x050*/     FUNCT_0009_0955_GetDmaAlignment_ReadDmaCounter* ReadDmaCounter;                                                   
/*0x058*/     FUNCT_005B_0957_GetScatterGatherList* GetScatterGatherList;                                                       
/*0x060*/     FUNCT_00A3_0971_PutScatterGatherList* PutScatterGatherList;                                                       
/*0x068*/     FUNCT_005B_0976_CalculateScatterGatherList* CalculateScatterGatherList;                                           
/*0x070*/     FUNCT_005B_097E_BuildScatterGatherList* BuildScatterGatherList;                                                   
/*0x078*/     FUNCT_005B_098A_BuildMdlFromScatterGatherList* BuildMdlFromScatterGatherList;                                     
          }DMA_OPERATIONS, *PDMA_OPERATIONS;                                                                                    
                                                                                                                                
          typedef struct _DMM_COFUNCPATHSMODALITY_SERIALIZATION // 2 elements, 0x8 bytes (sizeof) 
          {                                                                                       
/*0x000*/     UINT8        NumPathsFromSource;                                                    
/*0x001*/     UINT8        _PADDING0_[0x3];                                                       
/*0x004*/     ULONG32      PathAndTargetModeSetOffset[1];                                         
          }DMM_COFUNCPATHSMODALITY_SERIALIZATION, *PDMM_COFUNCPATHSMODALITY_SERIALIZATION;                                  
                                                                                                  
          typedef struct _DMM_COMMITVIDPNREQUEST_DIAGINFO                   // 6 elements, 0xC bytes (sizeof) 
          {                                                                                                   
/*0x000*/     enum _DMM_CLIENT_TYPE ClientType : 4;                         // 0 BitPosition                  
/*0x004*/     UINT8        _PADDING0_[4];                                                    
/*0x000*/     enum _DMM_VIDPNCHANGE_TYPE VidPnChange : 4;                   // 4 BitPosition                  
              struct                                                        // 3 elements, 0x1 bytes (sizeof) 
              {                                                                                               
/*0x004*/         UINT8        ReclaimClonedTarget : 1;                     // 0 BitPosition                  
/*0x004*/         UINT8        CleanupAfterFailedCommitVidPn : 1;           // 1 BitPosition                  
/*0x004*/         UINT8        ForceAllActiveVidPnModeListInvalidation : 1; // 2 BitPosition                  
              };                                                                                              
/*0x008*/     ULONG32      ModeChangeRequestId;                                                               
          }DMM_COMMITVIDPNREQUEST_DIAGINFO, *PDMM_COMMITVIDPNREQUEST_DIAGINFO;                                  
                                                                                                              
          typedef struct _DMM_VIDPN_SERIALIZATION                  // 3 elements, 0xC bytes (sizeof) 
          {                                                                                          
/*0x000*/     ULONG32      Size;                                                                     
/*0x004*/     UINT8        NumActiveSources;                                                         
/*0x005*/     UINT8        _PADDING0_[0x3];                                                          
/*0x008*/     ULONG32      PathsFromSourceSerializationOffsets[1];                                   
          }DMM_VIDPN_SERIALIZATION, *PDMM_VIDPN_SERIALIZATION;                                       
                                                                                                     
          typedef struct _DMM_COMMITVIDPNREQUEST_SERIALIZATION         // 3 elements, 0x1C bytes (sizeof) 
          {                                                                                               
/*0x000*/     UINT32       AffectedVidPnSourceId;                                                         
/*0x004*/     struct _DMM_COMMITVIDPNREQUEST_DIAGINFO RequestDiagInfo; // 6 elements, 0xC bytes (sizeof)  
/*0x010*/     struct _DMM_VIDPN_SERIALIZATION VidPnSerialization;      // 3 elements, 0xC bytes (sizeof)  
          }DMM_COMMITVIDPNREQUEST_SERIALIZATION, *PDMM_COMMITVIDPNREQUEST_SERIALIZATION;                                   
                                                                                                          
          typedef struct _DMM_COMMITVIDPNREQUESTSET_SERIALIZATION // 2 elements, 0x8 bytes (sizeof) 
          {                                                                                         
/*0x000*/     UINT8        NumCommitVidPnRequests;                                                  
/*0x001*/     UINT8        _PADDING0_[0x3];                                                         
/*0x004*/     ULONG32      CommitVidPnRequestOffset[1];                                             
          }DMM_COMMITVIDPNREQUESTSET_SERIALIZATION, *PDMM_COMMITVIDPNREQUESTSET_SERIALIZATION;                                  
                                                                                                    
          typedef struct _DMM_MONITOR_SERIALIZATION                  // 11 elements, 0x28 bytes (sizeof) 
          {                                                                                              
/*0x000*/     ULONG32      Size;                                                                         
/*0x004*/     UINT32       VideoPresentTargetId;                                                         
/*0x008*/     enum _D3DKMDT_MONITOR_ORIENTATION Orientation;                                             
/*0x00C*/     UINT8        IsSimulatedMonitor;                                                           
/*0x00D*/     UINT8        IsUsingDefaultProfile;                                                        
/*0x00E*/     UINT8        _PADDING0_[0x2];                                                              
/*0x010*/     enum _DMM_MODE_PRUNING_ALGORITHM ModePruningAlgorithm;                                     
/*0x014*/     enum _DEVICE_POWER_STATE MonitorPowerState;                                                
/*0x018*/     ULONG32      SourceModeSetOffset;                                                          
/*0x01C*/     ULONG32      FrequencyRangeSetOffset;                                                      
/*0x020*/     ULONG32      DescriptorSetOffset;                                                          
/*0x024*/     enum _DMM_VIDPN_MONITOR_TYPE MonitorType;                                                  
          }DMM_MONITOR_SERIALIZATION, *PDMM_MONITOR_SERIALIZATION;                                       
                                                                                                         
          typedef struct _DMM_MONITOR_SOURCE_MODE_SERIALIZATION // 2 elements, 0x68 bytes (sizeof) 
          {                                                                                        
/*0x000*/     struct _D3DKMDT_MONITOR_SOURCE_MODE Info;         // 6 elements, 0x60 bytes (sizeof) 
/*0x060*/     enum _D3DKMDT_MONITOR_TIMING_TYPE TimingType;                                        
/*0x064*/     UINT8        _PADDING0_[0x4];                                                        
          }DMM_MONITOR_SOURCE_MODE_SERIALIZATION, *PDMM_MONITOR_SOURCE_MODE_SERIALIZATION;                                   
                                                                                                   
          typedef struct _DMM_MONITORDESCRIPTOR_SERIALIZATION   // 4 elements, 0x8C bytes (sizeof) 
          {                                                                                        
/*0x000*/     UINT32       Id;                                                                     
/*0x004*/     enum _D3DKMDT_MONITOR_DESCRIPTOR_TYPE Type;                                          
/*0x008*/     enum _D3DKMDT_MONITOR_CAPABILITIES_ORIGIN Origin;                                    
/*0x00C*/     UINT8        Data[128];                                                              
          }DMM_MONITORDESCRIPTOR_SERIALIZATION, *PDMM_MONITORDESCRIPTOR_SERIALIZATION;                                   
                                                                                                   
          typedef struct _DMM_MONITORDESCRIPTORSET_SERIALIZATION                      // 2 elements, 0x90 bytes (sizeof) 
          {                                                                                                              
/*0x000*/     UINT8        NumDescriptors;                                                                               
/*0x001*/     UINT8        _PADDING0_[0x3];                                                                              
/*0x004*/     struct _DMM_MONITORDESCRIPTOR_SERIALIZATION DescriptorSerialization[1];                                    
          }DMM_MONITORDESCRIPTORSET_SERIALIZATION, *PDMM_MONITORDESCRIPTORSET_SERIALIZATION;                                   
                                                                                                                         
          typedef struct _DMM_MONITORFREQUENCYRANGESET_SERIALIZATION                  // 2 elements, 0x38 bytes (sizeof) 
          {                                                                                                              
/*0x000*/     UINT8        NumFrequencyRanges;                                                                           
/*0x001*/     UINT8        _PADDING0_[0x7];                                                                              
/*0x008*/     struct _D3DKMDT_MONITOR_FREQUENCY_RANGE FrequencyRangeSerialization[1];                                    
          }DMM_MONITORFREQUENCYRANGESET_SERIALIZATION, *PDMM_MONITORFREQUENCYRANGESET_SERIALIZATION;                                   
                                                                                                                         
          typedef struct _DMM_MONITORSOURCEMODESET_SERIALIZATION                  // 2 elements, 0x70 bytes (sizeof) 
          {                                                                                                          
/*0x000*/     UINT8        NumModes;                                                                                 
/*0x001*/     UINT8        _PADDING0_[0x7];                                                                          
/*0x008*/     struct _DMM_MONITOR_SOURCE_MODE_SERIALIZATION ModeSerialization[1];                                    
          }DMM_MONITORSOURCEMODESET_SERIALIZATION, *PDMM_MONITORSOURCEMODESET_SERIALIZATION;                                   
                                                                                                                     
          typedef struct _DMM_VIDPNPATHANDTARGETMODE_SERIALIZATION // 2 elements, 0x1B0 bytes (sizeof)  
          {                                                                                             
/*0x000*/     struct _D3DKMDT_VIDPN_PRESENT_PATH PathInfo;         // 11 elements, 0x168 bytes (sizeof) 
/*0x168*/     struct _D3DKMDT_VIDPN_TARGET_MODE TargetMode;        // 3 elements, 0x48 bytes (sizeof)   
          }DMM_VIDPNPATHANDTARGETMODE_SERIALIZATION, *PDMM_VIDPNPATHANDTARGETMODE_SERIALIZATION;                                     
                                                                                                        
          typedef struct _DMM_VIDPNTARGETMODESET_SERIALIZATION        // 2 elements, 0x50 bytes (sizeof) 
          {                                                                                              
/*0x000*/     UINT8        NumModes;                                                                     
/*0x001*/     UINT8        _PADDING0_[0x7];                                                              
/*0x008*/     struct _D3DKMDT_VIDPN_TARGET_MODE ModeSerialization[1];                                    
          }DMM_VIDPNTARGETMODESET_SERIALIZATION, *PDMM_VIDPNTARGETMODESET_SERIALIZATION;                                   
                                                                                                         
          typedef struct _DMM_VIDPNPATHANDTARGETMODESET_SERIALIZATION     // 2 elements, 0x1B8 bytes (sizeof)  
          {                                                                                                    
/*0x000*/     struct _D3DKMDT_VIDPN_PRESENT_PATH PathInfo;                // 11 elements, 0x168 bytes (sizeof) 
/*0x168*/     struct _DMM_VIDPNTARGETMODESET_SERIALIZATION TargetModeSet; // 2 elements, 0x50 bytes (sizeof)   
          }DMM_VIDPNPATHANDTARGETMODESET_SERIALIZATION, *PDMM_VIDPNPATHANDTARGETMODESET_SERIALIZATION;                                     
                                                                                                               
          typedef struct _DMM_VIDPNPATHSFROMSOURCE_SERIALIZATION                                  // 3 elements, 0x1E0 bytes (sizeof) 
          {                                                                                                                           
/*0x000*/     struct _D3DKMDT_VIDPN_SOURCE_MODE SourceMode;                                       // 3 elements, 0x28 bytes (sizeof)  
/*0x028*/     UINT8        NumPathsFromSource;                                                                                        
/*0x029*/     UINT8        _PADDING0_[0x7];                                                                                           
/*0x030*/     struct _DMM_VIDPNPATHANDTARGETMODE_SERIALIZATION PathAndTargetModeSerialization[1];                                     
          }DMM_VIDPNPATHSFROMSOURCE_SERIALIZATION, *PDMM_VIDPNPATHSFROMSOURCE_SERIALIZATION;                                          
                                                                                                                                      
          typedef struct _DMM_VIDPNSET_SERIALIZATION // 2 elements, 0x8 bytes (sizeof) 
          {                                                                            
/*0x000*/     UINT8        NumVidPns;                                                  
/*0x001*/     UINT8        _PADDING0_[0x3];                                            
/*0x004*/     ULONG32      VidPnOffset[1];                                             
          }DMM_VIDPNSET_SERIALIZATION, *PDMM_VIDPNSET_SERIALIZATION;                                  
                                                                                       
          typedef struct _DRIVER_EXTENSION           // 4 elements, 0x28 bytes (sizeof) 
          {                                                                             
/*0x000*/     struct _DRIVER_OBJECT* DriverObject;                                      
/*0x008*/     FUNCT_005B_0505_AddDevice* AddDevice;                                     
/*0x010*/     ULONG32      Count;                                                       
/*0x014*/     UINT8        _PADDING0_[0x4];                                             
/*0x018*/     struct _UNICODE_STRING ServiceKeyName; // 3 elements, 0x10 bytes (sizeof) 
          }DRIVER_EXTENSION, *PDRIVER_EXTENSION;                                        
                                                                                        
          typedef struct _DRIVER_OBJECT                                   // 15 elements, 0x150 bytes (sizeof) 
          {                                                                                                    
/*0x000*/     INT16        Type;                                                                               
/*0x002*/     INT16        Size;                                                                               
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                    
/*0x008*/     struct _DEVICE_OBJECT* DeviceObject;                                                             
/*0x010*/     ULONG32      Flags;                                                                              
/*0x014*/     UINT8        _PADDING1_[0x4];                                                                    
/*0x018*/     VOID*        DriverStart;                                                                        
/*0x020*/     ULONG32      DriverSize;                                                                         
/*0x024*/     UINT8        _PADDING2_[0x4];                                                                    
/*0x028*/     VOID*        DriverSection;                                                                      
/*0x030*/     struct _DRIVER_EXTENSION* DriverExtension;                                                       
/*0x038*/     struct _UNICODE_STRING DriverName;                          // 3 elements, 0x10 bytes (sizeof)   
/*0x048*/     struct _UNICODE_STRING* HardwareDatabase;                                                        
/*0x050*/     struct _FAST_IO_DISPATCH* FastIoDispatch;                                                        
/*0x058*/     FUNCT_005B_062C_DriverInit* DriverInit;                                                          
/*0x060*/     FUNCT_00A3_04CF_CancelRoutine_DriverStartIo* DriverStartIo;                                      
/*0x068*/     FUNCT_00A3_0630_DriverUnload* DriverUnload;                                                      
/*0x070*/     FUNCT_005B_0634_MajorFunction* MajorFunction[28];                                                
          }DRIVER_OBJECT, *PDRIVER_OBJECT;                                                                     
                                                                                                               
          typedef struct _DXGK_DIAG_HEADER  // 7 elements, 0x30 bytes (sizeof) 
          {                                                                    
/*0x000*/     enum _DXGK_DIAG_TYPE Type;                                       
/*0x004*/     UINT32       Size;                                               
/*0x008*/     UINT64       LogTimestamp;                                       
/*0x010*/     UINT8        ProcessName[16];                                    
/*0x020*/     UINT64       ThreadId;                                           
/*0x028*/     UINT32       Index;                                              
/*0x02C*/     UINT32       WdLogIdx;                                           
          }DXGK_DIAG_HEADER, *PDXGK_DIAG_HEADER;                                   
                                                                               
          typedef struct _DXGK_DIAG_CODE_POINT_PACKET        // 5 elements, 0x40 bytes (sizeof) 
          {                                                                                     
/*0x000*/     struct _DXGK_DIAG_HEADER Header;               // 7 elements, 0x30 bytes (sizeof) 
/*0x030*/     enum _DXGK_DIAG_CODE_POINT_TYPE CodePointType;                                    
/*0x034*/     UINT32       Param1;                                                              
/*0x038*/     UINT32       Param2;                                                              
/*0x03C*/     UINT32       Param3;                                                              
          }DXGK_DIAG_CODE_POINT_PACKET, *PDXGK_DIAG_CODE_POINT_PACKET;                                   
                                                                                                
typedef struct _ECP_LIST // 0 elements, 0x0 bytes (sizeof) 
{                                                          
}ECP_LIST, *PECP_LIST;                                     
                                                           
typedef struct _EJOB // 0 elements, 0x0 bytes (sizeof) 
{                                                      
}EJOB, *PEJOB;                                         
                                                       
typedef struct _EPROCESS // 0 elements, 0x0 bytes (sizeof) 
{                                                          
}EPROCESS, *PEPROCESS;                                     
                                                           
          typedef struct _OWNER_ENTRY                     // 5 elements, 0x10 bytes (sizeof) 
          {                                                                                  
/*0x000*/     UINT64       OwnerThread;                                                      
              union                                       // 2 elements, 0x8 bytes (sizeof)  
              {                                                                              
                  struct                                  // 3 elements, 0x4 bytes (sizeof)  
                  {                                                                          
/*0x008*/             ULONG32      IoPriorityBoosted : 1; // 0 BitPosition                   
/*0x008*/             ULONG32      OwnerReferenced : 1;   // 1 BitPosition                   
/*0x008*/             ULONG32      OwnerCount : 30;       // 2 BitPosition                   
                  };                                                                         
/*0x008*/         ULONG32      TableSize;                                                    
              };                                                                             
          }OWNER_ENTRY, *POWNER_ENTRY;                                                       
                                                                                             
          typedef struct _ERESOURCE                   // 15 elements, 0x68 bytes (sizeof) 
          {                                                                               
/*0x000*/     struct _LIST_ENTRY SystemResourcesList; // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/     struct _OWNER_ENTRY* OwnerTable;                                            
/*0x018*/     INT16        ActiveCount;                                                   
/*0x01A*/     UINT16       Flag;                                                          
/*0x01C*/     UINT8        _PADDING0_[0x4];                                               
/*0x020*/     struct _KSEMAPHORE* SharedWaiters;                                          
/*0x028*/     struct _KEVENT* ExclusiveWaiters;                                           
/*0x030*/     struct _OWNER_ENTRY OwnerEntry;         // 5 elements, 0x10 bytes (sizeof)  
/*0x040*/     ULONG32      ActiveEntries;                                                 
/*0x044*/     ULONG32      ContentionCount;                                               
/*0x048*/     ULONG32      NumberOfSharedWaiters;                                         
/*0x04C*/     ULONG32      NumberOfExclusiveWaiters;                                      
/*0x050*/     VOID*        Reserved2;                                                     
              union                                   // 2 elements, 0x8 bytes (sizeof)   
              {                                                                           
/*0x058*/         VOID*        Address;                                                   
/*0x058*/         UINT64       CreatorBackTraceIndex;                                     
              };                                                                          
/*0x060*/     UINT64       SpinLock;                                                      
          }ERESOURCE, *PERESOURCE;                                                        
                                                                                          
typedef struct _ETHREAD // 0 elements, 0x0 bytes (sizeof) 
{                                                         
}ETHREAD, *PETHREAD;                                      
                                                          
          typedef struct _EVENT_DATA_DESCRIPTOR // 3 elements, 0x10 bytes (sizeof) 
          {                                                                        
/*0x000*/     UINT64       Ptr;                                                    
/*0x008*/     ULONG32      Size;                                                   
/*0x00C*/     ULONG32      Reserved;                                               
          }EVENT_DATA_DESCRIPTOR, *PEVENT_DATA_DESCRIPTOR;                                   
                                                                                   
          typedef struct _EVENT_DESCRIPTOR // 7 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     UINT16       Id;                                                
/*0x002*/     UINT8        Version;                                           
/*0x003*/     UINT8        Channel;                                           
/*0x004*/     UINT8        Level;                                             
/*0x005*/     UINT8        Opcode;                                            
/*0x006*/     UINT16       Task;                                              
/*0x008*/     UINT64       Keyword;                                           
          }EVENT_DESCRIPTOR, *PEVENT_DESCRIPTOR;                                   
                                                                              
          typedef struct _EX_PUSH_LOCK                 // 7 elements, 0x8 bytes (sizeof) 
          {                                                                              
              union                                    // 3 elements, 0x8 bytes (sizeof) 
              {                                                                          
                  struct                               // 5 elements, 0x8 bytes (sizeof) 
                  {                                                                      
/*0x000*/             UINT64       Locked : 1;         // 0 BitPosition                  
/*0x000*/             UINT64       Waiting : 1;        // 1 BitPosition                  
/*0x000*/             UINT64       Waking : 1;         // 2 BitPosition                  
/*0x000*/             UINT64       MultipleShared : 1; // 3 BitPosition                  
/*0x000*/             UINT64       Shared : 60;        // 4 BitPosition                  
                  };                                                                     
/*0x000*/         UINT64       Value;                                                    
/*0x000*/         VOID*        Ptr;                                                      
              };                                                                         
          }EX_PUSH_LOCK, *PEX_PUSH_LOCK;                                                 
                                                                                         
          typedef struct _EX_PUSH_LOCK_CACHE_AWARE // 1 elements, 0x8 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _EX_PUSH_LOCK* Locks[1];                                        
          }EX_PUSH_LOCK_CACHE_AWARE, *PEX_PUSH_LOCK_CACHE_AWARE;                                  
                                                                                     
          typedef struct _EXCEPTION_RECORD               // 6 elements, 0x98 bytes (sizeof) 
          {                                                                                 
/*0x000*/     LONG32       ExceptionCode;                                                   
/*0x004*/     ULONG32      ExceptionFlags;                                                  
/*0x008*/     struct _EXCEPTION_RECORD* ExceptionRecord;                                    
/*0x010*/     VOID*        ExceptionAddress;                                                
/*0x018*/     ULONG32      NumberParameters;                                                
/*0x01C*/     UINT8        _PADDING0_[0x4];                                                 
/*0x020*/     UINT64       ExceptionInformation[15];                                        
          }EXCEPTION_RECORD, *PEXCEPTION_RECORD;                                            
                                                                                            
          typedef struct _EXCEPTION_REGISTRATION_RECORD    // 2 elements, 0x10 bytes (sizeof) 
          {                                                                                   
/*0x000*/     struct _EXCEPTION_REGISTRATION_RECORD* Next;                                    
/*0x008*/     FUNCT_0160_015F_Handler* Handler;                                               
          }EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD;                                   
                                                                                              
          typedef struct _FAST_IO_DISPATCH                                                                                // 28 elements, 0xE0 bytes (sizeof) 
          {                                                                                                                                                   
/*0x000*/     ULONG32      SizeOfFastIoDispatch;                                                                                                              
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                                                                   
/*0x008*/     FUNCT_0065_0528_FastIoCheckIfPossible* FastIoCheckIfPossible;                                                                                   
/*0x010*/     FUNCT_0065_0568_FastIoRead_FastIoWrite* FastIoRead;                                                                                             
/*0x018*/     FUNCT_0065_0568_FastIoRead_FastIoWrite* FastIoWrite;                                                                                            
/*0x020*/     FUNCT_0065_0572_FastIoQueryBasicInfo* FastIoQueryBasicInfo;                                                                                     
/*0x028*/     FUNCT_0065_0580_FastIoQueryStandardInfo* FastIoQueryStandardInfo;                                                                               
/*0x030*/     FUNCT_0065_058E_FastIoLock* FastIoLock;                                                                                                         
/*0x038*/     FUNCT_0065_0599_FastIoUnlockSingle* FastIoUnlockSingle;                                                                                         
/*0x040*/     FUNCT_0065_05A2_FastIoUnlockAll* FastIoUnlockAll;                                                                                               
/*0x048*/     FUNCT_0065_05A8_FastIoUnlockAllByKey* FastIoUnlockAllByKey;                                                                                     
/*0x050*/     FUNCT_0065_05AF_FastIoDeviceControl* FastIoDeviceControl;                                                                                       
/*0x058*/     FUNCT_00A3_05BA_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection* AcquireFileForNtCreateSection;                                     
/*0x060*/     FUNCT_00A3_05BA_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection* ReleaseFileForNtCreateSection;                                     
/*0x068*/     FUNCT_00A3_05BD_FastIoDetachDevice* FastIoDetachDevice;                                                                                         
/*0x070*/     FUNCT_0065_05C1_FastIoQueryNetworkOpenInfo* FastIoQueryNetworkOpenInfo;                                                                         
/*0x078*/     FUNCT_005B_05D1_AcquireForModWrite* AcquireForModWrite;                                                                                         
/*0x080*/     FUNCT_0065_05F4_MdlRead_PrepareMdlWrite* MdlRead;                                                                                               
/*0x088*/     FUNCT_0065_05FE_MdlReadComplete_MdlReadCompleteCompressed* MdlReadComplete;                                                                     
/*0x090*/     FUNCT_0065_05F4_MdlRead_PrepareMdlWrite* PrepareMdlWrite;                                                                                       
/*0x098*/     FUNCT_0065_0603_MdlWriteComplete_MdlWriteCompleteCompressed* MdlWriteComplete;                                                                  
/*0x0A0*/     FUNCT_0065_0609_FastIoReadCompressed_FastIoWriteCompressed* FastIoReadCompressed;                                                               
/*0x0A8*/     FUNCT_0065_0609_FastIoReadCompressed_FastIoWriteCompressed* FastIoWriteCompressed;                                                              
/*0x0B0*/     FUNCT_0065_05FE_MdlReadComplete_MdlReadCompleteCompressed* MdlReadCompleteCompressed;                                                           
/*0x0B8*/     FUNCT_0065_0603_MdlWriteComplete_MdlWriteCompleteCompressed* MdlWriteCompleteCompressed;                                                        
/*0x0C0*/     FUNCT_0065_061E_FastIoQueryOpen* FastIoQueryOpen;                                                                                               
/*0x0C8*/     FUNCT_005B_0623_ReleaseForModWrite* ReleaseForModWrite;                                                                                         
/*0x0D0*/     FUNCT_005B_0628_AcquireForCcFlush_ReleaseForCcFlush* AcquireForCcFlush;                                                                         
/*0x0D8*/     FUNCT_005B_0628_AcquireForCcFlush_ReleaseForCcFlush* ReleaseForCcFlush;                                                                         
          }FAST_IO_DISPATCH, *PFAST_IO_DISPATCH;                                                                                                              
                                                                                                                                                              
          typedef struct _FAST_MUTEX        // 5 elements, 0x38 bytes (sizeof) 
          {                                                                    
/*0x000*/     LONG32       Count;                                              
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     struct _KTHREAD* Owner;                                          
/*0x010*/     ULONG32      Contention;                                         
/*0x014*/     UINT8        _PADDING1_[0x4];                                    
/*0x018*/     struct _KEVENT Event;         // 1 elements, 0x18 bytes (sizeof) 
/*0x030*/     ULONG32      OldIrql;                                            
/*0x034*/     UINT8        _PADDING2_[0x4];                                    
          }FAST_MUTEX, *PFAST_MUTEX;                                           
                                                                               
          typedef struct _FILE_BASIC_INFORMATION   // 5 elements, 0x28 bytes (sizeof) 
          {                                                                           
/*0x000*/     union _LARGE_INTEGER CreationTime;   // 4 elements, 0x8 bytes (sizeof)  
/*0x008*/     union _LARGE_INTEGER LastAccessTime; // 4 elements, 0x8 bytes (sizeof)  
/*0x010*/     union _LARGE_INTEGER LastWriteTime;  // 4 elements, 0x8 bytes (sizeof)  
/*0x018*/     union _LARGE_INTEGER ChangeTime;     // 4 elements, 0x8 bytes (sizeof)  
/*0x020*/     ULONG32      FileAttributes;                                            
/*0x024*/     UINT8        _PADDING0_[0x4];                                           
          }FILE_BASIC_INFORMATION, *PFILE_BASIC_INFORMATION;                                   
                                                                                      
          typedef struct _FILE_NETWORK_OPEN_INFORMATION // 7 elements, 0x38 bytes (sizeof) 
          {                                                                                
/*0x000*/     union _LARGE_INTEGER CreationTime;        // 4 elements, 0x8 bytes (sizeof)  
/*0x008*/     union _LARGE_INTEGER LastAccessTime;      // 4 elements, 0x8 bytes (sizeof)  
/*0x010*/     union _LARGE_INTEGER LastWriteTime;       // 4 elements, 0x8 bytes (sizeof)  
/*0x018*/     union _LARGE_INTEGER ChangeTime;          // 4 elements, 0x8 bytes (sizeof)  
/*0x020*/     union _LARGE_INTEGER AllocationSize;      // 4 elements, 0x8 bytes (sizeof)  
/*0x028*/     union _LARGE_INTEGER EndOfFile;           // 4 elements, 0x8 bytes (sizeof)  
/*0x030*/     ULONG32      FileAttributes;                                                 
/*0x034*/     UINT8        _PADDING0_[0x4];                                                
          }FILE_NETWORK_OPEN_INFORMATION, *PFILE_NETWORK_OPEN_INFORMATION;                                   
                                                                                           
          typedef struct _FILE_OBJECT                                // 30 elements, 0xD8 bytes (sizeof) 
          {                                                                                              
/*0x000*/     INT16        Type;                                                                         
/*0x002*/     INT16        Size;                                                                         
/*0x004*/     UINT8        _PADDING0_[0x4];                                                              
/*0x008*/     struct _DEVICE_OBJECT* DeviceObject;                                                       
/*0x010*/     struct _VPB* Vpb;                                                                          
/*0x018*/     VOID*        FsContext;                                                                    
/*0x020*/     VOID*        FsContext2;                                                                   
/*0x028*/     struct _SECTION_OBJECT_POINTERS* SectionObjectPointer;                                     
/*0x030*/     VOID*        PrivateCacheMap;                                                              
/*0x038*/     LONG32       FinalStatus;                                                                  
/*0x03C*/     UINT8        _PADDING1_[0x4];                                                              
/*0x040*/     struct _FILE_OBJECT* RelatedFileObject;                                                    
/*0x048*/     UINT8        LockOperation;                                                                
/*0x049*/     UINT8        DeletePending;                                                                
/*0x04A*/     UINT8        ReadAccess;                                                                   
/*0x04B*/     UINT8        WriteAccess;                                                                  
/*0x04C*/     UINT8        DeleteAccess;                                                                 
/*0x04D*/     UINT8        SharedRead;                                                                   
/*0x04E*/     UINT8        SharedWrite;                                                                  
/*0x04F*/     UINT8        SharedDelete;                                                                 
/*0x050*/     ULONG32      Flags;                                                                        
/*0x054*/     UINT8        _PADDING2_[0x4];                                                              
/*0x058*/     struct _UNICODE_STRING FileName;                       // 3 elements, 0x10 bytes (sizeof)  
/*0x068*/     union _LARGE_INTEGER CurrentByteOffset;                // 4 elements, 0x8 bytes (sizeof)   
/*0x070*/     ULONG32      Waiters;                                                                      
/*0x074*/     ULONG32      Busy;                                                                         
/*0x078*/     VOID*        LastLock;                                                                     
/*0x080*/     struct _KEVENT Lock;                                   // 1 elements, 0x18 bytes (sizeof)  
/*0x098*/     struct _KEVENT Event;                                  // 1 elements, 0x18 bytes (sizeof)  
/*0x0B0*/     struct _IO_COMPLETION_CONTEXT* CompletionContext;                                          
/*0x0B8*/     UINT64       IrpListLock;                                                                  
/*0x0C0*/     struct _LIST_ENTRY IrpList;                            // 2 elements, 0x10 bytes (sizeof)  
/*0x0D0*/     VOID*        FileObjectExtension;                                                          
          }FILE_OBJECT, *PFILE_OBJECT;                                                                   
                                                                                                         
          typedef struct _FILE_STANDARD_INFORMATION // 5 elements, 0x18 bytes (sizeof) 
          {                                                                            
/*0x000*/     union _LARGE_INTEGER AllocationSize;  // 4 elements, 0x8 bytes (sizeof)  
/*0x008*/     union _LARGE_INTEGER EndOfFile;       // 4 elements, 0x8 bytes (sizeof)  
/*0x010*/     ULONG32      NumberOfLinks;                                              
/*0x014*/     UINT8        DeletePending;                                              
/*0x015*/     UINT8        Directory;                                                  
/*0x016*/     UINT8        _PADDING0_[0x2];                                            
          }FILE_STANDARD_INFORMATION, *PFILE_STANDARD_INFORMATION;                                   
                                                                                       
typedef struct _FLS_CALLBACK_INFO // 0 elements, 0x0 bytes (sizeof) 
{                                                                   
}FLS_CALLBACK_INFO, *PFLS_CALLBACK_INFO;                                  
                                                                    
          typedef struct _GDI_TEB_BATCH     // 3 elements, 0x4E8 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      Offset;                                              
/*0x004*/     UINT8        _PADDING0_[0x4];                                     
/*0x008*/     UINT64       HDC;                                                 
/*0x010*/     ULONG32      Buffer[310];                                         
          }GDI_TEB_BATCH, *PGDI_TEB_BATCH;                                      
                                                                                
          typedef union _SLIST_HEADER              // 5 elements, 0x10 bytes (sizeof) 
          {                                                                           
              struct                               // 2 elements, 0x10 bytes (sizeof) 
              {                                                                       
/*0x000*/         UINT64       Alignment;                                             
/*0x008*/         UINT64       Region;                                                
              };                                                                      
              struct                               // 7 elements, 0x10 bytes (sizeof) 
              {                                                                       
                  struct                           // 3 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x000*/             UINT64       Depth : 16;     // 0 BitPosition                   
/*0x000*/             UINT64       Sequence : 9;   // 16 BitPosition                  
/*0x000*/             UINT64       NextEntry : 39; // 25 BitPosition                  
                  };                                                                  
                  struct                           // 4 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x008*/             UINT64       HeaderType : 1; // 0 BitPosition                   
/*0x008*/             UINT64       Init : 1;       // 1 BitPosition                   
/*0x008*/             UINT64       Reserved : 59;  // 2 BitPosition                   
/*0x008*/             UINT64       Region : 3;     // 61 BitPosition                  
                  };                                                                  
              }Header8;                                                               
              struct                               // 6 elements, 0x10 bytes (sizeof) 
              {                                                                       
                  struct                           // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x000*/             UINT64       Depth : 16;     // 0 BitPosition                   
/*0x000*/             UINT64       Sequence : 48;  // 16 BitPosition                  
                  };                                                                  
                  struct                           // 4 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x008*/             UINT64       HeaderType : 1; // 0 BitPosition                   
/*0x008*/             UINT64       Init : 1;       // 1 BitPosition                   
/*0x008*/             UINT64       Reserved : 2;   // 2 BitPosition                   
/*0x008*/             UINT64       NextEntry : 60; // 4 BitPosition                   
                  };                                                                  
              }Header16;                                                              
              struct                               // 5 elements, 0x10 bytes (sizeof) 
              {                                                                       
                  struct                           // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x000*/             UINT64       Depth : 16;     // 0 BitPosition                   
/*0x000*/             UINT64       Sequence : 48;  // 16 BitPosition                  
                  };                                                                  
                  struct                           // 3 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x008*/             UINT64       HeaderType : 1; // 0 BitPosition                   
/*0x008*/             UINT64       Reserved : 3;   // 1 BitPosition                   
/*0x008*/             UINT64       NextEntry : 60; // 4 BitPosition                   
                  };                                                                  
              }HeaderX64;                                                             
          }SLIST_HEADER, *PSLIST_HEADER;                                              
                                                                                      
          typedef struct _SINGLE_LIST_ENTRY    // 1 elements, 0x8 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _SINGLE_LIST_ENTRY* Next;                                   
          }SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY;                                  
                                                                                 
          typedef struct _GENERAL_LOOKASIDE                                                                   // 22 elements, 0x80 bytes (sizeof) 
          {                                                                                                                                       
              union                                                                                           // 2 elements, 0x10 bytes (sizeof)  
              {                                                                                                                                   
/*0x000*/         union _SLIST_HEADER ListHead;                                                               // 5 elements, 0x10 bytes (sizeof)  
/*0x000*/         struct _SINGLE_LIST_ENTRY SingleListHead;                                                   // 1 elements, 0x8 bytes (sizeof)   
              };                                                                                                                                  
/*0x010*/     UINT16       Depth;                                                                                                                 
/*0x012*/     UINT16       MaximumDepth;                                                                                                          
/*0x014*/     ULONG32      TotalAllocates;                                                                                                        
              union                                                                                           // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                                   
/*0x018*/         ULONG32      AllocateMisses;                                                                                                    
/*0x018*/         ULONG32      AllocateHits;                                                                                                      
              };                                                                                                                                  
/*0x01C*/     ULONG32      TotalFrees;                                                                                                            
              union                                                                                           // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                                   
/*0x020*/         ULONG32      FreeMisses;                                                                                                        
/*0x020*/         ULONG32      FreeHits;                                                                                                          
              };                                                                                                                                  
/*0x024*/     enum _POOL_TYPE Type;                                                                                                               
/*0x028*/     ULONG32      Tag;                                                                                                                   
/*0x02C*/     ULONG32      Size;                                                                                                                  
              union                                                                                           // 2 elements, 0x8 bytes (sizeof)   
              {                                                                                                                                   
/*0x030*/         FUNCT_00A6_0458_AllocateEx* AllocateEx;                                                                                         
/*0x030*/         FUNCT_00A6_045F_Allocate* Allocate;                                                                                             
              };                                                                                                                                  
              union                                                                                           // 2 elements, 0x8 bytes (sizeof)   
              {                                                                                                                                   
/*0x038*/         FUNCT_00A3_0464_FreeEx* FreeEx;                                                                                                 
/*0x038*/         FUNCT_00A3_0468_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_pfnFree* Free;                                     
              };                                                                                                                                  
/*0x040*/     struct _LIST_ENTRY ListEntry;                                                                   // 2 elements, 0x10 bytes (sizeof)  
/*0x050*/     ULONG32      LastTotalAllocates;                                                                                                    
              union                                                                                           // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                                   
/*0x054*/         ULONG32      LastAllocateMisses;                                                                                                
/*0x054*/         ULONG32      LastAllocateHits;                                                                                                  
              };                                                                                                                                  
/*0x058*/     ULONG32      Future[2];                                                                                                             
/*0x060*/     UINT8        _PADDING0_[0x20];                                                                                                      
          }GENERAL_LOOKASIDE, *PGENERAL_LOOKASIDE;                                                                                                
                                                                                                                                                  
          typedef struct _GENERAL_LOOKASIDE_POOL                                                              // 22 elements, 0x60 bytes (sizeof) 
          {                                                                                                                                       
              union                                                                                           // 2 elements, 0x10 bytes (sizeof)  
              {                                                                                                                                   
/*0x000*/         union _SLIST_HEADER ListHead;                                                               // 5 elements, 0x10 bytes (sizeof)  
/*0x000*/         struct _SINGLE_LIST_ENTRY SingleListHead;                                                   // 1 elements, 0x8 bytes (sizeof)   
              };                                                                                                                                  
/*0x010*/     UINT16       Depth;                                                                                                                 
/*0x012*/     UINT16       MaximumDepth;                                                                                                          
/*0x014*/     ULONG32      TotalAllocates;                                                                                                        
              union                                                                                           // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                                   
/*0x018*/         ULONG32      AllocateMisses;                                                                                                    
/*0x018*/         ULONG32      AllocateHits;                                                                                                      
              };                                                                                                                                  
/*0x01C*/     ULONG32      TotalFrees;                                                                                                            
              union                                                                                           // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                                   
/*0x020*/         ULONG32      FreeMisses;                                                                                                        
/*0x020*/         ULONG32      FreeHits;                                                                                                          
              };                                                                                                                                  
/*0x024*/     enum _POOL_TYPE Type;                                                                                                               
/*0x028*/     ULONG32      Tag;                                                                                                                   
/*0x02C*/     ULONG32      Size;                                                                                                                  
              union                                                                                           // 2 elements, 0x8 bytes (sizeof)   
              {                                                                                                                                   
/*0x030*/         FUNCT_00A6_0458_AllocateEx* AllocateEx;                                                                                         
/*0x030*/         FUNCT_00A6_045F_Allocate* Allocate;                                                                                             
              };                                                                                                                                  
              union                                                                                           // 2 elements, 0x8 bytes (sizeof)   
              {                                                                                                                                   
/*0x038*/         FUNCT_00A3_0464_FreeEx* FreeEx;                                                                                                 
/*0x038*/         FUNCT_00A3_0468_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_pfnFree* Free;                                     
              };                                                                                                                                  
/*0x040*/     struct _LIST_ENTRY ListEntry;                                                                   // 2 elements, 0x10 bytes (sizeof)  
/*0x050*/     ULONG32      LastTotalAllocates;                                                                                                    
              union                                                                                           // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                                   
/*0x054*/         ULONG32      LastAllocateMisses;                                                                                                
/*0x054*/         ULONG32      LastAllocateHits;                                                                                                  
              };                                                                                                                                  
/*0x058*/     ULONG32      Future[2];                                                                                                             
          }GENERAL_LOOKASIDE_POOL, *PGENERAL_LOOKASIDE_POOL;                                                                                      
                                                                                                                                                  
          typedef struct _HANDLEENTRY       // 5 elements, 0x18 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _HEAD* phead;                                             
/*0x008*/     VOID*        pOwner;                                             
/*0x010*/     UINT8        bType;                                              
/*0x011*/     UINT8        bFlags;                                             
/*0x012*/     UINT16       wUniq;                                              
/*0x014*/     UINT8        _PADDING0_[0x4];                                    
          }HANDLEENTRY, *PHANDLEENTRY;                                         
                                                                               
          typedef struct _HBITMAP__ // 1 elements, 0x4 bytes (sizeof) 
          {                                                           
/*0x000*/     INT32        unused;                                    
          }HBITMAP__, *PHBITMAP__;                                    
                                                                      
          typedef struct _HBRUSH__ // 1 elements, 0x4 bytes (sizeof) 
          {                                                          
/*0x000*/     INT32        unused;                                   
          }HBRUSH__, *PHBRUSH__;                                     
                                                                     
          typedef struct _HDC__    // 1 elements, 0x4 bytes (sizeof) 
          {                                                          
/*0x000*/     INT32        unused;                                   
          }HDC__, *PHDC__;                                           
                                                                     
          typedef struct _HDESK__  // 1 elements, 0x4 bytes (sizeof) 
          {                                                          
/*0x000*/     INT32        unused;                                   
          }HDESK__, *PHDESK__;                                       
                                                                     
          typedef struct _HEAD              // 2 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     VOID*        h;                                                  
/*0x008*/     ULONG32      cLockObj;                                           
/*0x00C*/     UINT8        _PADDING0_[0x4];                                    
          }HEAD, *PHEAD;                                                       
                                                                               
          typedef struct _HFONT__  // 1 elements, 0x4 bytes (sizeof) 
          {                                                          
/*0x000*/     INT32        unused;                                   
          }HFONT__, *PHFONT__;                                       
                                                                     
          typedef struct _HGESTUREINFO__ // 1 elements, 0x4 bytes (sizeof) 
          {                                                                
/*0x000*/     INT32        unused;                                         
          }HGESTUREINFO__, *PHGESTUREINFO__;                                  
                                                                           
          typedef struct _HICON__  // 1 elements, 0x4 bytes (sizeof) 
          {                                                          
/*0x000*/     INT32        unused;                                   
          }HICON__, *PHICON__;                                       
                                                                     
          typedef struct _HIMC__   // 1 elements, 0x4 bytes (sizeof) 
          {                                                          
/*0x000*/     INT32        unused;                                   
          }HIMC__, *PHIMC__;                                         
                                                                     
          typedef struct _HKL__    // 1 elements, 0x4 bytes (sizeof) 
          {                                                          
/*0x000*/     INT32        unused;                                   
          }HKL__, *PHKL__;                                           
                                                                     
          typedef struct _HMONITOR__ // 1 elements, 0x4 bytes (sizeof) 
          {                                                            
/*0x000*/     INT32        unused;                                     
          }HMONITOR__, *PHMONITOR__;                                   
                                                                       
          typedef struct _HRGN__   // 1 elements, 0x4 bytes (sizeof) 
          {                                                          
/*0x000*/     INT32        unused;                                   
          }HRGN__, *PHRGN__;                                         
                                                                     
          typedef struct _HTOUCHINPUT__ // 1 elements, 0x4 bytes (sizeof) 
          {                                                               
/*0x000*/     INT32        unused;                                        
          }HTOUCHINPUT__, *PHTOUCHINPUT__;                                  
                                                                          
          typedef struct _HWINSTA__ // 1 elements, 0x4 bytes (sizeof) 
          {                                                           
/*0x000*/     INT32        unused;                                    
          }HWINSTA__, *PHWINSTA__;                                    
                                                                      
          typedef struct _HWND__   // 1 elements, 0x4 bytes (sizeof) 
          {                                                          
/*0x000*/     INT32        unused;                                   
          }HWND__, *PHWND__;                                         
                                                                     
          typedef struct _IMAGE_DATA_DIRECTORY // 2 elements, 0x8 bytes (sizeof) 
          {                                                                      
/*0x000*/     ULONG32      VirtualAddress;                                       
/*0x004*/     ULONG32      Size;                                                 
          }IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY;                                  
                                                                                 
          typedef struct _IMAGE_DOS_HEADER // 19 elements, 0x40 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT16       e_magic;                                            
/*0x002*/     UINT16       e_cblp;                                             
/*0x004*/     UINT16       e_cp;                                               
/*0x006*/     UINT16       e_crlc;                                             
/*0x008*/     UINT16       e_cparhdr;                                          
/*0x00A*/     UINT16       e_minalloc;                                         
/*0x00C*/     UINT16       e_maxalloc;                                         
/*0x00E*/     UINT16       e_ss;                                               
/*0x010*/     UINT16       e_sp;                                               
/*0x012*/     UINT16       e_csum;                                             
/*0x014*/     UINT16       e_ip;                                               
/*0x016*/     UINT16       e_cs;                                               
/*0x018*/     UINT16       e_lfarlc;                                           
/*0x01A*/     UINT16       e_ovno;                                             
/*0x01C*/     UINT16       e_res[4];                                           
/*0x024*/     UINT16       e_oemid;                                            
/*0x026*/     UINT16       e_oeminfo;                                          
/*0x028*/     UINT16       e_res2[10];                                         
/*0x03C*/     LONG32       e_lfanew;                                           
          }IMAGE_DOS_HEADER, *PIMAGE_DOS_HEADER;                                    
                                                                               
          typedef struct _IMAGE_FILE_HEADER      // 7 elements, 0x14 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT16       Machine;                                                 
/*0x002*/     UINT16       NumberOfSections;                                        
/*0x004*/     ULONG32      TimeDateStamp;                                           
/*0x008*/     ULONG32      PointerToSymbolTable;                                    
/*0x00C*/     ULONG32      NumberOfSymbols;                                         
/*0x010*/     UINT16       SizeOfOptionalHeader;                                    
/*0x012*/     UINT16       Characteristics;                                         
          }IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER;                                   
                                                                                    
          typedef struct _IMAGE_OPTIONAL_HEADER64             // 30 elements, 0xF0 bytes (sizeof) 
          {                                                                                       
/*0x000*/     UINT16       Magic;                                                                 
/*0x002*/     UINT8        MajorLinkerVersion;                                                    
/*0x003*/     UINT8        MinorLinkerVersion;                                                    
/*0x004*/     ULONG32      SizeOfCode;                                                            
/*0x008*/     ULONG32      SizeOfInitializedData;                                                 
/*0x00C*/     ULONG32      SizeOfUninitializedData;                                               
/*0x010*/     ULONG32      AddressOfEntryPoint;                                                   
/*0x014*/     ULONG32      BaseOfCode;                                                            
/*0x018*/     UINT64       ImageBase;                                                             
/*0x020*/     ULONG32      SectionAlignment;                                                      
/*0x024*/     ULONG32      FileAlignment;                                                         
/*0x028*/     UINT16       MajorOperatingSystemVersion;                                           
/*0x02A*/     UINT16       MinorOperatingSystemVersion;                                           
/*0x02C*/     UINT16       MajorImageVersion;                                                     
/*0x02E*/     UINT16       MinorImageVersion;                                                     
/*0x030*/     UINT16       MajorSubsystemVersion;                                                 
/*0x032*/     UINT16       MinorSubsystemVersion;                                                 
/*0x034*/     ULONG32      Win32VersionValue;                                                     
/*0x038*/     ULONG32      SizeOfImage;                                                           
/*0x03C*/     ULONG32      SizeOfHeaders;                                                         
/*0x040*/     ULONG32      CheckSum;                                                              
/*0x044*/     UINT16       Subsystem;                                                             
/*0x046*/     UINT16       DllCharacteristics;                                                    
/*0x048*/     UINT64       SizeOfStackReserve;                                                    
/*0x050*/     UINT64       SizeOfStackCommit;                                                     
/*0x058*/     UINT64       SizeOfHeapReserve;                                                     
/*0x060*/     UINT64       SizeOfHeapCommit;                                                      
/*0x068*/     ULONG32      LoaderFlags;                                                           
/*0x06C*/     ULONG32      NumberOfRvaAndSizes;                                                   
/*0x070*/     struct _IMAGE_DATA_DIRECTORY DataDirectory[16];                                     
          }IMAGE_OPTIONAL_HEADER64, *PIMAGE_OPTIONAL_HEADER64;                                    
                                                                                                  
          typedef struct _IMAGE_NT_HEADERS64                  // 3 elements, 0x108 bytes (sizeof) 
          {                                                                                       
/*0x000*/     ULONG32      Signature;                                                             
/*0x004*/     struct _IMAGE_FILE_HEADER FileHeader;           // 7 elements, 0x14 bytes (sizeof)  
/*0x018*/     struct _IMAGE_OPTIONAL_HEADER64 OptionalHeader; // 30 elements, 0xF0 bytes (sizeof) 
          }IMAGE_NT_HEADERS64, *PIMAGE_NT_HEADERS64;                                              
                                                                                                  
          typedef struct _INTERFACE                                                                                       // 5 elements, 0x20 bytes (sizeof) 
          {                                                                                                                                                  
/*0x000*/     UINT16       Size;                                                                                                                             
/*0x002*/     UINT16       Version;                                                                                                                          
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                                                                  
/*0x008*/     VOID*        Context;                                                                                                                          
/*0x010*/     FUNCT_00A3_0468_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_pfnFree* InterfaceReference;                                      
/*0x018*/     FUNCT_00A3_0468_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_pfnFree* InterfaceDereference;                                    
          }INTERFACE, *PINTERFACE;                                                                                                                           
                                                                                                                                                             
          typedef struct _IO_COMPLETION_CONTEXT // 2 elements, 0x10 bytes (sizeof) 
          {                                                                        
/*0x000*/     VOID*        Port;                                                   
/*0x008*/     VOID*        Key;                                                    
          }IO_COMPLETION_CONTEXT, *PIO_COMPLETION_CONTEXT;                                   
                                                                                   
          typedef struct _IO_DRIVER_CREATE_CONTEXT        // 4 elements, 0x20 bytes (sizeof) 
          {                                                                                  
/*0x000*/     INT16        Size;                                                             
/*0x002*/     UINT8        _PADDING0_[0x6];                                                  
/*0x008*/     struct _ECP_LIST* ExtraCreateParameter;                                        
/*0x010*/     VOID*        DeviceObjectHint;                                                 
/*0x018*/     struct _TXN_PARAMETER_BLOCK* TxnParameters;                                    
          }IO_DRIVER_CREATE_CONTEXT, *PIO_DRIVER_CREATE_CONTEXT;                                   
                                                                                             
          typedef struct _IO_RESOURCE_DESCRIPTOR           // 7 elements, 0x20 bytes (sizeof)  
          {                                                                                    
/*0x000*/     UINT8        Option;                                                             
/*0x001*/     UINT8        Type;                                                               
/*0x002*/     UINT8        ShareDisposition;                                                   
/*0x003*/     UINT8        Spare1;                                                             
/*0x004*/     UINT16       Flags;                                                              
/*0x006*/     UINT16       Spare2;                                                             
              union                                        // 11 elements, 0x18 bytes (sizeof) 
              {                                                                                
                  struct                                   // 4 elements, 0x18 bytes (sizeof)  
                  {                                                                            
/*0x008*/             ULONG32      Length;                                                     
/*0x00C*/             ULONG32      Alignment;                                                  
/*0x010*/             union _LARGE_INTEGER MinimumAddress; // 4 elements, 0x8 bytes (sizeof)   
/*0x018*/             union _LARGE_INTEGER MaximumAddress; // 4 elements, 0x8 bytes (sizeof)   
                  }Port;                                                                       
                  struct                                   // 4 elements, 0x18 bytes (sizeof)  
                  {                                                                            
/*0x008*/             ULONG32      Length;                                                     
/*0x00C*/             ULONG32      Alignment;                                                  
/*0x010*/             union _LARGE_INTEGER MinimumAddress; // 4 elements, 0x8 bytes (sizeof)   
/*0x018*/             union _LARGE_INTEGER MaximumAddress; // 4 elements, 0x8 bytes (sizeof)   
                  }Memory;                                                                     
                  struct                                   // 6 elements, 0x18 bytes (sizeof)  
                  {                                                                            
/*0x008*/             ULONG32      MinimumVector;                                              
/*0x00C*/             ULONG32      MaximumVector;                                              
/*0x010*/             UINT16       AffinityPolicy;                                             
/*0x012*/             UINT16       Group;                                                      
/*0x014*/             enum _IRQ_PRIORITY PriorityPolicy;                                       
/*0x018*/             UINT64       TargetedProcessors;                                         
                  }Interrupt;                                                                  
                  struct                                   // 2 elements, 0x8 bytes (sizeof)   
                  {                                                                            
/*0x008*/             ULONG32      MinimumChannel;                                             
/*0x00C*/             ULONG32      MaximumChannel;                                             
                  }Dma;                                                                        
                  struct                                   // 4 elements, 0x18 bytes (sizeof)  
                  {                                                                            
/*0x008*/             ULONG32      Length;                                                     
/*0x00C*/             ULONG32      Alignment;                                                  
/*0x010*/             union _LARGE_INTEGER MinimumAddress; // 4 elements, 0x8 bytes (sizeof)   
/*0x018*/             union _LARGE_INTEGER MaximumAddress; // 4 elements, 0x8 bytes (sizeof)   
                  }Generic;                                                                    
                  struct                                   // 1 elements, 0xC bytes (sizeof)   
                  {                                                                            
/*0x008*/             ULONG32      Data[3];                                                    
                  }DevicePrivate;                                                              
                  struct                                   // 4 elements, 0x10 bytes (sizeof)  
                  {                                                                            
/*0x008*/             ULONG32      Length;                                                     
/*0x00C*/             ULONG32      MinBusNumber;                                               
/*0x010*/             ULONG32      MaxBusNumber;                                               
/*0x014*/             ULONG32      Reserved;                                                   
                  }BusNumber;                                                                  
                  struct                                   // 3 elements, 0xC bytes (sizeof)   
                  {                                                                            
/*0x008*/             ULONG32      Priority;                                                   
/*0x00C*/             ULONG32      Reserved1;                                                  
/*0x010*/             ULONG32      Reserved2;                                                  
                  }ConfigData;                                                                 
                  struct                                   // 4 elements, 0x18 bytes (sizeof)  
                  {                                                                            
/*0x008*/             ULONG32      Length40;                                                   
/*0x00C*/             ULONG32      Alignment40;                                                
/*0x010*/             union _LARGE_INTEGER MinimumAddress; // 4 elements, 0x8 bytes (sizeof)   
/*0x018*/             union _LARGE_INTEGER MaximumAddress; // 4 elements, 0x8 bytes (sizeof)   
                  }Memory40;                                                                   
                  struct                                   // 4 elements, 0x18 bytes (sizeof)  
                  {                                                                            
/*0x008*/             ULONG32      Length48;                                                   
/*0x00C*/             ULONG32      Alignment48;                                                
/*0x010*/             union _LARGE_INTEGER MinimumAddress; // 4 elements, 0x8 bytes (sizeof)   
/*0x018*/             union _LARGE_INTEGER MaximumAddress; // 4 elements, 0x8 bytes (sizeof)   
                  }Memory48;                                                                   
                  struct                                   // 4 elements, 0x18 bytes (sizeof)  
                  {                                                                            
/*0x008*/             ULONG32      Length64;                                                   
/*0x00C*/             ULONG32      Alignment64;                                                
/*0x010*/             union _LARGE_INTEGER MinimumAddress; // 4 elements, 0x8 bytes (sizeof)   
/*0x018*/             union _LARGE_INTEGER MaximumAddress; // 4 elements, 0x8 bytes (sizeof)   
                  }Memory64;                                                                   
              }u;                                                                              
          }IO_RESOURCE_DESCRIPTOR, *PIO_RESOURCE_DESCRIPTOR;                                    
                                                                                               
          typedef struct _IO_RESOURCE_LIST                   // 4 elements, 0x28 bytes (sizeof) 
          {                                                                                     
/*0x000*/     UINT16       Version;                                                             
/*0x002*/     UINT16       Revision;                                                            
/*0x004*/     ULONG32      Count;                                                               
/*0x008*/     struct _IO_RESOURCE_DESCRIPTOR Descriptors[1];                                    
          }IO_RESOURCE_LIST, *PIO_RESOURCE_LIST;                                                
                                                                                                
          typedef struct _IO_RESOURCE_REQUIREMENTS_LIST // 7 elements, 0x48 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      ListSize;                                                       
/*0x004*/     enum _INTERFACE_TYPE InterfaceType;                                          
/*0x008*/     ULONG32      BusNumber;                                                      
/*0x00C*/     ULONG32      SlotNumber;                                                     
/*0x010*/     ULONG32      Reserved[3];                                                    
/*0x01C*/     ULONG32      AlternativeLists;                                               
/*0x020*/     struct _IO_RESOURCE_LIST List[1];                                            
          }IO_RESOURCE_REQUIREMENTS_LIST, *PIO_RESOURCE_REQUIREMENTS_LIST;                                   
                                                                                           
          typedef struct _IO_SECURITY_CONTEXT                   // 4 elements, 0x18 bytes (sizeof) 
          {                                                                                        
/*0x000*/     struct _SECURITY_QUALITY_OF_SERVICE* SecurityQos;                                    
/*0x008*/     struct _ACCESS_STATE* AccessState;                                                   
/*0x010*/     ULONG32      DesiredAccess;                                                          
/*0x014*/     ULONG32      FullCreateOptions;                                                      
          }IO_SECURITY_CONTEXT, *PIO_SECURITY_CONTEXT;                                             
                                                                                                   
          typedef struct _SYSTEM_POWER_STATE_CONTEXT          // 8 elements, 0x4 bytes (sizeof) 
          {                                                                                     
              union                                           // 2 elements, 0x4 bytes (sizeof) 
              {                                                                                 
                  struct                                      // 7 elements, 0x4 bytes (sizeof) 
                  {                                                                             
/*0x000*/             ULONG32      Reserved1 : 8;             // 0 BitPosition                  
/*0x000*/             ULONG32      TargetSystemState : 4;     // 8 BitPosition                  
/*0x000*/             ULONG32      EffectiveSystemState : 4;  // 12 BitPosition                 
/*0x000*/             ULONG32      CurrentSystemState : 4;    // 16 BitPosition                 
/*0x000*/             ULONG32      IgnoreHibernationPath : 1; // 20 BitPosition                 
/*0x000*/             ULONG32      PseudoTransition : 1;      // 21 BitPosition                 
/*0x000*/             ULONG32      Reserved2 : 10;            // 22 BitPosition                 
                  };                                                                            
/*0x000*/         ULONG32      ContextAsUlong;                                                  
              };                                                                                
          }SYSTEM_POWER_STATE_CONTEXT, *PSYSTEM_POWER_STATE_CONTEXT;                                  
                                                                                                
          typedef union _POWER_STATE                // 2 elements, 0x4 bytes (sizeof) 
          {                                                                           
/*0x000*/     enum _SYSTEM_POWER_STATE SystemState;                                   
/*0x000*/     enum _DEVICE_POWER_STATE DeviceState;                                   
          }POWER_STATE, *PPOWER_STATE;                                                
                                                                                      
          typedef struct _IO_STACK_LOCATION                                             // 9 elements, 0x48 bytes (sizeof)  
          {                                                                                                                 
/*0x000*/     UINT8        MajorFunction;                                                                                   
/*0x001*/     UINT8        MinorFunction;                                                                                   
/*0x002*/     UINT8        Flags;                                                                                           
/*0x003*/     UINT8        Control;                                                                                         
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                                 
              union                                                                     // 33 elements, 0x20 bytes (sizeof) 
              {                                                                                                             
                  struct                                                                // 5 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             struct _IO_SECURITY_CONTEXT* SecurityContext;                                                         
/*0x010*/             ULONG32      Options;                                                                                 
/*0x014*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x018*/             UINT16       FileAttributes;                                                                          
/*0x01A*/             UINT16       ShareAccess;                                                                             
/*0x01C*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x020*/             ULONG32      EaLength;                                                                                
/*0x024*/             UINT8        _PADDING3_[0x4];                                                                         
                  }Create;                                                                                                  
                  struct                                                                // 5 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             struct _IO_SECURITY_CONTEXT* SecurityContext;                                                         
/*0x010*/             ULONG32      Options;                                                                                 
/*0x014*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x018*/             UINT16       Reserved;                                                                                
/*0x01A*/             UINT16       ShareAccess;                                                                             
/*0x01C*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x020*/             struct _NAMED_PIPE_CREATE_PARAMETERS* Parameters;                                                     
                  }CreatePipe;                                                                                              
                  struct                                                                // 5 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             struct _IO_SECURITY_CONTEXT* SecurityContext;                                                         
/*0x010*/             ULONG32      Options;                                                                                 
/*0x014*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x018*/             UINT16       Reserved;                                                                                
/*0x01A*/             UINT16       ShareAccess;                                                                             
/*0x01C*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x020*/             struct _MAILSLOT_CREATE_PARAMETERS* Parameters;                                                       
                  }CreateMailslot;                                                                                          
                  struct                                                                // 3 elements, 0x18 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      Length;                                                                                  
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             ULONG32      Key;                                                                                     
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x018*/             union _LARGE_INTEGER ByteOffset;                                  // 4 elements, 0x8 bytes (sizeof)   
                  }Read;                                                                                                    
                  struct                                                                // 3 elements, 0x18 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      Length;                                                                                  
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             ULONG32      Key;                                                                                     
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x018*/             union _LARGE_INTEGER ByteOffset;                                  // 4 elements, 0x8 bytes (sizeof)   
                  }Write;                                                                                                   
                  struct                                                                // 4 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      Length;                                                                                  
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             struct _UNICODE_STRING* FileName;                                                                     
/*0x018*/             enum _FILE_INFORMATION_CLASS FileInformationClass;                                                    
/*0x01C*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x020*/             ULONG32      FileIndex;                                                                               
/*0x024*/             UINT8        _PADDING3_[0x4];                                                                         
                  }QueryDirectory;                                                                                          
                  struct                                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      Length;                                                                                  
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             ULONG32      CompletionFilter;                                                                        
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
                  }NotifyDirectory;                                                                                         
                  struct                                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      Length;                                                                                  
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             enum _FILE_INFORMATION_CLASS FileInformationClass;                                                    
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
                  }QueryFile;                                                                                               
                  struct                                                                // 7 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      Length;                                                                                  
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             enum _FILE_INFORMATION_CLASS FileInformationClass;                                                    
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x018*/             struct _FILE_OBJECT* FileObject;                                                                      
                      union                                                             // 3 elements, 0x8 bytes (sizeof)   
                      {                                                                                                     
                          struct                                                        // 2 elements, 0x8 bytes (sizeof)   
                          {                                                                                                 
/*0x020*/                     UINT8        ReplaceIfExists;                                                                 
/*0x021*/                     UINT8        AdvanceOnly;                                                                     
/*0x022*/                     UINT8        _PADDING3_[0x6];                                                                 
                          };                                                                                                
/*0x020*/                 ULONG32      ClusterCount;                                                                        
/*0x020*/                 VOID*        DeleteHandle;                                                                        
                      };                                                                                                    
                  }SetFile;                                                                                                 
                  struct                                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      Length;                                                                                  
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             enum _FSINFOCLASS FsInformationClass;                                                                 
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
                  }QueryVolume;                                                                                             
                  struct                                                                // 4 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      OutputBufferLength;                                                                      
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             ULONG32      InputBufferLength;                                                                       
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x018*/             ULONG32      FsControlCode;                                                                           
/*0x01C*/             UINT8        _PADDING3_[0x4];                                                                         
/*0x020*/             VOID*        Type3InputBuffer;                                                                        
                  }FileSystemControl;                                                                                       
                  struct                                                                // 3 elements, 0x18 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             union _LARGE_INTEGER* Length;                                                                         
/*0x010*/             ULONG32      Key;                                                                                     
/*0x014*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x018*/             union _LARGE_INTEGER ByteOffset;                                  // 4 elements, 0x8 bytes (sizeof)   
                  }LockControl;                                                                                             
                  struct                                                                // 4 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      OutputBufferLength;                                                                      
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             ULONG32      InputBufferLength;                                                                       
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x018*/             ULONG32      IoControlCode;                                                                           
/*0x01C*/             UINT8        _PADDING3_[0x4];                                                                         
/*0x020*/             VOID*        Type3InputBuffer;                                                                        
                  }DeviceIoControl;                                                                                         
                  struct                                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      SecurityInformation;                                                                     
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             ULONG32      Length;                                                                                  
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
                  }QuerySecurity;                                                                                           
                  struct                                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      SecurityInformation;                                                                     
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             VOID*        SecurityDescriptor;                                                                      
                  }SetSecurity;                                                                                             
                  struct                                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             struct _VPB* Vpb;                                                                                     
/*0x010*/             struct _DEVICE_OBJECT* DeviceObject;                                                                  
                  }MountVolume;                                                                                             
                  struct                                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             struct _VPB* Vpb;                                                                                     
/*0x010*/             struct _DEVICE_OBJECT* DeviceObject;                                                                  
                  }VerifyVolume;                                                                                            
                  struct                                                                // 1 elements, 0x8 bytes (sizeof)   
                  {                                                                                                         
/*0x008*/             struct _SCSI_REQUEST_BLOCK* Srb;                                                                      
                  }Scsi;                                                                                                    
                  struct                                                                // 1 elements, 0x4 bytes (sizeof)   
                  {                                                                                                         
/*0x008*/             enum _DEVICE_RELATION_TYPE Type;                                                                      
                  }QueryDeviceRelations;                                                                                    
                  struct                                                                // 5 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             struct _GUID* InterfaceType;                                                                          
/*0x010*/             UINT16       Size;                                                                                    
/*0x012*/             UINT16       Version;                                                                                 
/*0x014*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x018*/             struct _INTERFACE* Interface;                                                                         
/*0x020*/             VOID*        InterfaceSpecificData;                                                                   
                  }QueryInterface;                                                                                          
                  struct                                                                // 1 elements, 0x8 bytes (sizeof)   
                  {                                                                                                         
/*0x008*/             struct _DEVICE_CAPABILITIES* Capabilities;                                                            
                  }DeviceCapabilities;                                                                                      
                  struct                                                                // 1 elements, 0x8 bytes (sizeof)   
                  {                                                                                                         
/*0x008*/             struct _IO_RESOURCE_REQUIREMENTS_LIST* IoResourceRequirementList;                                     
                  }FilterResourceRequirements;                                                                              
                  struct                                                                // 4 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             ULONG32      WhichSpace;                                                                              
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             VOID*        Buffer;                                                                                  
/*0x018*/             ULONG32      Offset;                                                                                  
/*0x01C*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x020*/             ULONG32      Length;                                                                                  
/*0x024*/             UINT8        _PADDING3_[0x4];                                                                         
                  }ReadWriteConfig;                                                                                         
                  struct                                                                // 1 elements, 0x1 bytes (sizeof)   
                  {                                                                                                         
/*0x008*/             UINT8        Lock;                                                                                    
                  }SetLock;                                                                                                 
                  struct                                                                // 1 elements, 0x4 bytes (sizeof)   
                  {                                                                                                         
/*0x008*/             enum _BUS_QUERY_ID_TYPE IdType;                                                                       
                  }QueryId;                                                                                                 
                  struct                                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             enum _DEVICE_TEXT_TYPE DeviceTextType;                                                                
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             ULONG32      LocaleId;                                                                                
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
                  }QueryDeviceText;                                                                                         
                  struct                                                                // 3 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             UINT8        InPath;                                                                                  
/*0x009*/             UINT8        Reserved[3];                                                                             
/*0x00C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x010*/             enum _DEVICE_USAGE_NOTIFICATION_TYPE Type;                                                            
/*0x014*/             UINT8        _PADDING2_[0x4];                                                                         
                  }UsageNotification;                                                                                       
                  struct                                                                // 1 elements, 0x4 bytes (sizeof)   
                  {                                                                                                         
/*0x008*/             enum _SYSTEM_POWER_STATE PowerState;                                                                  
                  }WaitWake;                                                                                                
                  struct                                                                // 1 elements, 0x8 bytes (sizeof)   
                  {                                                                                                         
/*0x008*/             struct _POWER_SEQUENCE* PowerSequence;                                                                
                  }PowerSequence;                                                                                           
                  struct                                                                // 5 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
                      union                                                             // 2 elements, 0x8 bytes (sizeof)   
                      {                                                                                                     
/*0x008*/                 ULONG32      SystemContext;                                                                       
/*0x008*/                 struct _SYSTEM_POWER_STATE_CONTEXT SystemPowerStateContext;   // 8 elements, 0x4 bytes (sizeof)   
                      };                                                                                                    
/*0x010*/             enum _POWER_STATE_TYPE Type;                                                                          
/*0x014*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x018*/             union _POWER_STATE State;                                         // 2 elements, 0x4 bytes (sizeof)   
/*0x01C*/             UINT8        _PADDING2_[0x4];                                                                         
/*0x020*/             enum _POWER_ACTION ShutdownType;                                                                      
/*0x024*/             UINT8        _PADDING3_[0x4];                                                                         
                  }Power;                                                                                                   
                  struct                                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             struct _CM_RESOURCE_LIST* AllocatedResources;                                                         
/*0x010*/             struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;                                               
                  }StartDevice;                                                                                             
                  struct                                                                // 4 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             UINT64       ProviderId;                                                                              
/*0x010*/             VOID*        DataPath;                                                                                
/*0x018*/             ULONG32      BufferSize;                                                                              
/*0x01C*/             UINT8        _PADDING1_[0x4];                                                                         
/*0x020*/             VOID*        Buffer;                                                                                  
                  }WMI;                                                                                                     
                  struct                                                                // 4 elements, 0x20 bytes (sizeof)  
                  {                                                                                                         
/*0x008*/             VOID*        Argument1;                                                                               
/*0x010*/             VOID*        Argument2;                                                                               
/*0x018*/             VOID*        Argument3;                                                                               
/*0x020*/             VOID*        Argument4;                                                                               
                  }Others;                                                                                                  
              }Parameters;                                                                                                  
/*0x028*/     struct _DEVICE_OBJECT* DeviceObject;                                                                          
/*0x030*/     struct _FILE_OBJECT* FileObject;                                                                              
/*0x038*/     FUNCT_005B_08DA_CompletionRoutine* CompletionRoutine;                                                         
/*0x040*/     VOID*        Context;                                                                                         
          }IO_STACK_LOCATION, *PIO_STACK_LOCATION;                                                                          
                                                                                                                            
          typedef struct _IO_STATUS_BLOCK // 3 elements, 0x10 bytes (sizeof) 
          {                                                                  
              union                       // 2 elements, 0x8 bytes (sizeof)  
              {                                                              
/*0x000*/         LONG32       Status;                                       
/*0x000*/         VOID*        Pointer;                                      
              };                                                             
/*0x008*/     UINT64       Information;                                      
          }IO_STATUS_BLOCK, *PIO_STATUS_BLOCK;                                   
                                                                             
          typedef struct _IO_STATUS_BLOCK32 // 2 elements, 0x8 bytes (sizeof) 
          {                                                                   
/*0x000*/     LONG32       Status;                                            
/*0x004*/     ULONG32      Information;                                       
          }IO_STATUS_BLOCK32, *PIO_STATUS_BLOCK32;                                  
                                                                              
typedef struct _IO_TIMER // 0 elements, 0x0 bytes (sizeof) 
{                                                          
}IO_TIMER, *PIO_TIMER;                                     
                                                           
          typedef struct _KAPC                                // 16 elements, 0x58 bytes (sizeof) 
          {                                                                                       
/*0x000*/     UINT8        Type;                                                                  
/*0x001*/     UINT8        SpareByte0;                                                            
/*0x002*/     UINT8        Size;                                                                  
/*0x003*/     UINT8        SpareByte1;                                                            
/*0x004*/     ULONG32      SpareLong0;                                                            
/*0x008*/     struct _KTHREAD* Thread;                                                            
/*0x010*/     struct _LIST_ENTRY ApcListEntry;                // 2 elements, 0x10 bytes (sizeof)  
/*0x020*/     FUNCT_00A3_08F0_KernelRoutine* KernelRoutine;                                       
/*0x028*/     FUNCT_00A3_08FE_RundownRoutine* RundownRoutine;                                     
/*0x030*/     FUNCT_00A3_08F9_NormalRoutine* NormalRoutine;                                       
/*0x038*/     VOID*        NormalContext;                                                         
/*0x040*/     VOID*        SystemArgument1;                                                       
/*0x048*/     VOID*        SystemArgument2;                                                       
/*0x050*/     CHAR         ApcStateIndex;                                                         
/*0x051*/     CHAR         ApcMode;                                                               
/*0x052*/     UINT8        Inserted;                                                              
/*0x053*/     UINT8        _PADDING0_[0x5];                                                       
          }KAPC, *PKAPC;                                                                          
                                                                                                  
          typedef struct _IRP                                              // 21 elements, 0xD0 bytes (sizeof) 
          {                                                                                                    
/*0x000*/     INT16        Type;                                                                               
/*0x002*/     UINT16       Size;                                                                               
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                    
/*0x008*/     struct _MDL* MdlAddress;                                                                         
/*0x010*/     ULONG32      Flags;                                                                              
/*0x014*/     UINT8        _PADDING1_[0x4];                                                                    
              union                                                        // 3 elements, 0x8 bytes (sizeof)   
              {                                                                                                
/*0x018*/         struct _IRP* MasterIrp;                                                                      
/*0x018*/         LONG32       IrpCount;                                                                       
/*0x018*/         VOID*        SystemBuffer;                                                                   
              }AssociatedIrp;                                                                                  
/*0x020*/     struct _LIST_ENTRY ThreadListEntry;                          // 2 elements, 0x10 bytes (sizeof)  
/*0x030*/     struct _IO_STATUS_BLOCK IoStatus;                            // 3 elements, 0x10 bytes (sizeof)  
/*0x040*/     CHAR         RequestorMode;                                                                      
/*0x041*/     UINT8        PendingReturned;                                                                    
/*0x042*/     CHAR         StackCount;                                                                         
/*0x043*/     CHAR         CurrentLocation;                                                                    
/*0x044*/     UINT8        Cancel;                                                                             
/*0x045*/     UINT8        CancelIrql;                                                                         
/*0x046*/     CHAR         ApcEnvironment;                                                                     
/*0x047*/     UINT8        AllocationFlags;                                                                    
/*0x048*/     struct _IO_STATUS_BLOCK* UserIosb;                                                               
/*0x050*/     struct _KEVENT* UserEvent;                                                                       
              union                                                        // 2 elements, 0x10 bytes (sizeof)  
              {                                                                                                
                  struct                                                   // 3 elements, 0x10 bytes (sizeof)  
                  {                                                                                            
                      union                                                // 2 elements, 0x8 bytes (sizeof)   
                      {                                                                                        
/*0x058*/                 FUNCT_00A3_04CA_UserApcRoutine* UserApcRoutine;                                      
/*0x058*/                 VOID*        IssuingProcess;                                                         
                      };                                                                                       
/*0x060*/             VOID*        UserApcContext;                                                             
                  }AsynchronousParameters;                                                                     
/*0x058*/         union _LARGE_INTEGER AllocationSize;                     // 4 elements, 0x8 bytes (sizeof)   
              }Overlay;                                                                                        
/*0x068*/     FUNCT_00A3_04CF_CancelRoutine_DriverStartIo* CancelRoutine;                                      
/*0x070*/     VOID*        UserBuffer;                                                                         
              union                                                        // 3 elements, 0x58 bytes (sizeof)  
              {                                                                                                
                  struct                                                   // 8 elements, 0x50 bytes (sizeof)  
                  {                                                                                            
                      union                                                // 2 elements, 0x20 bytes (sizeof)  
                      {                                                                                        
/*0x078*/                 struct _KDEVICE_QUEUE_ENTRY DeviceQueueEntry;    // 3 elements, 0x18 bytes (sizeof)  
/*0x078*/                 VOID*        DriverContext[4];                                                       
                      };                                                                                       
/*0x098*/             struct _ETHREAD* Thread;                                                                 
/*0x0A0*/             CHAR*        AuxiliaryBuffer;                                                            
/*0x0A8*/             struct _LIST_ENTRY ListEntry;                        // 2 elements, 0x10 bytes (sizeof)  
                      union                                                // 2 elements, 0x8 bytes (sizeof)   
                      {                                                                                        
/*0x0B8*/                 struct _IO_STACK_LOCATION* CurrentStackLocation;                                     
/*0x0B8*/                 ULONG32      PacketType;                                                             
                      };                                                                                       
/*0x0C0*/             struct _FILE_OBJECT* OriginalFileObject;                                                 
                  }Overlay;                                                                                    
/*0x078*/         struct _KAPC Apc;                                        // 16 elements, 0x58 bytes (sizeof) 
/*0x078*/         VOID*        CompletionKey;                                                                  
              }Tail;                                                                                           
          }IRP, *PIRP;                                                                                         
                                                                                                               
          typedef struct _KDESCRIPTOR // 3 elements, 0x10 bytes (sizeof) 
          {                                                              
/*0x000*/     UINT16       Pad[3];                                       
/*0x006*/     UINT16       Limit;                                        
/*0x008*/     VOID*        Base;                                         
          }KDESCRIPTOR, *PKDESCRIPTOR;                                   
                                                                         
          typedef struct _KFLOATING_SAVE // 1 elements, 0x4 bytes (sizeof) 
          {                                                                
/*0x000*/     ULONG32      Dummy;                                          
          }KFLOATING_SAVE, *PKFLOATING_SAVE;                                  
                                                                           
          typedef union _KGDTENTRY64                    // 7 elements, 0x10 bytes (sizeof) 
          {                                                                                
              struct                                    // 5 elements, 0x10 bytes (sizeof) 
              {                                                                            
/*0x000*/         UINT16       LimitLow;                                                   
/*0x002*/         UINT16       BaseLow;                                                    
                  union                                 // 2 elements, 0x4 bytes (sizeof)  
                  {                                                                        
                      struct                            // 4 elements, 0x4 bytes (sizeof)  
                      {                                                                    
/*0x004*/                 UINT8        BaseMiddle;                                         
/*0x005*/                 UINT8        Flags1;                                             
/*0x006*/                 UINT8        Flags2;                                             
/*0x007*/                 UINT8        BaseHigh;                                           
                      }Bytes;                                                              
                      struct                            // 10 elements, 0x4 bytes (sizeof) 
                      {                                                                    
/*0x004*/                 ULONG32      BaseMiddle : 8;  // 0 BitPosition                   
/*0x004*/                 ULONG32      Type : 5;        // 8 BitPosition                   
/*0x004*/                 ULONG32      Dpl : 2;         // 13 BitPosition                  
/*0x004*/                 ULONG32      Present : 1;     // 15 BitPosition                  
/*0x004*/                 ULONG32      LimitHigh : 4;   // 16 BitPosition                  
/*0x004*/                 ULONG32      System : 1;      // 20 BitPosition                  
/*0x004*/                 ULONG32      LongMode : 1;    // 21 BitPosition                  
/*0x004*/                 ULONG32      DefaultBig : 1;  // 22 BitPosition                  
/*0x004*/                 ULONG32      Granularity : 1; // 23 BitPosition                  
/*0x004*/                 ULONG32      BaseHigh : 8;    // 24 BitPosition                  
                      }Bits;                                                               
                  };                                                                       
/*0x008*/         ULONG32      BaseUpper;                                                  
/*0x00C*/         ULONG32      MustBeZero;                                                 
              };                                                                           
/*0x000*/     UINT64       Alignment;                                                      
          }KGDTENTRY64, *PKGDTENTRY64;                                                     
                                                                                           
          typedef union _KIDTENTRY64              // 11 elements, 0x10 bytes (sizeof) 
          {                                                                           
              struct                              // 6 elements, 0x10 bytes (sizeof)  
              {                                                                       
/*0x000*/         UINT16       OffsetLow;                                             
/*0x002*/         UINT16       Selector;                                              
                  struct                          // 5 elements, 0x2 bytes (sizeof)   
                  {                                                                   
/*0x004*/             UINT16       IstIndex : 3;  // 0 BitPosition                    
/*0x004*/             UINT16       Reserved0 : 5; // 3 BitPosition                    
/*0x004*/             UINT16       Type : 5;      // 8 BitPosition                    
/*0x004*/             UINT16       Dpl : 2;       // 13 BitPosition                   
/*0x004*/             UINT16       Present : 1;   // 15 BitPosition                   
                  };                                                                  
/*0x006*/         UINT16       OffsetMiddle;                                          
/*0x008*/         ULONG32      OffsetHigh;                                            
/*0x00C*/         ULONG32      Reserved1;                                             
              };                                                                      
/*0x000*/     UINT64       Alignment;                                                 
          }KIDTENTRY64, *PKIDTENTRY64;                                                
                                                                                      
          typedef struct _KLIST_ENTRY     // 2 elements, 0x10 bytes (sizeof) 
          {                                                                  
/*0x000*/     struct _KLIST_ENTRY* Flink;                                    
/*0x008*/     struct _KLIST_ENTRY* Blink;                                    
          }KLIST_ENTRY, *PKLIST_ENTRY;                                       
                                                                             
          typedef struct _NT_TIB                                    // 8 elements, 0x38 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _EXCEPTION_REGISTRATION_RECORD* ExceptionList;                                    
/*0x008*/     VOID*        StackBase;                                                                  
/*0x010*/     VOID*        StackLimit;                                                                 
/*0x018*/     VOID*        SubSystemTib;                                                               
              union                                                 // 2 elements, 0x8 bytes (sizeof)  
              {                                                                                        
/*0x020*/         VOID*        FiberData;                                                              
/*0x020*/         ULONG32      Version;                                                                
              };                                                                                       
/*0x028*/     VOID*        ArbitraryUserPointer;                                                       
/*0x030*/     struct _NT_TIB* Self;                                                                    
          }NT_TIB, *PNT_TIB;                                                                           
                                                                                                       
          typedef struct _KSPECIAL_REGISTERS     // 27 elements, 0xD8 bytes (sizeof) 
          {                                                                          
/*0x000*/     UINT64       Cr0;                                                      
/*0x008*/     UINT64       Cr2;                                                      
/*0x010*/     UINT64       Cr3;                                                      
/*0x018*/     UINT64       Cr4;                                                      
