// #################################################################################
// Generated by Symbol Type Viewer 32Bit/64Bit - Version 1.0.0.6 beta
// http://www.syseclabs.com
// Coding by Lionel d'Hauenens
// #################################################################################
// Image         : 64bit
// ImageName     : E:\temp\symbol\file\ntdll.dll
// LoadedPdbName : E:\temp\symbol\pdb\ntdll.pdb\2055091C8F2C5808D8DFE02C75D129591\ntdll.pdb

#ifdef __cplusplus
extern "C" {
#endif

//////////////////
//   C Define   //
//////////////////

#define VOID void
#define STDCALL __stdcall
#define FASTCALL __fastcall
#define CDECL __cdecl
#define THISCALL __thiscall
#define NEAR 
#define FAR 
//---------------------------------------------------------------------

//////////////////
// C Basic Type //
//////////////////

typedef signed char INT8;
typedef signed char CHAR;
typedef signed short INT16;
typedef signed int INT32;
typedef signed int BOOL;
typedef signed __int64 INT64;
typedef signed __int64 LONG64;
typedef signed long LONG32;
typedef unsigned char UINT8;
typedef unsigned char BYTE;
typedef unsigned short UINT16;
typedef unsigned short WCHAR;
typedef unsigned int UINT32;
typedef unsigned __int64 UINT64;
typedef unsigned __int64 ULONG64;
typedef unsigned long ULONG32;
typedef float FLOAT32;
typedef double FLOAT64;
typedef struct {unsigned short W[5];} FLOAT80;
typedef struct { __int64 LowPart;__int64 HighPart;} FLOAT128;
typedef double DATE;
typedef signed long HRESULT;
typedef union { struct {unsigned long Lo; long Hi;}; __int64 int64;} CURRENCY;
typedef wchar_t OLECHAR;
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Enum types

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE  // 3 elements, 0x4 bytes
{
    StandardDesign  = 0 /*0x0*/,
    NEC98x86        = 1 /*0x1*/,
    EndAlternatives = 2 /*0x2*/
}ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef enum _BUS_QUERY_ID_TYPE  // 6 elements, 0x4 bytes
{
    BusQueryDeviceID           = 0 /*0x0*/,
    BusQueryHardwareIDs        = 1 /*0x1*/,
    BusQueryCompatibleIDs      = 2 /*0x2*/,
    BusQueryInstanceID         = 3 /*0x3*/,
    BusQueryDeviceSerialNumber = 4 /*0x4*/,
    BusQueryContainerID        = 5 /*0x5*/
}BUS_QUERY_ID_TYPE, *PBUS_QUERY_ID_TYPE;

typedef enum _DEVICE_POWER_STATE  // 6 elements, 0x4 bytes
{
    PowerDeviceUnspecified = 0 /*0x0*/,
    PowerDeviceD0          = 1 /*0x1*/,
    PowerDeviceD1          = 2 /*0x2*/,
    PowerDeviceD2          = 3 /*0x3*/,
    PowerDeviceD3          = 4 /*0x4*/,
    PowerDeviceMaximum     = 5 /*0x5*/
}DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_RELATION_TYPE  // 7 elements, 0x4 bytes
{
    BusRelations         = 0 /*0x0*/,
    EjectionRelations    = 1 /*0x1*/,
    PowerRelations       = 2 /*0x2*/,
    RemovalRelations     = 3 /*0x3*/,
    TargetDeviceRelation = 4 /*0x4*/,
    SingleBusRelations   = 5 /*0x5*/,
    TransportRelations   = 6 /*0x6*/
}DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _DEVICE_TEXT_TYPE  // 2 elements, 0x4 bytes
{
    DeviceTextDescription         = 0 /*0x0*/,
    DeviceTextLocationInformation = 1 /*0x1*/
}DEVICE_TEXT_TYPE, *PDEVICE_TEXT_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE  // 6 elements, 0x4 bytes
{
    DeviceUsageTypeUndefined   = 0 /*0x0*/,
    DeviceUsageTypePaging      = 1 /*0x1*/,
    DeviceUsageTypeHibernation = 2 /*0x2*/,
    DeviceUsageTypeDumpFile    = 3 /*0x3*/,
    DeviceUsageTypeBoot        = 4 /*0x4*/,
    DeviceUsageTypePostDisplay = 5 /*0x5*/
}DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum _DEVICE_WAKE_DEPTH  // 7 elements, 0x4 bytes
{
    DeviceWakeDepthNotWakeable = 0 /*0x0*/,
    DeviceWakeDepthD0          = 1 /*0x1*/,
    DeviceWakeDepthD1          = 2 /*0x2*/,
    DeviceWakeDepthD2          = 3 /*0x3*/,
    DeviceWakeDepthD3hot       = 4 /*0x4*/,
    DeviceWakeDepthD3cold      = 5 /*0x5*/,
    DeviceWakeDepthMaximum     = 6 /*0x6*/
}DEVICE_WAKE_DEPTH, *PDEVICE_WAKE_DEPTH;

typedef enum _DIRECTORY_NOTIFY_INFORMATION_CLASS  // 2 elements, 0x4 bytes
{
    DirectoryNotifyInformation         = 1 /*0x1*/,
    DirectoryNotifyExtendedInformation = 2 /*0x2*/
}DIRECTORY_NOTIFY_INFORMATION_CLASS, *PDIRECTORY_NOTIFY_INFORMATION_CLASS;

typedef enum _DISPLAYCONFIG_SCANLINE_ORDERING  // 6 elements, 0x4 bytes
{
    DISPLAYCONFIG_SCANLINE_ORDERING_UNSPECIFIED                = 0 /*0x0*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_PROGRESSIVE                = 1 /*0x1*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED                 = 2 /*0x2*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_UPPERFIELDFIRST = 2 /*0x2*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_LOWERFIELDFIRST = 3 /*0x3*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_FORCE_UINT32               = -1 /*0xFF*/
}DISPLAYCONFIG_SCANLINE_ORDERING, *PDISPLAYCONFIG_SCANLINE_ORDERING;

typedef enum _EVENT_TYPE  // 2 elements, 0x4 bytes
{
    NotificationEvent    = 0 /*0x0*/,
    SynchronizationEvent = 1 /*0x1*/
}EVENT_TYPE, *PEVENT_TYPE;

typedef enum _EX_GEN_RANDOM_DOMAIN  // 4 elements, 0x4 bytes
{
    ExGenRandomDomainKernel      = 0 /*0x0*/,
    ExGenRandomDomainFirst       = 0 /*0x0*/,
    ExGenRandomDomainUserVisible = 1 /*0x1*/,
    ExGenRandomDomainMax         = 2 /*0x2*/
}EX_GEN_RANDOM_DOMAIN, *PEX_GEN_RANDOM_DOMAIN;

typedef enum _EXCEPTION_DISPOSITION  // 4 elements, 0x4 bytes
{
    ExceptionContinueExecution = 0 /*0x0*/,
    ExceptionContinueSearch    = 1 /*0x1*/,
    ExceptionNestedException   = 2 /*0x2*/,
    ExceptionCollidedUnwind    = 3 /*0x3*/
}EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _EXQUEUEINDEX  // 3 elements, 0x4 bytes
{
    ExPoolUntrusted = 0 /*0x0*/,
    IoPoolUntrusted = 1 /*0x1*/,
    ExPoolMax       = 8 /*0x8*/
}EXQUEUEINDEX, *PEXQUEUEINDEX;

typedef enum _FILE_INFORMATION_CLASS  // 76 elements, 0x4 bytes
{
    FileDirectoryInformation                     = 1 /*0x1*/,
    FileFullDirectoryInformation                 = 2 /*0x2*/,
    FileBothDirectoryInformation                 = 3 /*0x3*/,
    FileBasicInformation                         = 4 /*0x4*/,
    FileStandardInformation                      = 5 /*0x5*/,
    FileInternalInformation                      = 6 /*0x6*/,
    FileEaInformation                            = 7 /*0x7*/,
    FileAccessInformation                        = 8 /*0x8*/,
    FileNameInformation                          = 9 /*0x9*/,
    FileRenameInformation                        = 10 /*0xA*/,
    FileLinkInformation                          = 11 /*0xB*/,
    FileNamesInformation                         = 12 /*0xC*/,
    FileDispositionInformation                   = 13 /*0xD*/,
    FilePositionInformation                      = 14 /*0xE*/,
    FileFullEaInformation                        = 15 /*0xF*/,
    FileModeInformation                          = 16 /*0x10*/,
    FileAlignmentInformation                     = 17 /*0x11*/,
    FileAllInformation                           = 18 /*0x12*/,
    FileAllocationInformation                    = 19 /*0x13*/,
    FileEndOfFileInformation                     = 20 /*0x14*/,
    FileAlternateNameInformation                 = 21 /*0x15*/,
    FileStreamInformation                        = 22 /*0x16*/,
    FilePipeInformation                          = 23 /*0x17*/,
    FilePipeLocalInformation                     = 24 /*0x18*/,
    FilePipeRemoteInformation                    = 25 /*0x19*/,
    FileMailslotQueryInformation                 = 26 /*0x1A*/,
    FileMailslotSetInformation                   = 27 /*0x1B*/,
    FileCompressionInformation                   = 28 /*0x1C*/,
    FileObjectIdInformation                      = 29 /*0x1D*/,
    FileCompletionInformation                    = 30 /*0x1E*/,
    FileMoveClusterInformation                   = 31 /*0x1F*/,
    FileQuotaInformation                         = 32 /*0x20*/,
    FileReparsePointInformation                  = 33 /*0x21*/,
    FileNetworkOpenInformation                   = 34 /*0x22*/,
    FileAttributeTagInformation                  = 35 /*0x23*/,
    FileTrackingInformation                      = 36 /*0x24*/,
    FileIdBothDirectoryInformation               = 37 /*0x25*/,
    FileIdFullDirectoryInformation               = 38 /*0x26*/,
    FileValidDataLengthInformation               = 39 /*0x27*/,
    FileShortNameInformation                     = 40 /*0x28*/,
    FileIoCompletionNotificationInformation      = 41 /*0x29*/,
    FileIoStatusBlockRangeInformation            = 42 /*0x2A*/,
    FileIoPriorityHintInformation                = 43 /*0x2B*/,
    FileSfioReserveInformation                   = 44 /*0x2C*/,
    FileSfioVolumeInformation                    = 45 /*0x2D*/,
    FileHardLinkInformation                      = 46 /*0x2E*/,
    FileProcessIdsUsingFileInformation           = 47 /*0x2F*/,
    FileNormalizedNameInformation                = 48 /*0x30*/,
    FileNetworkPhysicalNameInformation           = 49 /*0x31*/,
    FileIdGlobalTxDirectoryInformation           = 50 /*0x32*/,
    FileIsRemoteDeviceInformation                = 51 /*0x33*/,
    FileUnusedInformation                        = 52 /*0x34*/,
    FileNumaNodeInformation                      = 53 /*0x35*/,
    FileStandardLinkInformation                  = 54 /*0x36*/,
    FileRemoteProtocolInformation                = 55 /*0x37*/,
    FileRenameInformationBypassAccessCheck       = 56 /*0x38*/,
    FileLinkInformationBypassAccessCheck         = 57 /*0x39*/,
    FileVolumeNameInformation                    = 58 /*0x3A*/,
    FileIdInformation                            = 59 /*0x3B*/,
    FileIdExtdDirectoryInformation               = 60 /*0x3C*/,
    FileReplaceCompletionInformation             = 61 /*0x3D*/,
    FileHardLinkFullIdInformation                = 62 /*0x3E*/,
    FileIdExtdBothDirectoryInformation           = 63 /*0x3F*/,
    FileDispositionInformationEx                 = 64 /*0x40*/,
    FileRenameInformationEx                      = 65 /*0x41*/,
    FileRenameInformationExBypassAccessCheck     = 66 /*0x42*/,
    FileDesiredStorageClassInformation           = 67 /*0x43*/,
    FileStatInformation                          = 68 /*0x44*/,
    FileMemoryPartitionInformation               = 69 /*0x45*/,
    FileStatLxInformation                        = 70 /*0x46*/,
    FileCaseSensitiveInformation                 = 71 /*0x47*/,
    FileLinkInformationEx                        = 72 /*0x48*/,
    FileLinkInformationExBypassAccessCheck       = 73 /*0x49*/,
    FileStorageReserveIdInformation              = 74 /*0x4A*/,
    FileCaseSensitiveInformationForceAccessCheck = 75 /*0x4B*/,
    FileMaximumInformation                       = 76 /*0x4C*/
}FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FS_FILTER_SECTION_SYNC_TYPE  // 2 elements, 0x4 bytes
{
    SyncTypeOther         = 0 /*0x0*/,
    SyncTypeCreateSection = 1 /*0x1*/
}FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

typedef enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE  // 2 elements, 0x4 bytes
{
    NotifyTypeCreate  = 0 /*0x0*/,
    NotifyTypeRetired = 1 /*0x1*/
}FS_FILTER_STREAM_FO_NOTIFICATION_TYPE, *PFS_FILTER_STREAM_FO_NOTIFICATION_TYPE;

typedef enum _FSINFOCLASS  // 15 elements, 0x4 bytes
{
    FileFsVolumeInformation       = 1 /*0x1*/,
    FileFsLabelInformation        = 2 /*0x2*/,
    FileFsSizeInformation         = 3 /*0x3*/,
    FileFsDeviceInformation       = 4 /*0x4*/,
    FileFsAttributeInformation    = 5 /*0x5*/,
    FileFsControlInformation      = 6 /*0x6*/,
    FileFsFullSizeInformation     = 7 /*0x7*/,
    FileFsObjectIdInformation     = 8 /*0x8*/,
    FileFsDriverPathInformation   = 9 /*0x9*/,
    FileFsVolumeFlagsInformation  = 10 /*0xA*/,
    FileFsSectorSizeInformation   = 11 /*0xB*/,
    FileFsDataCopyInformation     = 12 /*0xC*/,
    FileFsMetadataSizeInformation = 13 /*0xD*/,
    FileFsFullSizeInformationEx   = 14 /*0xE*/,
    FileFsMaximumInformation      = 15 /*0xF*/
}FSINFOCLASS, *PFSINFOCLASS;

typedef enum _FUNCTION_TABLE_TYPE  // 4 elements, 0x4 bytes
{
    RF_SORTED         = 0 /*0x0*/,
    RF_UNSORTED       = 1 /*0x1*/,
    RF_CALLBACK       = 2 /*0x2*/,
    RF_KERNEL_DYNAMIC = 3 /*0x3*/
}FUNCTION_TABLE_TYPE, *PFUNCTION_TABLE_TYPE;

typedef enum _HARDWARE_COUNTER_TYPE  // 2 elements, 0x4 bytes
{
    PMCCounter             = 0 /*0x0*/,
    MaxHardwareCounterType = 1 /*0x1*/
}HARDWARE_COUNTER_TYPE, *PHARDWARE_COUNTER_TYPE;

typedef enum _HEAP_FAILURE_TYPE  // 22 elements, 0x4 bytes
{
    heap_failure_internal                      = 0 /*0x0*/,
    heap_failure_unknown                       = 1 /*0x1*/,
    heap_failure_generic                       = 2 /*0x2*/,
    heap_failure_entry_corruption              = 3 /*0x3*/,
    heap_failure_multiple_entries_corruption   = 4 /*0x4*/,
    heap_failure_virtual_block_corruption      = 5 /*0x5*/,
    heap_failure_buffer_overrun                = 6 /*0x6*/,
    heap_failure_buffer_underrun               = 7 /*0x7*/,
    heap_failure_block_not_busy                = 8 /*0x8*/,
    heap_failure_invalid_argument              = 9 /*0x9*/,
    heap_failure_invalid_allocation_type       = 10 /*0xA*/,
    heap_failure_usage_after_free              = 11 /*0xB*/,
    heap_failure_cross_heap_operation          = 12 /*0xC*/,
    heap_failure_freelists_corruption          = 13 /*0xD*/,
    heap_failure_listentry_corruption          = 14 /*0xE*/,
    heap_failure_lfh_bitmap_mismatch           = 15 /*0xF*/,
    heap_failure_segment_lfh_bitmap_corruption = 16 /*0x10*/,
    heap_failure_segment_lfh_double_free       = 17 /*0x11*/,
    heap_failure_vs_subsegment_corruption      = 18 /*0x12*/,
    heap_failure_null_heap                     = 19 /*0x13*/,
    heap_failure_allocation_limit              = 20 /*0x14*/,
    heap_failure_commit_limit                  = 21 /*0x15*/
}HEAP_FAILURE_TYPE, *PHEAP_FAILURE_TYPE;

typedef enum _HEAP_LFH_LOCKMODE  // 3 elements, 0x4 bytes
{
    HeapLockNotHeld   = 0 /*0x0*/,
    HeapLockShared    = 1 /*0x1*/,
    HeapLockExclusive = 2 /*0x2*/
}HEAP_LFH_LOCKMODE, *PHEAP_LFH_LOCKMODE;

typedef enum _HEAP_SEG_RANGE_TYPE  // 5 elements, 0x4 bytes
{
    HeapSegRangeUser     = 0 /*0x0*/,
    HeapSegRangeInternal = 1 /*0x1*/,
    HeapSegRangeLFH      = 2 /*0x2*/,
    HeapSegRangeVS       = 3 /*0x3*/,
    HeapSegRangeTypeMax  = 3 /*0x3*/
}HEAP_SEG_RANGE_TYPE, *PHEAP_SEG_RANGE_TYPE;

typedef enum _HEAP_SEGMGR_LARGE_PAGE_POLICY  // 7 elements, 0x4 bytes
{
    HeapSegMgrNoLargePages       = 0 /*0x0*/,
    HeapSegMgrEnableLargePages   = 1 /*0x1*/,
    HeapSegMgrNormalPolicy       = 1 /*0x1*/,
    HeapSegMgrForceSmall         = 2 /*0x2*/,
    HeapSegMgrForceLarge         = 3 /*0x3*/,
    HeapSegMgrForceRandom        = 4 /*0x4*/,
    HeapSegMgrLargePagePolicyMax = 5 /*0x5*/
}HEAP_SEGMGR_LARGE_PAGE_POLICY, *PHEAP_SEGMGR_LARGE_PAGE_POLICY;

typedef enum _INTERFACE_TYPE  // 20 elements, 0x4 bytes
{
    InterfaceTypeUndefined = -1 /*0xFF*/,
    Internal               = 0 /*0x0*/,
    Isa                    = 1 /*0x1*/,
    Eisa                   = 2 /*0x2*/,
    MicroChannel           = 3 /*0x3*/,
    TurboChannel           = 4 /*0x4*/,
    PCIBus                 = 5 /*0x5*/,
    VMEBus                 = 6 /*0x6*/,
    NuBus                  = 7 /*0x7*/,
    PCMCIABus              = 8 /*0x8*/,
    CBus                   = 9 /*0x9*/,
    MPIBus                 = 10 /*0xA*/,
    MPSABus                = 11 /*0xB*/,
    ProcessorInternal      = 12 /*0xC*/,
    InternalPowerBus       = 13 /*0xD*/,
    PNPISABus              = 14 /*0xE*/,
    PNPBus                 = 15 /*0xF*/,
    Vmcs                   = 16 /*0x10*/,
    ACPIBus                = 17 /*0x11*/,
    MaximumInterfaceType   = 18 /*0x12*/
}INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _INTERLOCKED_RESULT  // 3 elements, 0x4 bytes
{
    ResultNegative = 1 /*0x1*/,
    ResultZero     = 0 /*0x0*/,
    ResultPositive = 2 /*0x2*/
}INTERLOCKED_RESULT, *PINTERLOCKED_RESULT;

typedef enum _INVPCID_TYPE  // 4 elements, 0x4 bytes
{
    InvpcidIndividualAddress    = 0 /*0x0*/,
    InvpcidSingleContext        = 1 /*0x1*/,
    InvpcidAllContextAndGlobals = 2 /*0x2*/,
    InvpcidAllContext           = 3 /*0x3*/
}INVPCID_TYPE, *PINVPCID_TYPE;

typedef enum _IO_ALLOCATION_ACTION  // 3 elements, 0x4 bytes
{
    KeepObject                    = 1 /*0x1*/,
    DeallocateObject              = 2 /*0x2*/,
    DeallocateObjectKeepRegisters = 3 /*0x3*/
}IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _IO_PRIORITY_HINT  // 6 elements, 0x4 bytes
{
    IoPriorityVeryLow  = 0 /*0x0*/,
    IoPriorityLow      = 1 /*0x1*/,
    IoPriorityNormal   = 2 /*0x2*/,
    IoPriorityHigh     = 3 /*0x3*/,
    IoPriorityCritical = 4 /*0x4*/,
    MaxIoPriorityTypes = 5 /*0x5*/
}IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

typedef enum _IO_RATE_CONTROL_TYPE  // 26 elements, 0x4 bytes
{
    IoRateControlTypeCapMin                         = 0 /*0x0*/,
    IoRateControlTypeIopsCap                        = 0 /*0x0*/,
    IoRateControlTypeBandwidthCap                   = 1 /*0x1*/,
    IoRateControlTypeTimePercentCap                 = 2 /*0x2*/,
    IoRateControlTypeCapMax                         = 2 /*0x2*/,
    IoRateControlTypeReservationMin                 = 3 /*0x3*/,
    IoRateControlTypeIopsReservation                = 3 /*0x3*/,
    IoRateControlTypeBandwidthReservation           = 4 /*0x4*/,
    IoRateControlTypeTimePercentReservation         = 5 /*0x5*/,
    IoRateControlTypeReservationMax                 = 5 /*0x5*/,
    IoRateControlTypeCriticalReservationMin         = 6 /*0x6*/,
    IoRateControlTypeIopsCriticalReservation        = 6 /*0x6*/,
    IoRateControlTypeBandwidthCriticalReservation   = 7 /*0x7*/,
    IoRateControlTypeTimePercentCriticalReservation = 8 /*0x8*/,
    IoRateControlTypeCriticalReservationMax         = 8 /*0x8*/,
    IoRateControlTypeSoftCapMin                     = 9 /*0x9*/,
    IoRateControlTypeIopsSoftCap                    = 9 /*0x9*/,
    IoRateControlTypeBandwidthSoftCap               = 10 /*0xA*/,
    IoRateControlTypeTimePercentSoftCap             = 11 /*0xB*/,
    IoRateControlTypeSoftCapMax                     = 11 /*0xB*/,
    IoRateControlTypeLimitExcessNotifyMin           = 12 /*0xC*/,
    IoRateControlTypeIopsLimitExcessNotify          = 12 /*0xC*/,
    IoRateControlTypeBandwidthLimitExcessNotify     = 13 /*0xD*/,
    IoRateControlTypeTimePercentLimitExcessNotify   = 14 /*0xE*/,
    IoRateControlTypeLimitExcessNotifyMax           = 14 /*0xE*/,
    IoRateControlTypeMax                            = 15 /*0xF*/
}IO_RATE_CONTROL_TYPE, *PIO_RATE_CONTROL_TYPE;

typedef enum _IRQ_PRIORITY  // 4 elements, 0x4 bytes
{
    IrqPriorityUndefined = 0 /*0x0*/,
    IrqPriorityLow       = 1 /*0x1*/,
    IrqPriorityNormal    = 2 /*0x2*/,
    IrqPriorityHigh      = 3 /*0x3*/
}IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef enum _JOB_OBJECT_IO_RATE_CONTROL_FLAGS  // 5 elements, 0x4 bytes
{
    JOB_OBJECT_IO_RATE_CONTROL_ENABLE                        = 1 /*0x1*/,
    JOB_OBJECT_IO_RATE_CONTROL_STANDALONE_VOLUME             = 2 /*0x2*/,
    JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ALL         = 4 /*0x4*/,
    JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ON_SOFT_CAP = 8 /*0x8*/,
    JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS                   = 15 /*0xF*/
}JOB_OBJECT_IO_RATE_CONTROL_FLAGS, *PJOB_OBJECT_IO_RATE_CONTROL_FLAGS;

typedef enum _JOB_OBJECT_NET_RATE_CONTROL_FLAGS  // 4 elements, 0x4 bytes
{
    JOB_OBJECT_NET_RATE_CONTROL_ENABLE        = 1 /*0x1*/,
    JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2 /*0x2*/,
    JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG      = 4 /*0x4*/,
    JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS   = 7 /*0x7*/
}JOB_OBJECT_NET_RATE_CONTROL_FLAGS, *PJOB_OBJECT_NET_RATE_CONTROL_FLAGS;

typedef enum _JOBOBJECTINFOCLASS  // 73 elements, 0x4 bytes
{
    JobObjectBasicAccountingInformation         = 1 /*0x1*/,
    JobObjectBasicLimitInformation              = 2 /*0x2*/,
    JobObjectBasicProcessIdList                 = 3 /*0x3*/,
    JobObjectBasicUIRestrictions                = 4 /*0x4*/,
    JobObjectSecurityLimitInformation           = 5 /*0x5*/,
    JobObjectEndOfJobTimeInformation            = 6 /*0x6*/,
    JobObjectAssociateCompletionPortInformation = 7 /*0x7*/,
    JobObjectBasicAndIoAccountingInformation    = 8 /*0x8*/,
    JobObjectExtendedLimitInformation           = 9 /*0x9*/,
    JobObjectJobSetInformation                  = 10 /*0xA*/,
    JobObjectGroupInformation                   = 11 /*0xB*/,
    JobObjectNotificationLimitInformation       = 12 /*0xC*/,
    JobObjectLimitViolationInformation          = 13 /*0xD*/,
    JobObjectGroupInformationEx                 = 14 /*0xE*/,
    JobObjectCpuRateControlInformation          = 15 /*0xF*/,
    JobObjectCompletionFilter                   = 16 /*0x10*/,
    JobObjectCompletionCounter                  = 17 /*0x11*/,
    JobObjectFreezeInformation                  = 18 /*0x12*/,
    JobObjectExtendedAccountingInformation      = 19 /*0x13*/,
    JobObjectWakeInformation                    = 20 /*0x14*/,
    JobObjectBackgroundInformation              = 21 /*0x15*/,
    JobObjectSchedulingRankBiasInformation      = 22 /*0x16*/,
    JobObjectTimerVirtualizationInformation     = 23 /*0x17*/,
    JobObjectCycleTimeNotification              = 24 /*0x18*/,
    JobObjectClearEvent                         = 25 /*0x19*/,
    JobObjectInterferenceInformation            = 26 /*0x1A*/,
    JobObjectClearPeakJobMemoryUsed             = 27 /*0x1B*/,
    JobObjectMemoryUsageInformation             = 28 /*0x1C*/,
    JobObjectSharedCommit                       = 29 /*0x1D*/,
    JobObjectContainerId                        = 30 /*0x1E*/,
    JobObjectIoRateControlInformation           = 31 /*0x1F*/,
    JobObjectSiloRootDirectory                  = 37 /*0x25*/,
    JobObjectServerSiloBasicInformation         = 38 /*0x26*/,
    JobObjectServerSiloUserSharedData           = 39 /*0x27*/,
    JobObjectServerSiloInitialize               = 40 /*0x28*/,
    JobObjectServerSiloRunningState             = 41 /*0x29*/,
    JobObjectIoAttribution                      = 42 /*0x2A*/,
    JobObjectMemoryPartitionInformation         = 43 /*0x2B*/,
    JobObjectContainerTelemetryId               = 44 /*0x2C*/,
    JobObjectSiloSystemRoot                     = 45 /*0x2D*/,
    JobObjectEnergyTrackingState                = 46 /*0x2E*/,
    JobObjectThreadImpersonationInformation     = 47 /*0x2F*/,
    JobObjectReserved1Information               = 18 /*0x12*/,
    JobObjectReserved2Information               = 19 /*0x13*/,
    JobObjectReserved3Information               = 20 /*0x14*/,
    JobObjectReserved4Information               = 21 /*0x15*/,
    JobObjectReserved5Information               = 22 /*0x16*/,
    JobObjectReserved6Information               = 23 /*0x17*/,
    JobObjectReserved7Information               = 24 /*0x18*/,
    JobObjectReserved8Information               = 25 /*0x19*/,
    JobObjectReserved9Information               = 26 /*0x1A*/,
    JobObjectReserved10Information              = 27 /*0x1B*/,
    JobObjectReserved11Information              = 28 /*0x1C*/,
    JobObjectReserved12Information              = 29 /*0x1D*/,
    JobObjectReserved13Information              = 30 /*0x1E*/,
    JobObjectReserved14Information              = 31 /*0x1F*/,
    JobObjectNetRateControlInformation          = 32 /*0x20*/,
    JobObjectNotificationLimitInformation2      = 33 /*0x21*/,
    JobObjectLimitViolationInformation2         = 34 /*0x22*/,
    JobObjectCreateSilo                         = 35 /*0x23*/,
    JobObjectSiloBasicInformation               = 36 /*0x24*/,
    JobObjectReserved15Information              = 37 /*0x25*/,
    JobObjectReserved16Information              = 38 /*0x26*/,
    JobObjectReserved17Information              = 39 /*0x27*/,
    JobObjectReserved18Information              = 40 /*0x28*/,
    JobObjectReserved19Information              = 41 /*0x29*/,
    JobObjectReserved20Information              = 42 /*0x2A*/,
    JobObjectReserved21Information              = 43 /*0x2B*/,
    JobObjectReserved22Information              = 44 /*0x2C*/,
    JobObjectReserved23Information              = 45 /*0x2D*/,
    JobObjectReserved24Information              = 46 /*0x2E*/,
    JobObjectReserved25Information              = 47 /*0x2F*/,
    MaxJobObjectInfoClass                       = 48 /*0x30*/
}JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

typedef enum _KE_WAKE_SOURCE_TYPE  // 9 elements, 0x4 bytes
{
    KeWakeSourceTypeSpuriousWake      = 0 /*0x0*/,
    KeWakeSourceTypeSpuriousClock     = 1 /*0x1*/,
    KeWakeSourceTypeSpuriousInterrupt = 2 /*0x2*/,
    KeWakeSourceTypeQueryFailure      = 3 /*0x3*/,
    KeWakeSourceTypeAccountingFailure = 4 /*0x4*/,
    KeWakeSourceTypeStaticSourceMax   = 4 /*0x4*/,
    KeWakeSourceTypeInterrupt         = 5 /*0x5*/,
    KeWakeSourceTypeIRTimer           = 6 /*0x6*/,
    KeWakeSourceTypeMax               = 7 /*0x7*/
}KE_WAKE_SOURCE_TYPE, *PKE_WAKE_SOURCE_TYPE;

typedef enum _KHETERO_CPU_POLICY  // 11 elements, 0x4 bytes
{
    KHeteroCpuPolicyAll         = 0 /*0x0*/,
    KHeteroCpuPolicyLarge       = 1 /*0x1*/,
    KHeteroCpuPolicyLargeOrIdle = 2 /*0x2*/,
    KHeteroCpuPolicySmall       = 3 /*0x3*/,
    KHeteroCpuPolicySmallOrIdle = 4 /*0x4*/,
    KHeteroCpuPolicyDynamic     = 5 /*0x5*/,
    KHeteroCpuPolicyStaticMax   = 5 /*0x5*/,
    KHeteroCpuPolicyBiasedSmall = 6 /*0x6*/,
    KHeteroCpuPolicyBiasedLarge = 7 /*0x7*/,
    KHeteroCpuPolicyDefault     = 8 /*0x8*/,
    KHeteroCpuPolicyMax         = 9 /*0x9*/
}KHETERO_CPU_POLICY, *PKHETERO_CPU_POLICY;

typedef enum _KHETERO_CPU_QOS  // 7 elements, 0x4 bytes
{
    KHeteroCpuQosDefault    = 0 /*0x0*/,
    KHeteroCpuQosHigh       = 0 /*0x0*/,
    KHeteroCpuQosMedium     = 1 /*0x1*/,
    KHeteroCpuQosLow        = 2 /*0x2*/,
    KHeteroCpuQosMultimedia = 3 /*0x3*/,
    KHeteroCpuQosDynamic    = 4 /*0x4*/,
    KHeteroCpuQosMax        = 4 /*0x4*/
}KHETERO_CPU_QOS, *PKHETERO_CPU_QOS;

typedef enum _KHETERO_RUNNING_TYPE  // 3 elements, 0x4 bytes
{
    KHeteroShortRunning   = 0 /*0x0*/,
    KHeteroLongRunning    = 1 /*0x1*/,
    KHeteroRunningTypeMax = 2 /*0x2*/
}KHETERO_RUNNING_TYPE, *PKHETERO_RUNNING_TYPE;

typedef enum _KINTERRUPT_POLARITY  // 8 elements, 0x4 bytes
{
    InterruptPolarityUnknown       = 0 /*0x0*/,
    InterruptActiveHigh            = 1 /*0x1*/,
    InterruptRisingEdge            = 1 /*0x1*/,
    InterruptActiveLow             = 2 /*0x2*/,
    InterruptFallingEdge           = 2 /*0x2*/,
    InterruptActiveBoth            = 3 /*0x3*/,
    InterruptActiveBothTriggerLow  = 3 /*0x3*/,
    InterruptActiveBothTriggerHigh = 4 /*0x4*/
}KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

typedef enum _KOBJECTS  // 28 elements, 0x4 bytes
{
    EventNotificationObject     = 0 /*0x0*/,
    EventSynchronizationObject  = 1 /*0x1*/,
    MutantObject                = 2 /*0x2*/,
    ProcessObject               = 3 /*0x3*/,
    QueueObject                 = 4 /*0x4*/,
    SemaphoreObject             = 5 /*0x5*/,
    ThreadObject                = 6 /*0x6*/,
    GateObject                  = 7 /*0x7*/,
    TimerNotificationObject     = 8 /*0x8*/,
    TimerSynchronizationObject  = 9 /*0x9*/,
    Spare2Object                = 10 /*0xA*/,
    Spare3Object                = 11 /*0xB*/,
    Spare4Object                = 12 /*0xC*/,
    Spare5Object                = 13 /*0xD*/,
    Spare6Object                = 14 /*0xE*/,
    Spare7Object                = 15 /*0xF*/,
    Spare8Object                = 16 /*0x10*/,
    ProfileCallbackObject       = 17 /*0x11*/,
    ApcObject                   = 18 /*0x12*/,
    DpcObject                   = 19 /*0x13*/,
    DeviceQueueObject           = 20 /*0x14*/,
    PriQueueObject              = 21 /*0x15*/,
    InterruptObject             = 22 /*0x16*/,
    ProfileObject               = 23 /*0x17*/,
    Timer2NotificationObject    = 24 /*0x18*/,
    Timer2SynchronizationObject = 25 /*0x19*/,
    ThreadedDpcObject           = 26 /*0x1A*/,
    MaximumKernelObject         = 27 /*0x1B*/
}KOBJECTS, *PKOBJECTS;

typedef enum _KPROCESS_PPM_POLICY  // 9 elements, 0x4 bytes
{
    ProcessPpmDefault         = 0 /*0x0*/,
    ProcessPpmThrottle        = 1 /*0x1*/,
    ProcessPpmSemiThrottle    = 2 /*0x2*/,
    ProcessPpmNoThrottle      = 3 /*0x3*/,
    ProcessPpmWindowMinimized = 4 /*0x4*/,
    ProcessPpmWindowOccluded  = 5 /*0x5*/,
    ProcessPpmWindowVisible   = 6 /*0x6*/,
    ProcessPpmWindowInFocus   = 7 /*0x7*/,
    MaxProcessPpmPolicy       = 8 /*0x8*/
}KPROCESS_PPM_POLICY, *PKPROCESS_PPM_POLICY;

typedef enum _KPROCESS_STATE  // 8 elements, 0x4 bytes
{
    ProcessInMemory      = 0 /*0x0*/,
    ProcessOutOfMemory   = 1 /*0x1*/,
    ProcessInTransition  = 2 /*0x2*/,
    ProcessOutTransition = 3 /*0x3*/,
    ProcessInSwap        = 4 /*0x4*/,
    ProcessOutSwap       = 5 /*0x5*/,
    ProcessRetryOutSwap  = 6 /*0x6*/,
    ProcessAllSwapStates = 7 /*0x7*/
}KPROCESS_STATE, *PKPROCESS_STATE;

typedef enum _KTHREAD_PPM_POLICY  // 5 elements, 0x4 bytes
{
    ThreadPpmDefault      = 0 /*0x0*/,
    ThreadPpmThrottle     = 1 /*0x1*/,
    ThreadPpmSemiThrottle = 2 /*0x2*/,
    ThreadPpmNoThrottle   = 3 /*0x3*/,
    MaxThreadPpmPolicy    = 4 /*0x4*/
}KTHREAD_PPM_POLICY, *PKTHREAD_PPM_POLICY;

typedef enum _KTHREAD_TAG  // 3 elements, 0x4 bytes
{
    KThreadTagNone           = 0 /*0x0*/,
    KThreadTagMediaBuffering = 1 /*0x1*/,
    KThreadTagMax            = 2 /*0x2*/
}KTHREAD_TAG, *PKTHREAD_TAG;

typedef enum _KWAIT_BLOCK_STATE  // 8 elements, 0x4 bytes
{
    WaitBlockBypassStart           = 0 /*0x0*/,
    WaitBlockBypassComplete        = 1 /*0x1*/,
    WaitBlockSuspendBypassStart    = 2 /*0x2*/,
    WaitBlockSuspendBypassComplete = 3 /*0x3*/,
    WaitBlockActive                = 4 /*0x4*/,
    WaitBlockInactive              = 5 /*0x5*/,
    WaitBlockSuspended             = 6 /*0x6*/,
    WaitBlockAllStates             = 7 /*0x7*/
}KWAIT_BLOCK_STATE, *PKWAIT_BLOCK_STATE;

typedef enum _KWAIT_STATE  // 10 elements, 0x4 bytes
{
    WaitInProgress        = 0 /*0x0*/,
    WaitCommitted         = 1 /*0x1*/,
    WaitAborted           = 2 /*0x2*/,
    WaitSuspendInProgress = 3 /*0x3*/,
    WaitSuspended         = 4 /*0x4*/,
    WaitResumeInProgress  = 5 /*0x5*/,
    WaitResumeAborted     = 6 /*0x6*/,
    WaitFirstSuspendState = 3 /*0x3*/,
    WaitLastSuspendState  = 6 /*0x6*/,
    MaximumWaitState      = 7 /*0x7*/
}KWAIT_STATE, *PKWAIT_STATE;

typedef enum _LDR_DDAG_STATE  // 15 elements, 0x4 bytes
{
    LdrModulesMerged                 = -5 /*0xFB*/,
    LdrModulesInitError              = -4 /*0xFC*/,
    LdrModulesSnapError              = -3 /*0xFD*/,
    LdrModulesUnloaded               = -2 /*0xFE*/,
    LdrModulesUnloading              = -1 /*0xFF*/,
    LdrModulesPlaceHolder            = 0 /*0x0*/,
    LdrModulesMapping                = 1 /*0x1*/,
    LdrModulesMapped                 = 2 /*0x2*/,
    LdrModulesWaitingForDependencies = 3 /*0x3*/,
    LdrModulesSnapping               = 4 /*0x4*/,
    LdrModulesSnapped                = 5 /*0x5*/,
    LdrModulesCondensed              = 6 /*0x6*/,
    LdrModulesReadyToInit            = 7 /*0x7*/,
    LdrModulesInitializing           = 8 /*0x8*/,
    LdrModulesReadyToRun             = 9 /*0x9*/
}LDR_DDAG_STATE, *PLDR_DDAG_STATE;

typedef enum _LDR_DLL_LOAD_REASON  // 10 elements, 0x4 bytes
{
    LoadReasonStaticDependency           = 0 /*0x0*/,
    LoadReasonStaticForwarderDependency  = 1 /*0x1*/,
    LoadReasonDynamicForwarderDependency = 2 /*0x2*/,
    LoadReasonDelayloadDependency        = 3 /*0x3*/,
    LoadReasonDynamicLoad                = 4 /*0x4*/,
    LoadReasonAsImageLoad                = 5 /*0x5*/,
    LoadReasonAsDataLoad                 = 6 /*0x6*/,
    LoadReasonEnclavePrimary             = 7 /*0x7*/,
    LoadReasonEnclaveDependency          = 8 /*0x8*/,
    LoadReasonUnknown                    = -1 /*0xFF*/
}LDR_DLL_LOAD_REASON, *PLDR_DLL_LOAD_REASON;

typedef enum _LSA_FOREST_TRUST_RECORD_TYPE  // 4 elements, 0x4 bytes
{
    ForestTrustTopLevelName   = 0 /*0x0*/,
    ForestTrustTopLevelNameEx = 1 /*0x1*/,
    ForestTrustDomainInfo     = 2 /*0x2*/,
    ForestTrustRecordTypeLast = 2 /*0x2*/
}LSA_FOREST_TRUST_RECORD_TYPE, *PLSA_FOREST_TRUST_RECORD_TYPE;

typedef enum _MACHINE_CHECK_NESTING_LEVEL  // 3 elements, 0x4 bytes
{
    McheckNormal        = 0 /*0x0*/,
    McheckNmi           = 1 /*0x1*/,
    McheckNestingLevels = 2 /*0x2*/
}MACHINE_CHECK_NESTING_LEVEL, *PMACHINE_CHECK_NESTING_LEVEL;

typedef enum _MCA_EXCEPTION_TYPE  // 2 elements, 0x4 bytes
{
    HAL_MCE_RECORD = 0 /*0x0*/,
    HAL_MCA_RECORD = 1 /*0x1*/
}MCA_EXCEPTION_TYPE, *PMCA_EXCEPTION_TYPE;

typedef enum _MEMORY_CACHING_TYPE  // 8 elements, 0x4 bytes
{
    MmNonCached              = 0 /*0x0*/,
    MmCached                 = 1 /*0x1*/,
    MmWriteCombined          = 2 /*0x2*/,
    MmHardwareCoherentCached = 3 /*0x3*/,
    MmNonCachedUnordered     = 4 /*0x4*/,
    MmUSWCCached             = 5 /*0x5*/,
    MmMaximumCacheType       = 6 /*0x6*/,
    MmNotMapped              = -1 /*0xFF*/
}MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG  // 1 elements, 0x4 bytes
{
    MmFrameBufferCached = 2 /*0x2*/
}MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _MM_PAGE_ACCESS_TYPE  // 4 elements, 0x4 bytes
{
    MmPteAccessType         = 0 /*0x0*/,
    MmCcReadAheadType       = 1 /*0x1*/,
    MmPfnRepurposeType      = 2 /*0x2*/,
    MmMaximumPageAccessType = 3 /*0x3*/
}MM_PAGE_ACCESS_TYPE, *PMM_PAGE_ACCESS_TYPE;

typedef enum _MODE  // 3 elements, 0x4 bytes
{
    KernelMode  = 0 /*0x0*/,
    UserMode    = 1 /*0x1*/,
    MaximumMode = 2 /*0x2*/
}MODE, *PMODE;

typedef enum _NT_PRODUCT_TYPE  // 3 elements, 0x4 bytes
{
    NtProductWinNt    = 1 /*0x1*/,
    NtProductLanManNt = 2 /*0x2*/,
    NtProductServer   = 3 /*0x3*/
}NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _OB_OPEN_REASON  // 5 elements, 0x4 bytes
{
    ObCreateHandle    = 0 /*0x0*/,
    ObOpenHandle      = 1 /*0x1*/,
    ObDuplicateHandle = 2 /*0x2*/,
    ObInheritHandle   = 3 /*0x3*/,
    ObMaxOpenReason   = 4 /*0x4*/
}OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _PERFINFO_KERNELMEMORY_USAGE_TYPE  // 2 elements, 0x4 bytes
{
    PerfInfoMemUsagePfnMetadata = 0 /*0x0*/,
    PerfInfoMemUsageMax         = 1 /*0x1*/
}PERFINFO_KERNELMEMORY_USAGE_TYPE, *PPERFINFO_KERNELMEMORY_USAGE_TYPE;

typedef enum _PERFINFO_MM_STAT  // 4 elements, 0x4 bytes
{
    PerfInfoMMStatNotUsed              = 0 /*0x0*/,
    PerfInfoMMStatAggregatePageCombine = 1 /*0x1*/,
    PerfInfoMMStatIterationPageCombine = 2 /*0x2*/,
    PerfInfoMMStatMax                  = 3 /*0x3*/
}PERFINFO_MM_STAT, *PPERFINFO_MM_STAT;

typedef enum _PF_FILE_ACCESS_TYPE  // 3 elements, 0x4 bytes
{
    PfFileAccessTypeRead  = 0 /*0x0*/,
    PfFileAccessTypeWrite = 1 /*0x1*/,
    PfFileAccessTypeMax   = 2 /*0x2*/
}PF_FILE_ACCESS_TYPE, *PPF_FILE_ACCESS_TYPE;

typedef enum _POOL_TYPE  // 23 elements, 0x4 bytes
{
    NonPagedPool                         = 0 /*0x0*/,
    NonPagedPoolExecute                  = 0 /*0x0*/,
    PagedPool                            = 1 /*0x1*/,
    NonPagedPoolMustSucceed              = 2 /*0x2*/,
    DontUseThisType                      = 3 /*0x3*/,
    NonPagedPoolCacheAligned             = 4 /*0x4*/,
    PagedPoolCacheAligned                = 5 /*0x5*/,
    NonPagedPoolCacheAlignedMustS        = 6 /*0x6*/,
    MaxPoolType                          = 7 /*0x7*/,
    NonPagedPoolBase                     = 0 /*0x0*/,
    NonPagedPoolBaseMustSucceed          = 2 /*0x2*/,
    NonPagedPoolBaseCacheAligned         = 4 /*0x4*/,
    NonPagedPoolBaseCacheAlignedMustS    = 6 /*0x6*/,
    NonPagedPoolSession                  = 32 /*0x20*/,
    PagedPoolSession                     = 33 /*0x21*/,
    NonPagedPoolMustSucceedSession       = 34 /*0x22*/,
    DontUseThisTypeSession               = 35 /*0x23*/,
    NonPagedPoolCacheAlignedSession      = 36 /*0x24*/,
    PagedPoolCacheAlignedSession         = 37 /*0x25*/,
    NonPagedPoolCacheAlignedMustSSession = 38 /*0x26*/,
    NonPagedPoolNx                       = 512 /*0x200*/,
    NonPagedPoolNxCacheAligned           = 516 /*0x204*/,
    NonPagedPoolSessionNx                = 544 /*0x220*/
}POOL_TYPE, *PPOOL_TYPE;

typedef enum _POWER_ACTION  // 9 elements, 0x4 bytes
{
    PowerActionNone          = 0 /*0x0*/,
    PowerActionReserved      = 1 /*0x1*/,
    PowerActionSleep         = 2 /*0x2*/,
    PowerActionHibernate     = 3 /*0x3*/,
    PowerActionShutdown      = 4 /*0x4*/,
    PowerActionShutdownReset = 5 /*0x5*/,
    PowerActionShutdownOff   = 6 /*0x6*/,
    PowerActionWarmEject     = 7 /*0x7*/,
    PowerActionDisplayOff    = 8 /*0x8*/
}POWER_ACTION, *PPOWER_ACTION;

typedef enum _POWER_STATE_TYPE  // 2 elements, 0x4 bytes
{
    SystemPowerState = 0 /*0x0*/,
    DevicePowerState = 1 /*0x1*/
}POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER  // 10 elements, 0x4 bytes
{
    LookasideSmallIrpList      = 0 /*0x0*/,
    LookasideMediumIrpList     = 1 /*0x1*/,
    LookasideLargeIrpList      = 2 /*0x2*/,
    LookasideMdlList           = 3 /*0x3*/,
    LookasideCreateInfoList    = 4 /*0x4*/,
    LookasideNameBufferList    = 5 /*0x5*/,
    LookasideTwilightList      = 6 /*0x6*/,
    LookasideCompletionList    = 7 /*0x7*/,
    LookasideScratchBufferList = 8 /*0x8*/,
    LookasideMaximumList       = 9 /*0x9*/
}PP_NPAGED_LOOKASIDE_NUMBER, *PPP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _PPM_IDLE_BUCKET_TIME_TYPE  // 3 elements, 0x4 bytes
{
    PpmIdleBucketTimeInQpc   = 0 /*0x0*/,
    PpmIdleBucketTimeIn100ns = 1 /*0x1*/,
    PpmIdleBucketTimeMaximum = 2 /*0x2*/
}PPM_IDLE_BUCKET_TIME_TYPE, *PPPM_IDLE_BUCKET_TIME_TYPE;

typedef enum _PROC_HYPERVISOR_STATE  // 4 elements, 0x4 bytes
{
    ProcHypervisorNone       = 0 /*0x0*/,
    ProcHypervisorPresent    = 1 /*0x1*/,
    ProcHypervisorPower      = 2 /*0x2*/,
    ProcHypervisorHvCounters = 3 /*0x3*/
}PROC_HYPERVISOR_STATE, *PPROC_HYPERVISOR_STATE;

typedef enum _PROCESS_SECTION_TYPE  // 5 elements, 0x4 bytes
{
    ProcessSectionData           = 0 /*0x0*/,
    ProcessSectionImage          = 1 /*0x1*/,
    ProcessSectionImageNx        = 2 /*0x2*/,
    ProcessSectionPagefileBacked = 3 /*0x3*/,
    ProcessSectionMax            = 4 /*0x4*/
}PROCESS_SECTION_TYPE, *PPROCESS_SECTION_TYPE;

typedef enum _PROCESS_TERMINATE_REQUEST_REASON  // 5 elements, 0x4 bytes
{
    ProcessTerminateRequestReasonNone            = 0 /*0x0*/,
    ProcessTerminateCommitFail                   = 1 /*0x1*/,
    ProcessTerminateWriteToExecuteMemory         = 2 /*0x2*/,
    ProcessTerminateAttachedWriteToExecuteMemory = 3 /*0x3*/,
    ProcessTerminateRequestReasonMax             = 4 /*0x4*/
}PROCESS_TERMINATE_REQUEST_REASON, *PPROCESS_TERMINATE_REQUEST_REASON;

typedef enum _PROCESS_VA_TYPE  // 4 elements, 0x4 bytes
{
    ProcessVAImage   = 0 /*0x0*/,
    ProcessVASection = 1 /*0x1*/,
    ProcessVAPrivate = 2 /*0x2*/,
    ProcessVAMax     = 3 /*0x3*/
}PROCESS_VA_TYPE, *PPROCESS_VA_TYPE;

typedef enum _PROCESSOR_CACHE_TYPE  // 4 elements, 0x4 bytes
{
    CacheUnified     = 0 /*0x0*/,
    CacheInstruction = 1 /*0x1*/,
    CacheData        = 2 /*0x2*/,
    CacheTrace       = 3 /*0x3*/
}PROCESSOR_CACHE_TYPE, *PPROCESSOR_CACHE_TYPE;

typedef enum _PS_ATTRIBUTE_NUM  // 28 elements, 0x4 bytes
{
    PsAttributeParentProcess                = 0 /*0x0*/,
    PsAttributeDebugObject                  = 1 /*0x1*/,
    PsAttributeToken                        = 2 /*0x2*/,
    PsAttributeClientId                     = 3 /*0x3*/,
    PsAttributeTebAddress                   = 4 /*0x4*/,
    PsAttributeImageName                    = 5 /*0x5*/,
    PsAttributeImageInfo                    = 6 /*0x6*/,
    PsAttributeMemoryReserve                = 7 /*0x7*/,
    PsAttributePriorityClass                = 8 /*0x8*/,
    PsAttributeErrorMode                    = 9 /*0x9*/,
    PsAttributeStdHandleInfo                = 10 /*0xA*/,
    PsAttributeHandleList                   = 11 /*0xB*/,
    PsAttributeGroupAffinity                = 12 /*0xC*/,
    PsAttributePreferredNode                = 13 /*0xD*/,
    PsAttributeIdealProcessor               = 14 /*0xE*/,
    PsAttributeUmsThread                    = 15 /*0xF*/,
    PsAttributeMitigationOptions            = 16 /*0x10*/,
    PsAttributeProtectionLevel              = 17 /*0x11*/,
    PsAttributeSecureProcess                = 18 /*0x12*/,
    PsAttributeJobList                      = 19 /*0x13*/,
    PsAttributeChildProcessPolicy           = 20 /*0x14*/,
    PsAttributeAllApplicationPackagesPolicy = 21 /*0x15*/,
    PsAttributeWin32kFilter                 = 22 /*0x16*/,
    PsAttributeSafeOpenPromptOriginClaim    = 23 /*0x17*/,
    PsAttributeBnoIsolation                 = 24 /*0x18*/,
    PsAttributeDesktopAppPolicy             = 25 /*0x19*/,
    PsAttributeChpe                         = 26 /*0x1A*/,
    PsAttributeMax                          = 27 /*0x1B*/
}PS_ATTRIBUTE_NUM, *PPS_ATTRIBUTE_NUM;

typedef enum _PS_CREATE_STATE  // 8 elements, 0x4 bytes
{
    PsCreateInitialState        = 0 /*0x0*/,
    PsCreateFailOnFileOpen      = 1 /*0x1*/,
    PsCreateFailOnSectionCreate = 2 /*0x2*/,
    PsCreateFailExeFormat       = 3 /*0x3*/,
    PsCreateFailMachineMismatch = 4 /*0x4*/,
    PsCreateFailExeName         = 5 /*0x5*/,
    PsCreateSuccess             = 6 /*0x6*/,
    PsCreateMaximumStates       = 7 /*0x7*/
}PS_CREATE_STATE, *PPS_CREATE_STATE;

typedef enum _PS_MITIGATION_OPTION  // 32 elements, 0x4 bytes
{
    PS_MITIGATION_OPTION_NX                                  = 0 /*0x0*/,
    PS_MITIGATION_OPTION_SEHOP                               = 1 /*0x1*/,
    PS_MITIGATION_OPTION_FORCE_RELOCATE_IMAGES               = 2 /*0x2*/,
    PS_MITIGATION_OPTION_HEAP_TERMINATE                      = 3 /*0x3*/,
    PS_MITIGATION_OPTION_BOTTOM_UP_ASLR                      = 4 /*0x4*/,
    PS_MITIGATION_OPTION_HIGH_ENTROPY_ASLR                   = 5 /*0x5*/,
    PS_MITIGATION_OPTION_STRICT_HANDLE_CHECKS                = 6 /*0x6*/,
    PS_MITIGATION_OPTION_WIN32K_SYSTEM_CALL_DISABLE          = 7 /*0x7*/,
    PS_MITIGATION_OPTION_EXTENSION_POINT_DISABLE             = 8 /*0x8*/,
    PS_MITIGATION_OPTION_PROHIBIT_DYNAMIC_CODE               = 9 /*0x9*/,
    PS_MITIGATION_OPTION_CONTROL_FLOW_GUARD                  = 10 /*0xA*/,
    PS_MITIGATION_OPTION_BLOCK_NON_MICROSOFT_BINARIES        = 11 /*0xB*/,
    PS_MITIGATION_OPTION_FONT_DISABLE                        = 12 /*0xC*/,
    PS_MITIGATION_OPTION_IMAGE_LOAD_NO_REMOTE                = 13 /*0xD*/,
    PS_MITIGATION_OPTION_IMAGE_LOAD_NO_LOW_LABEL             = 14 /*0xE*/,
    PS_MITIGATION_OPTION_IMAGE_LOAD_PREFER_SYSTEM32          = 15 /*0xF*/,
    PS_MITIGATION_OPTION_RETURN_FLOW_GUARD                   = 16 /*0x10*/,
    PS_MITIGATION_OPTION_LOADER_INTEGRITY_CONTINUITY         = 17 /*0x11*/,
    PS_MITIGATION_OPTION_STRICT_CONTROL_FLOW_GUARD           = 18 /*0x12*/,
    PS_MITIGATION_OPTION_RESTRICT_SET_THREAD_CONTEXT         = 19 /*0x13*/,
    PS_MITIGATION_OPTION_ROP_STACKPIVOT                      = 20 /*0x14*/,
    PS_MITIGATION_OPTION_ROP_CALLER_CHECK                    = 21 /*0x15*/,
    PS_MITIGATION_OPTION_ROP_SIMEXEC                         = 22 /*0x16*/,
    PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER               = 23 /*0x17*/,
    PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER_PLUS          = 24 /*0x18*/,
    PS_MITIGATION_OPTION_RESTRICT_CHILD_PROCESS_CREATION     = 25 /*0x19*/,
    PS_MITIGATION_OPTION_IMPORT_ADDRESS_FILTER               = 26 /*0x1A*/,
    PS_MITIGATION_OPTION_MODULE_TAMPERING_PROTECTION         = 27 /*0x1B*/,
    PS_MITIGATION_OPTION_RESTRICT_INDIRECT_BRANCH_PREDICTION = 28 /*0x1C*/,
    PS_MITIGATION_OPTION_SPECULATIVE_STORE_BYPASS_DISABLE    = 29 /*0x1D*/,
    PS_MITIGATION_OPTION_ALLOW_DOWNGRADE_DYNAMIC_CODE_POLICY = 30 /*0x1E*/,
    PS_MITIGATION_OPTION_CET_SHADOW_STACKS                   = 31 /*0x1F*/
}PS_MITIGATION_OPTION, *PPS_MITIGATION_OPTION;

typedef enum _PS_PROTECTED_SIGNER  // 10 elements, 0x4 bytes
{
    PsProtectedSignerNone         = 0 /*0x0*/,
    PsProtectedSignerAuthenticode = 1 /*0x1*/,
    PsProtectedSignerCodeGen      = 2 /*0x2*/,
    PsProtectedSignerAntimalware  = 3 /*0x3*/,
    PsProtectedSignerLsa          = 4 /*0x4*/,
    PsProtectedSignerWindows      = 5 /*0x5*/,
    PsProtectedSignerWinTcb       = 6 /*0x6*/,
    PsProtectedSignerWinSystem    = 7 /*0x7*/,
    PsProtectedSignerApp          = 8 /*0x8*/,
    PsProtectedSignerMax          = 9 /*0x9*/
}PS_PROTECTED_SIGNER, *PPS_PROTECTED_SIGNER;

typedef enum _PS_PROTECTED_TYPE  // 4 elements, 0x4 bytes
{
    PsProtectedTypeNone           = 0 /*0x0*/,
    PsProtectedTypeProtectedLight = 1 /*0x1*/,
    PsProtectedTypeProtected      = 2 /*0x2*/,
    PsProtectedTypeMax            = 3 /*0x3*/
}PS_PROTECTED_TYPE, *PPS_PROTECTED_TYPE;

typedef enum _PS_RESOURCE_TYPE  // 5 elements, 0x4 bytes
{
    PsResourceNonPagedPool = 0 /*0x0*/,
    PsResourcePagedPool    = 1 /*0x1*/,
    PsResourcePageFile     = 2 /*0x2*/,
    PsResourceWorkingSet   = 3 /*0x3*/,
    PsResourceMax          = 4 /*0x4*/
}PS_RESOURCE_TYPE, *PPS_RESOURCE_TYPE;

typedef enum _PS_STD_HANDLE_STATE  // 4 elements, 0x4 bytes
{
    PsNeverDuplicate     = 0 /*0x0*/,
    PsRequestDuplicate   = 1 /*0x1*/,
    PsAlwaysDuplicate    = 2 /*0x2*/,
    PsMaxStdHandleStates = 3 /*0x3*/
}PS_STD_HANDLE_STATE, *PPS_STD_HANDLE_STATE;

typedef enum _PS_WAKE_REASON  // 8 elements, 0x4 bytes
{
    PsWakeReasonUser              = 0 /*0x0*/,
    PsWakeReasonExecutionRequired = 1 /*0x1*/,
    PsWakeReasonKernel            = 2 /*0x2*/,
    PsWakeReasonInstrumentation   = 3 /*0x3*/,
    PsWakeReasonPreserveProcess   = 4 /*0x4*/,
    PsWakeReasonActivityReference = 5 /*0x5*/,
    PsWakeReasonWorkOnBehalf      = 6 /*0x6*/,
    PsMaxWakeReasons              = 7 /*0x7*/
}PS_WAKE_REASON, *PPS_WAKE_REASON;

typedef enum _REG_NOTIFY_CLASS  // 61 elements, 0x4 bytes
{
    RegNtDeleteKey                    = 0 /*0x0*/,
    RegNtPreDeleteKey                 = 0 /*0x0*/,
    RegNtSetValueKey                  = 1 /*0x1*/,
    RegNtPreSetValueKey               = 1 /*0x1*/,
    RegNtDeleteValueKey               = 2 /*0x2*/,
    RegNtPreDeleteValueKey            = 2 /*0x2*/,
    RegNtSetInformationKey            = 3 /*0x3*/,
    RegNtPreSetInformationKey         = 3 /*0x3*/,
    RegNtRenameKey                    = 4 /*0x4*/,
    RegNtPreRenameKey                 = 4 /*0x4*/,
    RegNtEnumerateKey                 = 5 /*0x5*/,
    RegNtPreEnumerateKey              = 5 /*0x5*/,
    RegNtEnumerateValueKey            = 6 /*0x6*/,
    RegNtPreEnumerateValueKey         = 6 /*0x6*/,
    RegNtQueryKey                     = 7 /*0x7*/,
    RegNtPreQueryKey                  = 7 /*0x7*/,
    RegNtQueryValueKey                = 8 /*0x8*/,
    RegNtPreQueryValueKey             = 8 /*0x8*/,
    RegNtQueryMultipleValueKey        = 9 /*0x9*/,
    RegNtPreQueryMultipleValueKey     = 9 /*0x9*/,
    RegNtPreCreateKey                 = 10 /*0xA*/,
    RegNtPostCreateKey                = 11 /*0xB*/,
    RegNtPreOpenKey                   = 12 /*0xC*/,
    RegNtPostOpenKey                  = 13 /*0xD*/,
    RegNtKeyHandleClose               = 14 /*0xE*/,
    RegNtPreKeyHandleClose            = 14 /*0xE*/,
    RegNtPostDeleteKey                = 15 /*0xF*/,
    RegNtPostSetValueKey              = 16 /*0x10*/,
    RegNtPostDeleteValueKey           = 17 /*0x11*/,
    RegNtPostSetInformationKey        = 18 /*0x12*/,
    RegNtPostRenameKey                = 19 /*0x13*/,
    RegNtPostEnumerateKey             = 20 /*0x14*/,
    RegNtPostEnumerateValueKey        = 21 /*0x15*/,
    RegNtPostQueryKey                 = 22 /*0x16*/,
    RegNtPostQueryValueKey            = 23 /*0x17*/,
    RegNtPostQueryMultipleValueKey    = 24 /*0x18*/,
    RegNtPostKeyHandleClose           = 25 /*0x19*/,
    RegNtPreCreateKeyEx               = 26 /*0x1A*/,
    RegNtPostCreateKeyEx              = 27 /*0x1B*/,
    RegNtPreOpenKeyEx                 = 28 /*0x1C*/,
    RegNtPostOpenKeyEx                = 29 /*0x1D*/,
    RegNtPreFlushKey                  = 30 /*0x1E*/,
    RegNtPostFlushKey                 = 31 /*0x1F*/,
    RegNtPreLoadKey                   = 32 /*0x20*/,
    RegNtPostLoadKey                  = 33 /*0x21*/,
    RegNtPreUnLoadKey                 = 34 /*0x22*/,
    RegNtPostUnLoadKey                = 35 /*0x23*/,
    RegNtPreQueryKeySecurity          = 36 /*0x24*/,
    RegNtPostQueryKeySecurity         = 37 /*0x25*/,
    RegNtPreSetKeySecurity            = 38 /*0x26*/,
    RegNtPostSetKeySecurity           = 39 /*0x27*/,
    RegNtCallbackObjectContextCleanup = 40 /*0x28*/,
    RegNtPreRestoreKey                = 41 /*0x29*/,
    RegNtPostRestoreKey               = 42 /*0x2A*/,
    RegNtPreSaveKey                   = 43 /*0x2B*/,
    RegNtPostSaveKey                  = 44 /*0x2C*/,
    RegNtPreReplaceKey                = 45 /*0x2D*/,
    RegNtPostReplaceKey               = 46 /*0x2E*/,
    RegNtPreQueryKeyName              = 47 /*0x2F*/,
    RegNtPostQueryKeyName             = 48 /*0x30*/,
    MaxRegNtNotifyClass               = 49 /*0x31*/
}REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef enum _ReplacesCorHdrNumericDefines  // 25 elements, 0x4 bytes
{
    COMIMAGE_FLAGS_ILONLY                      = 1 /*0x1*/,
    COMIMAGE_FLAGS_32BITREQUIRED               = 2 /*0x2*/,
    COMIMAGE_FLAGS_IL_LIBRARY                  = 4 /*0x4*/,
    COMIMAGE_FLAGS_STRONGNAMESIGNED            = 8 /*0x8*/,
    COMIMAGE_FLAGS_NATIVE_ENTRYPOINT           = 16 /*0x10*/,
    COMIMAGE_FLAGS_TRACKDEBUGDATA              = 65536 /*0x10000*/,
    COMIMAGE_FLAGS_32BITPREFERRED              = 131072 /*0x20000*/,
    COR_VERSION_MAJOR_V2                       = 2 /*0x2*/,
    COR_VERSION_MAJOR                          = 2 /*0x2*/,
    COR_VERSION_MINOR                          = 5 /*0x5*/,
    COR_DELETED_NAME_LENGTH                    = 8 /*0x8*/,
    COR_VTABLEGAP_NAME_LENGTH                  = 8 /*0x8*/,
    NATIVE_TYPE_MAX_CB                         = 1 /*0x1*/,
    COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE       = 255 /*0xFF*/,
    IMAGE_COR_MIH_METHODRVA                    = 1 /*0x1*/,
    IMAGE_COR_MIH_EHRVA                        = 2 /*0x2*/,
    IMAGE_COR_MIH_BASICBLOCK                   = 8 /*0x8*/,
    COR_VTABLE_32BIT                           = 1 /*0x1*/,
    COR_VTABLE_64BIT                           = 2 /*0x2*/,
    COR_VTABLE_FROM_UNMANAGED                  = 4 /*0x4*/,
    COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8 /*0x8*/,
    COR_VTABLE_CALL_MOST_DERIVED               = 16 /*0x10*/,
    IMAGE_COR_EATJ_THUNK_SIZE                  = 32 /*0x20*/,
    MAX_CLASS_NAME                             = 1024 /*0x400*/,
    MAX_PACKAGE_NAME                           = 1024 /*0x400*/
}ReplacesCorHdrNumericDefines, *PReplacesCorHdrNumericDefines;

typedef enum _RTL_GENERIC_COMPARE_RESULTS  // 3 elements, 0x4 bytes
{
    GenericLessThan    = 0 /*0x0*/,
    GenericGreaterThan = 1 /*0x1*/,
    GenericEqual       = 2 /*0x2*/
}RTL_GENERIC_COMPARE_RESULTS, *PRTL_GENERIC_COMPARE_RESULTS;

typedef enum _RTL_MEMORY_TYPE  // 5 elements, 0x4 bytes
{
    MemoryTypePaged     = 0 /*0x0*/,
    MemoryTypeNonPaged  = 1 /*0x1*/,
    MemoryTypeLargePage = 2 /*0x2*/,
    MemoryTypeHugePage  = 3 /*0x3*/,
    MemoryTypeMax       = 4 /*0x4*/
}RTL_MEMORY_TYPE, *PRTL_MEMORY_TYPE;

typedef enum _RTLP_CSPARSE_BITMAP_STATE  // 3 elements, 0x4 bytes
{
    CommitBitmapInvalid = 0 /*0x0*/,
    UserBitmapInvalid   = 1 /*0x1*/,
    UserBitmapValid     = 2 /*0x2*/
}RTLP_CSPARSE_BITMAP_STATE, *PRTLP_CSPARSE_BITMAP_STATE;

typedef enum _RTLP_HP_ADDRESS_SPACE_TYPE  // 4 elements, 0x4 bytes
{
    HeapAddressUser    = 0 /*0x0*/,
    HeapAddressKernel  = 1 /*0x1*/,
    HeapAddressSession = 2 /*0x2*/,
    HeapAddressTypeMax = 3 /*0x3*/
}RTLP_HP_ADDRESS_SPACE_TYPE, *PRTLP_HP_ADDRESS_SPACE_TYPE;

typedef enum _RTLP_HP_ALLOCATOR  // 5 elements, 0x4 bytes
{
    RtlpHpSegmentSm     = 0 /*0x0*/,
    RtlpHpSegmentLg     = 1 /*0x1*/,
    RtlpHpSegmentTypes  = 2 /*0x2*/,
    RtlpHpHugeAllocator = 2 /*0x2*/,
    RtlpHpAllocatorMax  = 3 /*0x3*/
}RTLP_HP_ALLOCATOR, *PRTLP_HP_ALLOCATOR;

typedef enum _RTLP_HP_LOCK_TYPE  // 3 elements, 0x4 bytes
{
    HeapLockPaged    = 0 /*0x0*/,
    HeapLockNonPaged = 1 /*0x1*/,
    HeapLockTypeMax  = 2 /*0x2*/
}RTLP_HP_LOCK_TYPE, *PRTLP_HP_LOCK_TYPE;

typedef enum _RTLP_HP_MEMORY_TYPE  // 5 elements, 0x4 bytes
{
    HeapMemoryPaged     = 0 /*0x0*/,
    HeapMemoryNonPaged  = 1 /*0x1*/,
    HeapMemoryLargePage = 2 /*0x2*/,
    HeapMemoryHugePage  = 3 /*0x3*/,
    HeapMemoryTypeMax   = 4 /*0x4*/
}RTLP_HP_MEMORY_TYPE, *PRTLP_HP_MEMORY_TYPE;

typedef enum _SE_WS_APPX_SIGNATURE_ORIGIN  // 5 elements, 0x4 bytes
{
    SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0 /*0x0*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN       = 1 /*0x1*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE      = 2 /*0x2*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS       = 3 /*0x3*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE    = 4 /*0x4*/
}SE_WS_APPX_SIGNATURE_ORIGIN, *PSE_WS_APPX_SIGNATURE_ORIGIN;

typedef enum _SECURITY_IMPERSONATION_LEVEL  // 4 elements, 0x4 bytes
{
    SecurityAnonymous      = 0 /*0x0*/,
    SecurityIdentification = 1 /*0x1*/,
    SecurityImpersonation  = 2 /*0x2*/,
    SecurityDelegation     = 3 /*0x3*/
}SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _SECURITY_OPERATION_CODE  // 4 elements, 0x4 bytes
{
    SetSecurityDescriptor    = 0 /*0x0*/,
    QuerySecurityDescriptor  = 1 /*0x1*/,
    DeleteSecurityDescriptor = 2 /*0x2*/,
    AssignSecurityDescriptor = 3 /*0x3*/
}SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _SERVERSILO_STATE  // 5 elements, 0x4 bytes
{
    SERVERSILO_INITING       = 0 /*0x0*/,
    SERVERSILO_STARTED       = 1 /*0x1*/,
    SERVERSILO_SHUTTING_DOWN = 2 /*0x2*/,
    SERVERSILO_TERMINATING   = 3 /*0x3*/,
    SERVERSILO_TERMINATED    = 4 /*0x4*/
}SERVERSILO_STATE, *PSERVERSILO_STATE;

typedef enum _SYSTEM_DLL_TYPE  // 7 elements, 0x4 bytes
{
    PsNativeSystemDll      = 0 /*0x0*/,
    PsWowX86SystemDll      = 1 /*0x1*/,
    PsWowArm32SystemDll    = 2 /*0x2*/,
    PsWowAmd64SystemDll    = 3 /*0x3*/,
    PsWowChpeX86SystemDll  = 4 /*0x4*/,
    PsVsmEnclaveRuntimeDll = 5 /*0x5*/,
    PsSystemDllTotalTypes  = 6 /*0x6*/
}SYSTEM_DLL_TYPE, *PSYSTEM_DLL_TYPE;

typedef enum _SYSTEM_POWER_STATE  // 8 elements, 0x4 bytes
{
    PowerSystemUnspecified = 0 /*0x0*/,
    PowerSystemWorking     = 1 /*0x1*/,
    PowerSystemSleeping1   = 2 /*0x2*/,
    PowerSystemSleeping2   = 3 /*0x3*/,
    PowerSystemSleeping3   = 4 /*0x4*/,
    PowerSystemHibernate   = 5 /*0x5*/,
    PowerSystemShutdown    = 6 /*0x6*/,
    PowerSystemMaximum     = 7 /*0x7*/
}SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _SYSTEM_PROCESS_CLASSIFICATION  // 6 elements, 0x4 bytes
{
    SystemProcessClassificationNormal         = 0 /*0x0*/,
    SystemProcessClassificationSystem         = 1 /*0x1*/,
    SystemProcessClassificationSecureSystem   = 2 /*0x2*/,
    SystemProcessClassificationMemCompression = 3 /*0x3*/,
    SystemProcessClassificationRegistry       = 4 /*0x4*/,
    SystemProcessClassificationMaximum        = 5 /*0x5*/
}SYSTEM_PROCESS_CLASSIFICATION, *PSYSTEM_PROCESS_CLASSIFICATION;

typedef enum _THREAD_WORKLOAD_CLASS  // 3 elements, 0x4 bytes
{
    ThreadWorkloadClassDefault  = 0 /*0x0*/,
    ThreadWorkloadClassGraphics = 1 /*0x1*/,
    MaxThreadWorkloadClass      = 2 /*0x2*/
}THREAD_WORKLOAD_CLASS, *PTHREAD_WORKLOAD_CLASS;

typedef enum _TP_CALLBACK_PRIORITY  // 5 elements, 0x4 bytes
{
    TP_CALLBACK_PRIORITY_HIGH    = 0 /*0x0*/,
    TP_CALLBACK_PRIORITY_NORMAL  = 1 /*0x1*/,
    TP_CALLBACK_PRIORITY_LOW     = 2 /*0x2*/,
    TP_CALLBACK_PRIORITY_INVALID = 3 /*0x3*/,
    TP_CALLBACK_PRIORITY_COUNT   = 3 /*0x3*/
}TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef enum _TRACE_INFORMATION_CLASS  // 18 elements, 0x4 bytes
{
    TraceIdClass                   = 0 /*0x0*/,
    TraceHandleClass               = 1 /*0x1*/,
    TraceEnableFlagsClass          = 2 /*0x2*/,
    TraceEnableLevelClass          = 3 /*0x3*/,
    GlobalLoggerHandleClass        = 4 /*0x4*/,
    EventLoggerHandleClass         = 5 /*0x5*/,
    AllLoggerHandlesClass          = 6 /*0x6*/,
    TraceHandleByNameClass         = 7 /*0x7*/,
    LoggerEventsLostClass          = 8 /*0x8*/,
    TraceSessionSettingsClass      = 9 /*0x9*/,
    LoggerEventsLoggedClass        = 10 /*0xA*/,
    DiskIoNotifyRoutinesClass      = 11 /*0xB*/,
    TraceInformationClassReserved1 = 12 /*0xC*/,
    AllPossibleNotifyRoutinesClass = 12 /*0xC*/,
    FltIoNotifyRoutinesClass       = 13 /*0xD*/,
    TraceInformationClassReserved2 = 14 /*0xE*/,
    WdfNotifyRoutinesClass         = 15 /*0xF*/,
    MaxTraceInformationClass       = 16 /*0x10*/
}TRACE_INFORMATION_CLASS, *PTRACE_INFORMATION_CLASS;

typedef enum _USER_ACTIVITY_PRESENCE  // 5 elements, 0x4 bytes
{
    PowerUserPresent    = 0 /*0x0*/,
    PowerUserNotPresent = 1 /*0x1*/,
    PowerUserInactive   = 2 /*0x2*/,
    PowerUserMaximum    = 3 /*0x3*/,
    PowerUserInvalid    = 3 /*0x3*/
}USER_ACTIVITY_PRESENCE, *PUSER_ACTIVITY_PRESENCE;

typedef enum _VERIFIER_RULE_CLASS_ID  // 65 elements, 0x4 bytes
{
    VrfSpecialPoolRuleClass             = 0 /*0x0*/,
    VrfForceIrqlRuleClass               = 1 /*0x1*/,
    VrfAllocationFailuresRuleClass      = 2 /*0x2*/,
    VrfTrackingPoolAllocationsRuleClass = 3 /*0x3*/,
    VrfIORuleClass                      = 4 /*0x4*/,
    VrfDeadlockPreventionRuleClass      = 5 /*0x5*/,
    VrfEnhancedIORuleClass              = 6 /*0x6*/,
    VrfDMARuleClass                     = 7 /*0x7*/,
    VrfSecurityRuleClass                = 8 /*0x8*/,
    VrfForcePendingIORequestRuleClass   = 9 /*0x9*/,
    VrfIRPTrackingRuleClass             = 10 /*0xA*/,
    VrfMiscellaneousRuleClass           = 11 /*0xB*/,
    VrfMoreDebuggingRuleClass           = 12 /*0xC*/,
    VrfMDLInvariantStackRuleClass       = 13 /*0xD*/,
    VrfMDLInvariantDriverRuleClass      = 14 /*0xE*/,
    VrfPowerDelayFuzzingRuleClass       = 15 /*0xF*/,
    VrfPortMiniportRuleClass            = 16 /*0x10*/,
    VrfStandardDDIRuleClass             = 17 /*0x11*/,
    VrfAutoFailRuleClass                = 18 /*0x12*/,
    VrfAdditionalDDIRuleClass           = 19 /*0x13*/,
    VrfRuleClassBase                    = 20 /*0x14*/,
    VrfNdisWifiRuleClass                = 21 /*0x15*/,
    VrfDriverLoggingRuleClass           = 22 /*0x16*/,
    VrfSyncDelayFuzzingRuleClass        = 23 /*0x17*/,
    VrfVMSwitchingRuleClass             = 24 /*0x18*/,
    VrfCodeIntegrityRuleClass           = 25 /*0x19*/,
    VrfBelow4GBAllocationRuleClass      = 26 /*0x1A*/,
    VrfProcessorBranchTraceRuleClass    = 27 /*0x1B*/,
    VrfAdvancedMMRuleClass              = 28 /*0x1C*/,
    VrfExtendingXDVTimeLimit            = 29 /*0x1D*/,
    VrfSystemBIOSRuleClass              = 30 /*0x1E*/,
    VrfHardwareRuleClass                = 31 /*0x1F*/,
    VrfStateSepRuleClass                = 32 /*0x20*/,
    VrfWDFRuleClass                     = 33 /*0x21*/,
    VrfMoreIrqlRuleClass                = 34 /*0x22*/,
    ReservedForDVRF35                   = 35 /*0x23*/,
    ReservedForDVRF36                   = 36 /*0x24*/,
    ReservedForDVRF37                   = 37 /*0x25*/,
    ReservedForDVRF38                   = 38 /*0x26*/,
    ReservedForDVRF39                   = 39 /*0x27*/,
    ReservedForDVRF40                   = 40 /*0x28*/,
    ReservedForDVRF41                   = 41 /*0x29*/,
    ReservedForDVRF42                   = 42 /*0x2A*/,
    ReservedForDVRF43                   = 43 /*0x2B*/,
    ReservedForDVRF44                   = 44 /*0x2C*/,
    ReservedForDVRF45                   = 45 /*0x2D*/,
    ReservedForDVRF46                   = 46 /*0x2E*/,
    ReservedForDVRF47                   = 47 /*0x2F*/,
    ReservedForDVRF48                   = 48 /*0x30*/,
    ReservedForDVRF49                   = 49 /*0x31*/,
    ReservedForDVRF50                   = 50 /*0x32*/,
    ReservedForDVRF51                   = 51 /*0x33*/,
    ReservedForDVRF52                   = 52 /*0x34*/,
    ReservedForDVRF53                   = 53 /*0x35*/,
    ReservedForDVRF54                   = 54 /*0x36*/,
    ReservedForDVRF55                   = 55 /*0x37*/,
    ReservedForDVRF56                   = 56 /*0x38*/,
    ReservedForDVRF57                   = 57 /*0x39*/,
    ReservedForDVRF58                   = 58 /*0x3A*/,
    ReservedForDVRF59                   = 59 /*0x3B*/,
    ReservedForDVRF60                   = 60 /*0x3C*/,
    ReservedForDVRF61                   = 61 /*0x3D*/,
    ReservedForDVRF62                   = 62 /*0x3E*/,
    ReservedForDVRF63                   = 63 /*0x3F*/,
    VrfRuleClassSizeMax                 = 64 /*0x40*/
}VERIFIER_RULE_CLASS_ID, *PVERIFIER_RULE_CLASS_ID;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT  // 9 elements, 0x4 bytes
{
    WheaDataFormatIPFSalRecord = 0 /*0x0*/,
    WheaDataFormatXPFMCA       = 1 /*0x1*/,
    WheaDataFormatMemory       = 2 /*0x2*/,
    WheaDataFormatPCIExpress   = 3 /*0x3*/,
    WheaDataFormatNMIPort      = 4 /*0x4*/,
    WheaDataFormatPCIXBus      = 5 /*0x5*/,
    WheaDataFormatPCIXDevice   = 6 /*0x6*/,
    WheaDataFormatGeneric      = 7 /*0x7*/,
    WheaDataFormatMax          = 8 /*0x8*/
}WHEA_ERROR_PACKET_DATA_FORMAT, *PWHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _WHEA_ERROR_SEVERITY  // 4 elements, 0x4 bytes
{
    WheaErrSevRecoverable   = 0 /*0x0*/,
    WheaErrSevFatal         = 1 /*0x1*/,
    WheaErrSevCorrected     = 2 /*0x2*/,
    WheaErrSevInformational = 3 /*0x3*/
}WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_SOURCE_TYPE  // 15 elements, 0x4 bytes
{
    WheaErrSrcTypeMCE          = 0 /*0x0*/,
    WheaErrSrcTypeCMC          = 1 /*0x1*/,
    WheaErrSrcTypeCPE          = 2 /*0x2*/,
    WheaErrSrcTypeNMI          = 3 /*0x3*/,
    WheaErrSrcTypePCIe         = 4 /*0x4*/,
    WheaErrSrcTypeGeneric      = 5 /*0x5*/,
    WheaErrSrcTypeINIT         = 6 /*0x6*/,
    WheaErrSrcTypeBOOT         = 7 /*0x7*/,
    WheaErrSrcTypeSCIGeneric   = 8 /*0x8*/,
    WheaErrSrcTypeIPFMCA       = 9 /*0x9*/,
    WheaErrSrcTypeIPFCMC       = 10 /*0xA*/,
    WheaErrSrcTypeIPFCPE       = 11 /*0xB*/,
    WheaErrSrcTypeGenericV2    = 12 /*0xC*/,
    WheaErrSrcTypeSCIGenericV2 = 13 /*0xD*/,
    WheaErrSrcTypeMax          = 14 /*0xE*/
}WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_TYPE  // 7 elements, 0x4 bytes
{
    WheaErrTypeProcessor  = 0 /*0x0*/,
    WheaErrTypeMemory     = 1 /*0x1*/,
    WheaErrTypePCIExpress = 2 /*0x2*/,
    WheaErrTypeNMI        = 3 /*0x3*/,
    WheaErrTypePCIXBus    = 4 /*0x4*/,
    WheaErrTypePCIXDevice = 5 /*0x5*/,
    WheaErrTypeGeneric    = 6 /*0x6*/
}WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef enum _WHEA_EVENT_LOG_ENTRY_ID  // 3 elements, 0x4 bytes
{
    WheaEventLogEntryIdCmcPollingTimeout = -2147483647 /*0x80000001*/,
    WheaEventLogEntryIdWheaInit          = -2147483646 /*0x80000002*/,
    WheaEventLogEntryIdMax               = -2147483645 /*0x80000003*/
}WHEA_EVENT_LOG_ENTRY_ID, *PWHEA_EVENT_LOG_ENTRY_ID;

typedef enum _WHEA_EVENT_LOG_ENTRY_TYPE  // 3 elements, 0x4 bytes
{
    WheaEventLogEntryTypeInformational = 0 /*0x0*/,
    WheaEventLogEntryTypeWarning       = 1 /*0x1*/,
    WheaEventLogEntryTypeError         = 2 /*0x2*/
}WHEA_EVENT_LOG_ENTRY_TYPE, *PWHEA_EVENT_LOG_ENTRY_TYPE;

typedef enum _WORKING_SET_TYPE  // 11 elements, 0x4 bytes
{
    WorkingSetTypeUser           = 0 /*0x0*/,
    WorkingSetTypeSession        = 1 /*0x1*/,
    WorkingSetTypeSystemTypes    = 2 /*0x2*/,
    WorkingSetTypeSystemCache    = 2 /*0x2*/,
    WorkingSetTypePagedPool      = 3 /*0x3*/,
    WorkingSetTypeSystemViews    = 4 /*0x4*/,
    WorkingSetTypePagableMaximum = 4 /*0x4*/,
    WorkingSetTypeSystemPtes     = 5 /*0x5*/,
    WorkingSetTypeKernelStacks   = 6 /*0x6*/,
    WorkingSetTypeNonPagedPool   = 7 /*0x7*/,
    WorkingSetTypeMaximum        = 8 /*0x8*/
}WORKING_SET_TYPE, *PWORKING_SET_TYPE;

typedef enum _WOW64_SHARED_INFORMATION  // 10 elements, 0x4 bytes
{
    SharedNtdll32LdrInitializeThunk                  = 0 /*0x0*/,
    SharedNtdll32KiUserExceptionDispatcher           = 1 /*0x1*/,
    SharedNtdll32KiUserApcDispatcher                 = 2 /*0x2*/,
    SharedNtdll32KiUserCallbackDispatcher            = 3 /*0x3*/,
    SharedNtdll32RtlUserThreadStart                  = 4 /*0x4*/,
    SharedNtdll32pQueryProcessDebugInformationRemote = 5 /*0x5*/,
    SharedNtdll32BaseAddress                         = 6 /*0x6*/,
    SharedNtdll32LdrSystemDllInitBlock               = 7 /*0x7*/,
    SharedNtdll32RtlpFreezeTimeBias                  = 8 /*0x8*/,
    Wow64SharedPageEntriesCount                      = 9 /*0x9*/
}WOW64_SHARED_INFORMATION, *PWOW64_SHARED_INFORMATION;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Information about structure types

typedef struct _ACCESS_REASONS;
typedef struct _ACCESS_STATE;
typedef struct _ACL;
typedef struct _ACTIVATION_CONTEXT;
typedef struct _ACTIVATION_CONTEXT_DATA;
typedef struct _ACTIVATION_CONTEXT_STACK;
typedef struct _ACTIVATION_CONTEXT_STACK32;
typedef struct _ACTIVATION_CONTEXT_STACK64;
typedef struct _ALPC_PROCESS_CONTEXT;
typedef struct _ASSEMBLY_STORAGE_MAP;
typedef struct _AUX_ACCESS_DATA;
typedef struct _BATTERY_REPORTING_SCALE;
typedef struct _CACHE_DESCRIPTOR;
typedef struct _CI_NGEN_PATHS;
typedef struct _CLIENT_ID;
typedef struct _CLIENT_ID32;
typedef struct _CLIENT_ID64;
typedef struct _CM_FULL_RESOURCE_DESCRIPTOR;
typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR;
typedef struct _CM_PARTIAL_RESOURCE_LIST;
typedef struct _CM_RESOURCE_LIST;
typedef struct _COMPRESSED_DATA_INFO;
typedef struct _CONTEXT;
typedef struct _COUNTER_READING;
typedef struct _CURDIR;
typedef struct _CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG;
typedef struct _DBGK_SILOSTATE;
typedef struct _DBGKP_ERROR_PORT;
typedef struct _DEVICE_CAPABILITIES;
typedef struct _DEVICE_MAP;
typedef struct _DEVICE_OBJECT;
typedef struct _DEVICE_OBJECT_POWER_EXTENSION;
typedef struct _DEVOBJ_EXTENSION;
typedef struct _DISPATCHER_HEADER;
typedef struct _DPH_BLOCK_INFORMATION;
typedef struct _DPH_HEAP_BLOCK;
typedef struct _DPH_HEAP_ROOT;
typedef struct _DRIVER_EXTENSION;
typedef struct _DRIVER_OBJECT;
typedef struct _DYNAMIC_FUNCTION_TABLE;
typedef struct _ECP_LIST;
typedef struct _EJOB;
typedef union _ENERGY_STATE_DURATION;
typedef struct _ENODE;
typedef struct _EPROCESS;
typedef struct _EPROCESS_QUOTA_BLOCK;
typedef struct _EPROCESS_VALUES;
typedef struct _ERESOURCE;
typedef struct _ESERVERSILO_GLOBALS;
typedef struct _ETHREAD;
typedef struct _ETW_BUFFER_CONTEXT;
typedef struct _ETW_SILODRIVERSTATE;
typedef struct _EVENT_DATA_DESCRIPTOR;
typedef struct _EVENT_DESCRIPTOR;
typedef struct _EVENT_HEADER;
typedef struct _EVENT_HEADER_EXTENDED_DATA_ITEM;
typedef struct _EVENT_RECORD;
typedef struct _EWOW64PROCESS;
typedef struct _EX_FAST_REF;
typedef struct _EX_PUSH_LOCK;
typedef struct _EX_RUNDOWN_REF;
typedef struct _EXCEPTION_RECORD;
typedef struct _EXCEPTION_REGISTRATION_RECORD;
typedef struct _EXHANDLE;
typedef struct _EXT_DELETE_PARAMETERS;
typedef struct _EXT_SET_PARAMETERS_V0;
typedef struct _FAKE_HEAP_ENTRY;
typedef struct _FAST_IO_DISPATCH;
typedef struct _FAST_MUTEX;
typedef struct _FILE_BASIC_INFORMATION;
typedef struct _FILE_GET_QUOTA_INFORMATION;
typedef struct _FILE_NETWORK_OPEN_INFORMATION;
typedef struct _FILE_OBJECT;
typedef struct _FILE_STANDARD_INFORMATION;
typedef struct _FILESYSTEM_DISK_COUNTERS;
typedef struct _flags;
typedef struct _FLS_CALLBACK_INFO;
typedef struct _FS_FILTER_CALLBACK_DATA;
typedef struct _FS_FILTER_CALLBACKS;
typedef union _FS_FILTER_PARAMETERS;
typedef struct _FS_FILTER_SECTION_SYNC_OUTPUT;
typedef struct _GDI_TEB_BATCH;
typedef struct _GDI_TEB_BATCH32;
typedef struct _GDI_TEB_BATCH64;
typedef struct _GENERAL_LOOKASIDE;
typedef struct _GENERAL_LOOKASIDE_POOL;
typedef struct _GENERIC_MAPPING;
typedef struct _GROUP_AFFINITY;
typedef struct _GUID;
typedef struct _HANDLE_TABLE;
typedef union _HANDLE_TABLE_ENTRY;
typedef struct _HANDLE_TABLE_ENTRY_INFO;
typedef struct _HANDLE_TABLE_FREE_LIST;
typedef struct _HANDLE_TRACE_DB_ENTRY;
typedef struct _HANDLE_TRACE_DEBUG_INFO;
typedef struct _HEAP;
typedef struct _HEAP_BUCKET;
typedef union _HEAP_BUCKET_COUNTERS;
typedef union _HEAP_BUCKET_RUN_INFO;
typedef struct _HEAP_COUNTERS;
typedef struct _HEAP_DESCRIPTOR_KEY;
typedef struct _HEAP_ENTRY;
typedef struct _HEAP_ENTRY_EXTRA;
typedef struct _HEAP_EXTENDED_ENTRY;
typedef struct _HEAP_FAILURE_INFORMATION;
typedef struct _HEAP_FREE_ENTRY;
typedef struct _HEAP_GLOBAL_APPCOMPAT_FLAGS;
typedef struct _HEAP_LARGE_ALLOC_DATA;
typedef struct _HEAP_LFH_AFFINITY_SLOT;
typedef struct _HEAP_LFH_BUCKET;
typedef struct _HEAP_LFH_CONTEXT;
typedef struct _HEAP_LFH_FAST_REF;
typedef struct _HEAP_LFH_MEM_POLICIES;
typedef union _HEAP_LFH_ONDEMAND_POINTER;
typedef struct _HEAP_LFH_SUBSEGMENT;
typedef union _HEAP_LFH_SUBSEGMENT_DELAY_FREE;
typedef struct _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS;
typedef struct _HEAP_LFH_SUBSEGMENT_OWNER;
typedef struct _HEAP_LFH_SUBSEGMENT_STAT;
typedef union _HEAP_LFH_SUBSEGMENT_STATS;
typedef struct _HEAP_LFH_UNUSED_BYTES_INFO;
typedef struct _HEAP_LIST_LOOKUP;
typedef struct _HEAP_LOCAL_DATA;
typedef struct _HEAP_LOCAL_SEGMENT_INFO;
typedef struct _HEAP_LOCK;
typedef struct _HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS;
typedef struct _HEAP_PAGE_RANGE_DESCRIPTOR;
typedef union _HEAP_PAGE_SEGMENT;
typedef struct _HEAP_PSEUDO_TAG_ENTRY;
typedef struct _HEAP_RUNTIME_MEMORY_STATS;
typedef struct _HEAP_SEG_CONTEXT;
typedef struct _HEAP_SEGMENT;
typedef union _HEAP_SEGMENT_MGR_COMMIT_STATE;
typedef struct _HEAP_SUBALLOCATOR_CALLBACKS;
typedef struct _HEAP_SUBSEGMENT;
typedef struct _HEAP_TAG_ENTRY;
typedef struct _HEAP_TUNING_PARAMETERS;
typedef struct _HEAP_UCR_DESCRIPTOR;
typedef struct _HEAP_UNPACKED_ENTRY;
typedef struct _HEAP_USERDATA_HEADER;
typedef struct _HEAP_USERDATA_OFFSETS;
typedef struct _HEAP_VAMGR_ALLOCATOR;
typedef struct _HEAP_VAMGR_CTX;
typedef struct _HEAP_VAMGR_RANGE;
typedef struct _HEAP_VAMGR_VASPACE;
typedef struct _HEAP_VIRTUAL_ALLOC_ENTRY;
typedef struct _HEAP_VS_CHUNK_FREE_HEADER;
typedef struct _HEAP_VS_CHUNK_HEADER;
typedef union _HEAP_VS_CHUNK_HEADER_SIZE;
typedef struct _HEAP_VS_CONTEXT;
typedef struct _HEAP_VS_SUBSEGMENT;
typedef struct _HEAP_VS_UNUSED_BYTES_INFO;
typedef struct _IMAGE_DATA_DIRECTORY;
typedef struct _IMAGE_DOS_HEADER;
typedef struct _IMAGE_FILE_HEADER;
typedef struct _IMAGE_NT_HEADERS64;
typedef struct _IMAGE_OPTIONAL_HEADER64;
typedef struct _IMAGE_RUNTIME_FUNCTION_ENTRY;
typedef struct _INITIAL_PRIVILEGE_SET;
typedef struct _INTERFACE;
typedef struct _INTERLOCK_SEQ;
typedef struct _INVERTED_FUNCTION_TABLE;
typedef struct _INVERTED_FUNCTION_TABLE_ENTRY;
typedef union _INVPCID_DESCRIPTOR;
typedef struct _IO_CLIENT_EXTENSION;
typedef struct _IO_COMPLETION_CONTEXT;
typedef struct _IO_DRIVER_CREATE_CONTEXT;
typedef struct _IO_MINI_COMPLETION_PACKET_USER;
typedef struct _IO_PRIORITY_INFO;
typedef struct _IO_RESOURCE_DESCRIPTOR;
typedef struct _IO_RESOURCE_LIST;
typedef struct _IO_RESOURCE_REQUIREMENTS_LIST;
typedef struct _IO_SECURITY_CONTEXT;
typedef struct _IO_STACK_LOCATION;
typedef struct _IO_STATUS_BLOCK;
typedef struct _IO_TIMER;
typedef struct _IOP_IRP_STACK_PROFILER;
typedef struct _IRP;
typedef struct _JOB_ACCESS_STATE;
typedef struct _JOB_CPU_RATE_CONTROL;
typedef struct _JOB_NET_RATE_CONTROL;
typedef struct _JOB_NOTIFICATION_INFORMATION;
typedef struct _JOB_RATE_CONTROL_HEADER;
typedef union _JOBOBJECT_ENERGY_TRACKING_STATE;
typedef struct _JOBOBJECT_WAKE_FILTER;
typedef struct _KAFFINITY_EX;
typedef struct _KAPC;
typedef struct _KAPC_STATE;
typedef struct _KDESCRIPTOR;
typedef struct _KDEVICE_QUEUE;
typedef struct _KDEVICE_QUEUE_ENTRY;
typedef struct _KDPC;
typedef struct _KDPC_DATA;
typedef struct _KDPC_LIST;
typedef struct _KENTROPY_TIMING_STATE;
typedef struct _KERNEL_STACK_SEGMENT;
typedef struct _KEVENT;
typedef struct _KEXCEPTION_FRAME;
typedef union _KEXECUTE_OPTIONS;
typedef struct _KFLOATING_SAVE;
typedef struct _KGATE;
typedef union _KGDTENTRY64;
typedef struct _KHETERO_PROCESSOR_SET;
typedef union _KIDTENTRY64;
typedef struct _KLOCK_ENTRY;
typedef union _KLOCK_ENTRY_BOOST_BITMAP;
typedef struct _KLOCK_ENTRY_LOCK_STATE;
typedef struct _KLOCK_QUEUE_HANDLE;
typedef struct _KNODE;
typedef struct _KPCR;
typedef struct _KPRCB;
typedef union _KPRCBFLAG;
typedef struct _KPROCESS;
typedef struct _KPROCESSOR_STATE;
typedef struct _KQUEUE;
typedef struct _KREQUEST_PACKET;
typedef struct _KSCB;
typedef struct _KSCHEDULING_GROUP;
typedef struct _KSCHEDULING_GROUP_POLICY;
typedef struct _KSECURE_FAULT_INFORMATION;
typedef struct _KSEMAPHORE;
typedef struct _KSHARED_READY_QUEUE;
typedef struct _KSPECIAL_REGISTERS;
typedef struct _KSPIN_LOCK_QUEUE;
typedef struct _KSTACK_CONTROL;
typedef union _KSTACK_COUNT;
typedef struct _KSYSTEM_TIME;
typedef struct _KTHREAD;
typedef struct _KTHREAD_COUNTERS;
typedef struct _KTIMER;
typedef struct _KTIMER_EXPIRATION_TRACE;
typedef struct _KTIMER_TABLE;
typedef struct _KTIMER_TABLE_ENTRY;
typedef struct _KTRAP_FRAME;
typedef struct _KTSS64;
typedef struct _KUMS_CONTEXT_HEADER;
typedef struct _KUSER_SHARED_DATA;
typedef struct _KWAIT_BLOCK;
typedef union _KWAIT_STATUS_REGISTER;
typedef union _LARGE_INTEGER;
typedef struct _LDR_DATA_TABLE_ENTRY;
typedef struct _LDR_DDAG_NODE;
typedef struct _LDR_SERVICE_TAG_RECORD;
typedef struct _LDRP_CSLIST;
typedef struct _LDRP_LOAD_CONTEXT;
typedef struct _LEAP_SECOND_DATA;
typedef struct _LFH_BLOCK_ZONE;
typedef struct _LFH_HEAP;
typedef union _LFH_RANDOM_DATA;
typedef struct _LIST_ENTRY;
typedef struct _LIST_ENTRY32;
typedef struct _LIST_ENTRY64;
typedef struct _LOOKASIDE_LIST_EX;
typedef struct _LUID;
typedef struct _LUID_AND_ATTRIBUTES;
typedef struct _M128A;
typedef struct _MACHINE_CHECK_CONTEXT;
typedef struct _MACHINE_FRAME;
typedef struct _MAILSLOT_CREATE_PARAMETERS;
typedef struct _MCA_EXCEPTION;
typedef union _MCI_ADDR;
typedef union _MCI_STATS;
typedef struct _MCUPDATE_INFO;
typedef struct _MDL;
typedef struct _MM_DRIVER_VERIFIER_DATA;
typedef struct _MM_PAGE_ACCESS_INFO;
typedef union _MM_PAGE_ACCESS_INFO_FLAGS;
typedef struct _MM_PAGE_ACCESS_INFO_HEADER;
typedef struct _MM_SESSION_SPACE;
typedef struct _MMSUPPORT_FLAGS;
typedef struct _MMSUPPORT_FULL;
typedef struct _MMSUPPORT_INSTANCE;
typedef struct _MMSUPPORT_SHARED;
typedef struct _MMWSL_INSTANCE;
typedef struct _NAMED_PIPE_CREATE_PARAMETERS;
typedef struct _NPAGED_LOOKASIDE_LIST;
typedef struct _NT_TIB;
typedef struct _NT_TIB32;
typedef struct _NT_TIB64;
typedef struct _OB_EXTENDED_PARSE_PARAMETERS;
typedef struct _OBJECT_DIRECTORY;
typedef struct _OBJECT_DIRECTORY_ENTRY;
typedef struct _OBJECT_DUMP_CONTROL;
typedef struct _OBJECT_HANDLE_INFORMATION;
typedef struct _OBJECT_NAME_INFORMATION;
typedef struct _OBJECT_NAMESPACE_LOOKUPTABLE;
typedef struct _OBJECT_TYPE;
typedef struct _OBJECT_TYPE_INITIALIZER;
typedef struct _OBP_SILODRIVERSTATE;
typedef struct _OBP_SYSTEM_DOS_DEVICE_STATE;
typedef struct _OWNER_ENTRY;
typedef struct _PAGED_LOOKASIDE_LIST;
typedef struct _PAGEFAULT_HISTORY;
typedef struct _PEB;
typedef struct _PEB_LDR_DATA;
typedef struct _PEB32;
typedef struct _PEBS_DS_SAVE_AREA;
typedef struct _PERF_CONTROL_STATE_SELECTION;
typedef struct _PERFINFO_GROUPMASK;
typedef struct _PERFINFO_PPM_STATE_SELECTION;
typedef struct _PF_KERNEL_GLOBALS;
typedef struct _PO_DIAG_STACK_RECORD;
typedef struct _PO_PROCESS_ENERGY_CONTEXT;
typedef struct _POP_FX_DEVICE;
typedef struct _POWER_SEQUENCE;
typedef union _POWER_STATE;
typedef struct _PP_LOOKASIDE_LIST;
typedef struct _PPM_CONCURRENCY_ACCOUNTING;
typedef struct _PPM_COORDINATED_SELECTION;
typedef struct _PPM_FFH_THROTTLE_STATE_INFO;
typedef struct _PPM_IDLE_STATE;
typedef struct _PPM_IDLE_STATES;
typedef union _PPM_IDLE_SYNCHRONIZATION_STATE;
typedef struct _PPM_SELECTION_DEPENDENCY;
typedef struct _PPM_SELECTION_MENU;
typedef struct _PPM_SELECTION_MENU_ENTRY;
typedef struct _PPM_SELECTION_STATISTICS;
typedef struct _PPM_VETO_ACCOUNTING;
typedef struct _PPM_VETO_ENTRY;
typedef struct _PRIVILEGE_SET;
typedef struct _PROC_FEEDBACK;
typedef struct _PROC_FEEDBACK_COUNTER;
typedef struct _PROC_IDLE_ACCOUNTING;
typedef struct _PROC_IDLE_POLICY;
typedef struct _PROC_IDLE_SNAP;
typedef struct _PROC_IDLE_STATE_ACCOUNTING;
typedef struct _PROC_IDLE_STATE_BUCKET;
typedef struct _PROC_PERF_CHECK;
typedef struct _PROC_PERF_CHECK_SNAP;
typedef struct _PROC_PERF_CONSTRAINT;
typedef struct _PROC_PERF_DOMAIN;
typedef struct _PROC_PERF_HISTORY;
typedef struct _PROC_PERF_HISTORY_ENTRY;
typedef struct _PROC_PERF_LOAD;
typedef struct _PROC_PERF_QOS_CLASS_POLICY;
typedef struct _PROCESS_DISK_COUNTERS;
typedef struct _PROCESS_ENERGY_VALUES;
typedef struct _PROCESS_ENERGY_VALUES_EXTENSION;
typedef struct _PROCESS_EXTENDED_ENERGY_VALUES;
typedef struct _PROCESSOR_IDLE_CONSTRAINTS;
typedef struct _PROCESSOR_IDLE_DEPENDENCY;
typedef struct _PROCESSOR_IDLE_PREPARE_INFO;
typedef struct _PROCESSOR_NUMBER;
typedef struct _PROCESSOR_POWER_STATE;
typedef struct _PROCESSOR_PROFILE_CONTROL_AREA;
typedef union _PS_CLIENT_SECURITY_CONTEXT;
typedef union _PS_INTERLOCKED_TIMER_DELAY_VALUES;
typedef struct _PS_IO_CONTROL_ENTRY;
typedef struct _PS_JOB_WAKE_INFORMATION;
typedef struct _PS_MITIGATION_AUDIT_OPTIONS_MAP;
typedef struct _PS_MITIGATION_OPTIONS_MAP;
typedef struct _PS_PROCESS_WAKE_INFORMATION;
typedef struct _PS_PROPERTY_SET;
typedef struct _PS_PROTECTION;
typedef union _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS;
typedef struct _PS_TRUSTLET_ATTRIBUTE_DATA;
typedef struct _PS_TRUSTLET_ATTRIBUTE_HEADER;
typedef struct _PS_TRUSTLET_ATTRIBUTE_TYPE;
typedef struct _PS_TRUSTLET_CREATE_ATTRIBUTES;
typedef struct _PS_TRUSTLET_TKSESSION_ID;
typedef struct _PSP_STORAGE;
typedef struct _QUAD;
typedef struct _REQUEST_MAILBOX;
typedef struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME;
typedef struct _RTL_AVL_TABLE;
typedef struct _RTL_AVL_TREE;
typedef struct _RTL_BALANCED_LINKS;
typedef struct _RTL_BALANCED_NODE;
typedef struct _RTL_BITMAP;
typedef struct _RTL_BITMAP_EX;
typedef struct _RTL_CHASH_ENTRY;
typedef struct _RTL_CHASH_TABLE;
typedef struct _RTL_CRITICAL_SECTION;
typedef struct _RTL_CRITICAL_SECTION_DEBUG;
typedef struct _RTL_CSPARSE_BITMAP;
typedef struct _RTL_DRIVE_LETTER_CURDIR;
typedef struct _RTL_DYNAMIC_HASH_TABLE;
typedef struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENTRY;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR;
typedef struct _RTL_HASH_ENTRY;
typedef struct _RTL_HASH_TABLE;
typedef struct _RTL_HASH_TABLE_ITERATOR;
typedef struct _RTL_HEAP_MEMORY_LIMIT_DATA;
typedef struct _RTL_HP_ENV_HANDLE;
typedef struct _RTL_HP_LFH_CONFIG;
typedef struct _RTL_HP_SEG_ALLOC_POLICY;
typedef struct _RTL_HP_SUB_ALLOCATOR_CONFIGS;
typedef struct _RTL_HP_VS_CONFIG;
typedef struct _RTL_RB_TREE;
typedef union _RTL_RUN_ONCE;
typedef struct _RTL_SPARSE_ARRAY;
typedef struct _RTL_SPLAY_LINKS;
typedef struct _RTL_SRWLOCK;
typedef struct _RTL_STACK_DATABASE_LOCK;
typedef struct _RTL_STACK_TRACE_ENTRY;
typedef struct _RTL_STACKDB_CONTEXT;
typedef struct _RTL_STD_LIST_ENTRY;
typedef struct _RTL_STD_LIST_HEAD;
typedef struct _RTL_TRACE_BLOCK;
typedef struct _RTL_TRACE_DATABASE;
typedef struct _RTL_TRACE_SEGMENT;
typedef struct _RTL_UMS_CONTEXT;
typedef struct _RTL_USER_PROCESS_PARAMETERS;
typedef struct _RTLP_HP_ALLOC_TRACKER;
typedef struct _RTLP_HP_HEAP_GLOBALS;
typedef struct _RTLP_HP_HEAP_MANAGER;
typedef union _RTLP_HP_LFH_PERF_FLAGS;
typedef struct _RTLP_HP_METADATA_HEAP_CTX;
typedef struct _RTLP_HP_PADDING_HEADER;
typedef struct _SCSI_REQUEST_BLOCK;
typedef struct _SE_AUDIT_PROCESS_CREATION_INFO;
typedef struct _SECTION_OBJECT_POINTERS;
typedef struct _SECURITY_DESCRIPTOR;
typedef struct _SECURITY_QUALITY_OF_SERVICE;
typedef struct _SECURITY_SUBJECT_CONTEXT;
typedef struct _SEGMENT_HEAP;
typedef struct _SEGMENT_HEAP_EXTRA;
typedef struct _SEP_LOGON_SESSION_REFERENCES;
typedef struct _SEP_RM_LSA_CONNECTION_STATE;
typedef struct _SEP_SILOSTATE;
typedef struct _SID;
typedef struct _SID_IDENTIFIER_AUTHORITY;
typedef struct _SILO_USER_SHARED_DATA;
typedef struct _SINGLE_LIST_ENTRY;
typedef struct _SINGLE_LIST_ENTRY32;
typedef struct _SLIST_ENTRY;
typedef union _SLIST_HEADER;
typedef struct _STACK_TRACE_DATABASE;
typedef struct _STRING;
typedef struct _STRING32;
typedef struct _STRING64;
typedef struct _SYNCH_COUNTERS;
typedef struct _SYSTEM_POWER_CAPABILITIES;
typedef struct _SYSTEM_POWER_STATE_CONTEXT;
typedef struct _TEB;
typedef struct _TEB_ACTIVE_FRAME;
typedef struct _TEB_ACTIVE_FRAME_CONTEXT;
typedef struct _TEB32;
typedef struct _TEB64;
typedef struct _TERMINATION_PORT;
typedef struct _THREAD_ENERGY_VALUES;
typedef struct _THREAD_PERFORMANCE_DATA;
typedef union _TIMELINE_BITMAP;
typedef struct _TP_CALLBACK_ENVIRON_V3;
typedef struct _TP_CALLBACK_INSTANCE;
typedef struct _TP_CLEANUP_GROUP;
typedef struct _TP_POOL;
typedef struct _TRUSTLET_COLLABORATION_ID;
typedef struct _TRUSTLET_MAILBOX_KEY;
typedef struct _TXN_PARAMETER_BLOCK;
typedef union _ULARGE_INTEGER;
typedef struct _UMS_CONTROL_BLOCK;
typedef struct _UNICODE_STRING;
typedef struct _USER_MEMORY_CACHE_ENTRY;
typedef struct _VPB;
typedef struct _WAIT_CONTEXT_BLOCK;
typedef union _WHEA_ERROR_PACKET_FLAGS;
typedef struct _WHEA_ERROR_PACKET_V2;
typedef struct _WHEA_ERROR_RECORD;
typedef struct _WHEA_ERROR_RECORD_HEADER;
typedef union _WHEA_ERROR_RECORD_HEADER_FLAGS;
typedef union _WHEA_ERROR_RECORD_HEADER_VALIDBITS;
typedef struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;
typedef struct _WHEA_EVENT_LOG_ENTRY;
typedef union _WHEA_EVENT_LOG_ENTRY_FLAGS;
typedef struct _WHEA_EVENT_LOG_ENTRY_HEADER;
typedef union _WHEA_PERSISTENCE_INFO;
typedef union _WHEA_REVISION;
typedef union _WHEA_TIMESTAMP;
typedef struct _WNF_LOCK;
typedef struct _WNF_SCOPE_MAP;
typedef struct _WNF_SILODRIVERSTATE;
typedef struct _WNF_STATE_NAME;
typedef struct _WORK_QUEUE_ITEM;
typedef struct _XSAVE_AREA;
typedef struct _XSAVE_AREA_HEADER;
typedef struct _XSAVE_FORMAT;
typedef struct _XSTATE_CONFIGURATION;
typedef struct _XSTATE_CONTEXT;
typedef struct _XSTATE_FEATURE;
typedef struct _XSTATE_SAVE;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Function types

typedef VOID (NEAR CDECL FUNCT_00EF_00EE_CleanupGroupCancelCallback_DeRefSecurityDescriptor_Free) (UINT64 /*VOID**/, UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_00F6_FinalizationCallback) (UINT64 /*struct _TP_CALLBACK_INSTANCE**/, UINT64 /*VOID**/);
typedef enum _EXCEPTION_DISPOSITION (NEAR CDECL FUNCT_0198_0197_Handler) (UINT64 /*struct _EXCEPTION_RECORD**/, UINT64 /*VOID**/, UINT64 /*struct _CONTEXT**/, UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_02EA_PostProcessInitRoutine) ();
typedef VOID (NEAR CDECL FUNCT_00EF_0672_DeferredRoutine) (UINT64 /*struct _KDPC**/, UINT64 /*VOID**/, UINT64 /*VOID**/, UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_0812_NormalRoutine) (UINT64 /*VOID**/, UINT64 /*VOID**/, UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_0809_KernelRoutine) (UINT64 /*struct _KAPC**/, UINT64 /*FUNCT_00EF_0812_NormalRoutine***/, UINT64 /*VOID***/, UINT64 /*VOID***/, UINT64 /*VOID***/);
typedef VOID (NEAR CDECL FUNCT_00EF_0812_NormalRoutine) (UINT64 /*VOID**/, UINT64 /*VOID**/, UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_0817_RundownRoutine) (UINT64 /*struct _KAPC**/);
typedef UINT64 /*VOID**/ (NEAR CDECL FUNCT_00F2_08E3_AllocateEx) (enum _POOL_TYPE, UINT64, ULONG32, UINT64 /*struct _LOOKASIDE_LIST_EX**/);
typedef UINT64 /*VOID**/ (NEAR CDECL FUNCT_00F2_08ED_Allocate) (enum _POOL_TYPE, UINT64, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00EF_08F2_FreeEx) (UINT64 /*VOID**/, UINT64 /*struct _LOOKASIDE_LIST_EX**/);
typedef VOID (NEAR CDECL FUNCT_00EF_08F6_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure) (UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_097A_IdlePrepare) (UINT64 /*struct _PROCESSOR_IDLE_PREPARE_INFO**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_099B_IdlePreExecute) (UINT64 /*VOID**/, ULONG32, ULONG32, ULONG32, UINT64 /*ULONG32**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_09A2_IdleExecute) (UINT64 /*VOID**/, UINT64, ULONG32, ULONG32, ULONG32, ULONG32, UINT64 /*ULONG32**/);
typedef ULONG32 (NEAR CDECL FUNCT_0009_09AB_IdlePreselect) (UINT64 /*VOID**/, UINT64 /*struct _PROCESSOR_IDLE_CONSTRAINTS**/);
typedef ULONG32 (NEAR CDECL FUNCT_0009_09B0_IdleTest) (UINT64 /*VOID**/, ULONG32, ULONG32);
typedef ULONG32 (NEAR CDECL FUNCT_0009_09B5_IdleAvailabilityCheck) (UINT64 /*VOID**/, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00EF_09B9_IdleComplete) (UINT64 /*VOID**/, ULONG32, ULONG32, ULONG32, UINT64 /*ULONG32**/);
typedef VOID (NEAR CDECL FUNCT_00EF_09BB_IdleCancel) (UINT64 /*VOID**/, ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_00A9_09BD_IdleIsHalted_IdleInitiateWake) (UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_0A56_InstantaneousRead) (UINT64, UINT64 /*ULONG32**/);
typedef VOID (NEAR CDECL FUNCT_00EF_0A5A_DifferentialRead) (UINT64, UINT8, UINT64 /*UINT64**/, UINT64 /*UINT64**/);
typedef VOID (NEAR CDECL FUNCT_00EF_0ADC_GetFFHThrottleState) (UINT64 /*UINT64**/);
typedef VOID (NEAR CDECL FUNCT_00EF_0ADF_TimeWindowHandler_BoostPolicyHandler_BoostModeHandler_AutonomousActivityWindowHandler_AutonomousModeHandler) (UINT64, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00EF_0AE3_ReinitializeHandler) (UINT64);
typedef ULONG32 (NEAR CDECL FUNCT_0009_0AE6_PerfSelectionHandler) (UINT64, ULONG32, ULONG32, ULONG32, ULONG32, ULONG32, ULONG32, UINT64 /*ULONG32**/, UINT64 /*UINT64**/);
typedef VOID (NEAR CDECL FUNCT_00EF_0AF1_PerfControlHandler_DomainPerfControlHandler) (UINT64, UINT64 /*struct _PERF_CONTROL_STATE_SELECTION**/, UINT8, UINT8);
typedef VOID (NEAR CDECL FUNCT_00EF_0BB5_WorkerRoutine) (UINT64 /*VOID**/, UINT64 /*VOID**/, UINT64 /*VOID**/, UINT64 /*VOID**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_0E38_AddDevice) (UINT64 /*struct _DRIVER_OBJECT**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_0E52_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter_PreQueryOpen) (UINT64 /*struct _FS_FILTER_CALLBACK_DATA**/, UINT64 /*VOID***/);
typedef VOID (NEAR CDECL FUNCT_00EF_0F06_UserApcRoutine) (UINT64 /*VOID**/, UINT64 /*struct _IO_STATUS_BLOCK**/, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00EF_0F0B_DriverStartIo_CancelRoutine) (UINT64 /*struct _DEVICE_OBJECT**/, UINT64 /*struct _IRP**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_11D0_CompletionRoutine) (UINT64 /*struct _DEVICE_OBJECT**/, UINT64 /*struct _IRP**/, UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_11DB_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter_PostQueryOpen) (UINT64 /*struct _FS_FILTER_CALLBACK_DATA**/, LONG32, UINT64 /*VOID**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_11FE_FastIoCheckIfPossible) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*union _LARGE_INTEGER**/, ULONG32, UINT8, ULONG32, UINT8, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1208_FastIoRead_FastIoWrite) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*union _LARGE_INTEGER**/, ULONG32, UINT8, ULONG32, UINT64 /*VOID**/, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1212_FastIoQueryBasicInfo) (UINT64 /*struct _FILE_OBJECT**/, UINT8, UINT64 /*struct _FILE_BASIC_INFORMATION**/, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1220_FastIoQueryStandardInfo) (UINT64 /*struct _FILE_OBJECT**/, UINT8, UINT64 /*struct _FILE_STANDARD_INFORMATION**/, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_122E_FastIoLock) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*union _LARGE_INTEGER**/, UINT64 /*union _LARGE_INTEGER**/, UINT64 /*struct _EPROCESS**/, ULONG32, UINT8, UINT8, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1239_FastIoUnlockSingle) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*union _LARGE_INTEGER**/, UINT64 /*union _LARGE_INTEGER**/, UINT64 /*struct _EPROCESS**/, ULONG32, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1242_FastIoUnlockAll) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*struct _EPROCESS**/, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1248_FastIoUnlockAllByKey) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*VOID**/, ULONG32, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_124F_FastIoDeviceControl) (UINT64 /*struct _FILE_OBJECT**/, UINT8, UINT64 /*VOID**/, ULONG32, UINT64 /*VOID**/, ULONG32, ULONG32, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef VOID (NEAR CDECL FUNCT_00EF_125A_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection) (UINT64 /*struct _FILE_OBJECT**/);
typedef VOID (NEAR CDECL FUNCT_00EF_125D_FastIoDetachDevice) (UINT64 /*struct _DEVICE_OBJECT**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1261_FastIoQueryNetworkOpenInfo) (UINT64 /*struct _FILE_OBJECT**/, UINT8, UINT64 /*struct _FILE_NETWORK_OPEN_INFORMATION**/, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_1271_AcquireForModWrite) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*union _LARGE_INTEGER**/, UINT64 /*struct _ERESOURCE***/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1277_MdlRead_PrepareMdlWrite) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*union _LARGE_INTEGER**/, ULONG32, ULONG32, UINT64 /*struct _MDL***/, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1281_MdlReadComplete_MdlReadCompleteCompressed) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*struct _MDL**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_1286_MdlWriteComplete_MdlWriteCompleteCompressed) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*union _LARGE_INTEGER**/, UINT64 /*struct _MDL**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_128C_FastIoReadCompressed_FastIoWriteCompressed) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*union _LARGE_INTEGER**/, ULONG32, ULONG32, UINT64 /*VOID**/, UINT64 /*struct _MDL***/, UINT64 /*struct _IO_STATUS_BLOCK**/, UINT64 /*struct _COMPRESSED_DATA_INFO**/, ULONG32, UINT64 /*struct _DEVICE_OBJECT**/);
typedef UINT8 (NEAR CDECL FUNCT_00A9_12A1_FastIoQueryOpen) (UINT64 /*struct _IRP**/, UINT64 /*struct _FILE_NETWORK_OPEN_INFORMATION**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_12A6_ReleaseForModWrite) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*struct _ERESOURCE**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_12AB_AcquireForCcFlush_ReleaseForCcFlush) (UINT64 /*struct _FILE_OBJECT**/, UINT64 /*struct _DEVICE_OBJECT**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_12AF_DriverInit) (UINT64 /*struct _DRIVER_OBJECT**/, UINT64 /*struct _UNICODE_STRING**/);
typedef VOID (NEAR CDECL FUNCT_00EF_12B3_DriverUnload) (UINT64 /*struct _DRIVER_OBJECT**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_12B7_MajorFunction) (UINT64 /*struct _DEVICE_OBJECT**/, UINT64 /*struct _IRP**/);
typedef VOID (NEAR CDECL FUNCT_00EF_12C1_TimerRoutine) (UINT64 /*struct _DEVICE_OBJECT**/, UINT64 /*VOID**/);
typedef enum _IO_ALLOCATION_ACTION (NEAR CDECL FUNCT_12D8_12D7_DeviceRoutine) (UINT64 /*struct _DEVICE_OBJECT**/, UINT64 /*struct _IRP**/, UINT64 /*VOID**/, UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_13C2_MiniPacketCallback) (UINT64 /*struct _IO_MINI_COMPLETION_PACKET_USER**/, UINT64 /*VOID**/);
typedef UINT64 /*struct _IMAGE_RUNTIME_FUNCTION_ENTRY**/ (NEAR CDECL FUNCT_1507_151C_Callback) (UINT64, UINT64 /*VOID**/);
typedef VOID (NEAR CDECL FUNCT_00EF_15EA_DumpProcedure) (UINT64 /*VOID**/, UINT64 /*struct _OBJECT_DUMP_CONTROL**/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_15F2_OpenProcedure) (enum _OB_OPEN_REASON, CHAR, UINT64 /*struct _EPROCESS**/, UINT64 /*VOID**/, UINT64 /*ULONG32**/, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00EF_1600_CloseProcedure) (UINT64 /*struct _EPROCESS**/, UINT64 /*VOID**/, UINT64, UINT64);
typedef LONG32 (NEAR CDECL FUNCT_00A0_1606_ParseProcedure) (UINT64 /*VOID**/, UINT64 /*VOID**/, UINT64 /*struct _ACCESS_STATE**/, CHAR, ULONG32, UINT64 /*struct _UNICODE_STRING**/, UINT64 /*struct _UNICODE_STRING**/, UINT64 /*VOID**/, UINT64 /*struct _SECURITY_QUALITY_OF_SERVICE**/, UINT64 /*VOID***/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_1612_ParseProcedureEx) (UINT64 /*VOID**/, UINT64 /*VOID**/, UINT64 /*struct _ACCESS_STATE**/, CHAR, ULONG32, UINT64 /*struct _UNICODE_STRING**/, UINT64 /*struct _UNICODE_STRING**/, UINT64 /*VOID**/, UINT64 /*struct _SECURITY_QUALITY_OF_SERVICE**/, UINT64 /*struct _OB_EXTENDED_PARSE_PARAMETERS**/, UINT64 /*VOID***/);
typedef LONG32 (NEAR CDECL FUNCT_00A0_1624_SecurityProcedure) (UINT64 /*VOID**/, enum _SECURITY_OPERATION_CODE, UINT64 /*ULONG32**/, UINT64 /*VOID**/, UINT64 /*ULONG32**/, UINT64 /*VOID***/, enum _POOL_TYPE, UINT64 /*struct _GENERIC_MAPPING**/, CHAR);
typedef LONG32 (NEAR CDECL FUNCT_00A0_1635_QueryNameProcedure) (UINT64 /*VOID**/, UINT8, UINT64 /*struct _OBJECT_NAME_INFORMATION**/, ULONG32, UINT64 /*ULONG32**/, CHAR);
typedef UINT8 (NEAR CDECL FUNCT_00A9_163D_OkayToCloseProcedure) (UINT64 /*struct _EPROCESS**/, UINT64 /*VOID**/, UINT64 /*VOID**/, CHAR);
typedef LONG32 (NEAR CDECL FUNCT_00A0_1969_CommitRoutine) (UINT64 /*VOID**/, UINT64 /*VOID***/, UINT64 /*UINT64**/);
typedef UINT64 /*VOID**/ (NEAR CDECL FUNCT_00F2_1AC9_Allocate) (UINT64, UINT64 /*VOID**/);
typedef ULONG32 (NEAR CDECL FUNCT_0009_1D6C_HashFunction) (ULONG32, UINT64 /*VOID***/);
typedef enum _RTL_GENERIC_COMPARE_RESULTS (NEAR CDECL FUNCT_2002_2001_CompareRoutine) (UINT64 /*struct _RTL_AVL_TABLE**/, UINT64 /*VOID**/, UINT64 /*VOID**/);
typedef UINT64 /*VOID**/ (NEAR CDECL FUNCT_00F2_200B_AllocateRoutine) (UINT64 /*struct _RTL_AVL_TABLE**/, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00EF_200F_FreeRoutine) (UINT64 /*struct _RTL_AVL_TABLE**/, UINT64 /*VOID**/);

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Structure types

          typedef struct _ACCESS_REASONS // 1 elements, 0x80 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      Data[32];                                        
          }ACCESS_REASONS, *PACCESS_REASONS;                                   
                                                                            
          typedef struct _LUID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     ULONG32      LowPart;                                    
/*0x004*/     LONG32       HighPart;                                   
          }LUID, *PLUID;                                               
                                                                       
          typedef struct _SECURITY_SUBJECT_CONTEXT                   // 4 elements, 0x20 bytes (sizeof) 
          {                                                                                             
/*0x000*/     UINT64       ClientToken;                              // VOID*                           
/*0x008*/     enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                                    
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                             
/*0x010*/     UINT64       PrimaryToken;                             // VOID*                           
/*0x018*/     UINT64       ProcessAuditId;                           // VOID*                           
          }SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT;                                        
                                                                                                        
          typedef struct _LUID_AND_ATTRIBUTES // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _LUID Luid;              // 2 elements, 0x8 bytes (sizeof) 
/*0x008*/     ULONG32      Attributes;                                          
          }LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES;                                  
                                                                                
          typedef struct _INITIAL_PRIVILEGE_SET         // 3 elements, 0x2C bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[3];                                    
          }INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET;                                   
                                                                                           
          typedef struct _PRIVILEGE_SET                 // 3 elements, 0x14 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[1];                                    
          }PRIVILEGE_SET, *PPRIVILEGE_SET;                                                 
                                                                                           
          typedef struct _UNICODE_STRING    // 3 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT16       Length;                                             
/*0x002*/     UINT16       MaximumLength;                                      
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     UINT64       Buffer;          // WCHAR*                          
          }UNICODE_STRING, *PUNICODE_STRING;                                   
                                                                               
          typedef struct _ACCESS_STATE                                 // 16 elements, 0xA0 bytes (sizeof) 
          {                                                                                                
/*0x000*/     struct _LUID OperationID;                                // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     UINT8        SecurityEvaluated;                                                              
/*0x009*/     UINT8        GenerateAudit;                                                                  
/*0x00A*/     UINT8        GenerateOnClose;                                                                
/*0x00B*/     UINT8        PrivilegesAllocated;                                                            
/*0x00C*/     ULONG32      Flags;                                                                          
/*0x010*/     ULONG32      RemainingDesiredAccess;                                                         
/*0x014*/     ULONG32      PreviouslyGrantedAccess;                                                        
/*0x018*/     ULONG32      OriginalDesiredAccess;                                                          
/*0x01C*/     UINT8        _PADDING0_[0x4];                                                                
/*0x020*/     struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext; // 4 elements, 0x20 bytes (sizeof)  
/*0x040*/     UINT64       SecurityDescriptor;                         // VOID*                            
/*0x048*/     UINT64       AuxData;                                    // VOID*                            
              union                                                    // 2 elements, 0x2C bytes (sizeof)  
              {                                                                                            
/*0x050*/         struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;   // 3 elements, 0x2C bytes (sizeof)  
/*0x050*/         struct _PRIVILEGE_SET PrivilegeSet;                  // 3 elements, 0x14 bytes (sizeof)  
              }Privileges;                                                                                 
/*0x07C*/     UINT8        AuditPrivileges;                                                                
/*0x07D*/     UINT8        _PADDING1_[0x3];                                                                
/*0x080*/     struct _UNICODE_STRING ObjectName;                       // 3 elements, 0x10 bytes (sizeof)  
/*0x090*/     struct _UNICODE_STRING ObjectTypeName;                   // 3 elements, 0x10 bytes (sizeof)  
          }ACCESS_STATE, *PACCESS_STATE;                                                                   
                                                                                                           
          typedef struct _ACL           // 5 elements, 0x8 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT8        AclRevision;                                   
/*0x001*/     UINT8        Sbz1;                                          
/*0x002*/     UINT16       AclSize;                                       
/*0x004*/     UINT16       AceCount;                                      
/*0x006*/     UINT16       Sbz2;                                          
          }ACL, *PACL;                                                    
                                                                          
typedef struct _ACTIVATION_CONTEXT // 0 elements, 0x0 bytes (sizeof) 
{                                                                    
}ACTIVATION_CONTEXT, *PACTIVATION_CONTEXT;                                  
                                                                     
typedef struct _ACTIVATION_CONTEXT_DATA // 0 elements, 0x0 bytes (sizeof) 
{                                                                         
}ACTIVATION_CONTEXT_DATA, *PACTIVATION_CONTEXT_DATA;                                  
                                                                          
          typedef struct _LIST_ENTRY // 2 elements, 0x10 bytes (sizeof) 
          {                                                             
/*0x000*/     UINT64       Flink;    // struct _LIST_ENTRY*             
/*0x008*/     UINT64       Blink;    // struct _LIST_ENTRY*             
          }LIST_ENTRY, *PLIST_ENTRY;                                    
                                                                        
          typedef struct _ACTIVATION_CONTEXT_STACK   // 5 elements, 0x28 bytes (sizeof)             
          {                                                                                         
/*0x000*/     UINT64       ActiveFrame;              // struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* 
/*0x008*/     struct _LIST_ENTRY FrameListCache;     // 2 elements, 0x10 bytes (sizeof)             
/*0x018*/     ULONG32      Flags;                                                                   
/*0x01C*/     ULONG32      NextCookieSequenceNumber;                                                
/*0x020*/     ULONG32      StackId;                                                                 
/*0x024*/     UINT8        _PADDING0_[0x4];                                                         
          }ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK;                                               
                                                                                                    
          typedef struct _LIST_ENTRY32 // 2 elements, 0x8 bytes (sizeof) 
          {                                                              
/*0x000*/     ULONG32      Flink;                                        
/*0x004*/     ULONG32      Blink;                                        
          }LIST_ENTRY32, *PLIST_ENTRY32;                                  
                                                                         
          typedef struct _ACTIVATION_CONTEXT_STACK32 // 5 elements, 0x18 bytes (sizeof) 
          {                                                                             
/*0x000*/     ULONG32      ActiveFrame;                                                 
/*0x004*/     struct _LIST_ENTRY32 FrameListCache;   // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     ULONG32      Flags;                                                       
/*0x010*/     ULONG32      NextCookieSequenceNumber;                                    
/*0x014*/     ULONG32      StackId;                                                     
          }ACTIVATION_CONTEXT_STACK32, *PACTIVATION_CONTEXT_STACK32;                                   
                                                                                        
          typedef struct _LIST_ENTRY64 // 2 elements, 0x10 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT64       Flink;                                         
/*0x008*/     UINT64       Blink;                                         
          }LIST_ENTRY64, *PLIST_ENTRY64;                                   
                                                                          
          typedef struct _ACTIVATION_CONTEXT_STACK64 // 5 elements, 0x28 bytes (sizeof) 
          {                                                                             
/*0x000*/     UINT64       ActiveFrame;                                                 
/*0x008*/     struct _LIST_ENTRY64 FrameListCache;   // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     ULONG32      Flags;                                                       
/*0x01C*/     ULONG32      NextCookieSequenceNumber;                                    
/*0x020*/     ULONG32      StackId;                                                     
/*0x024*/     UINT8        _PADDING0_[0x4];                                             
          }ACTIVATION_CONTEXT_STACK64, *PACTIVATION_CONTEXT_STACK64;                                   
                                                                                        
          typedef struct _EX_PUSH_LOCK                 // 7 elements, 0x8 bytes (sizeof) 
          {                                                                              
              union                                    // 3 elements, 0x8 bytes (sizeof) 
              {                                                                          
                  struct                               // 5 elements, 0x8 bytes (sizeof) 
                  {                                                                      
/*0x000*/             UINT64       Locked : 1;         // 0 BitPosition                  
/*0x000*/             UINT64       Waiting : 1;        // 1 BitPosition                  
/*0x000*/             UINT64       Waking : 1;         // 2 BitPosition                  
/*0x000*/             UINT64       MultipleShared : 1; // 3 BitPosition                  
/*0x000*/             UINT64       Shared : 60;        // 4 BitPosition                  
                  };                                                                     
/*0x000*/         UINT64       Value;                                                    
/*0x000*/         UINT64       Ptr;                    // VOID*                          
              };                                                                         
          }EX_PUSH_LOCK, *PEX_PUSH_LOCK;                                                 
                                                                                         
          typedef struct _ALPC_PROCESS_CONTEXT  // 3 elements, 0x20 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _EX_PUSH_LOCK Lock;        // 7 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _LIST_ENTRY ViewListHead;  // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     UINT64       PagedPoolQuotaCache;                                    
          }ALPC_PROCESS_CONTEXT, *PALPC_PROCESS_CONTEXT;                                   
                                                                                   
typedef struct _ASSEMBLY_STORAGE_MAP // 0 elements, 0x0 bytes (sizeof) 
{                                                                      
}ASSEMBLY_STORAGE_MAP, *PASSEMBLY_STORAGE_MAP;                                  
                                                                       
          typedef struct _GENERIC_MAPPING  // 4 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     ULONG32      GenericRead;                                       
/*0x004*/     ULONG32      GenericWrite;                                      
/*0x008*/     ULONG32      GenericExecute;                                    
/*0x00C*/     ULONG32      GenericAll;                                        
          }GENERIC_MAPPING, *PGENERIC_MAPPING;                                   
                                                                              
          typedef struct _GUID       // 4 elements, 0x10 bytes (sizeof) 
          {                                                             
/*0x000*/     ULONG32      Data1;                                       
/*0x004*/     UINT16       Data2;                                       
/*0x006*/     UINT16       Data3;                                       
/*0x008*/     UINT8        Data4[8];                                    
          }GUID, *PGUID;                                                
                                                                        
          typedef struct _AUX_ACCESS_DATA              // 12 elements, 0xE0 bytes (sizeof)                                         
          {                                                                                                                        
/*0x000*/     UINT64       PrivilegesUsed;             // struct _PRIVILEGE_SET*                                                   
/*0x008*/     struct _GENERIC_MAPPING GenericMapping;  // 4 elements, 0x10 bytes (sizeof)                                          
/*0x018*/     ULONG32      AccessesToAudit;                                                                                        
/*0x01C*/     ULONG32      MaximumAuditMask;                                                                                       
/*0x020*/     struct _GUID TransactionId;              // 4 elements, 0x10 bytes (sizeof)                                          
/*0x030*/     UINT64       NewSecurityDescriptor;      // VOID*                                                                    
/*0x038*/     UINT64       ExistingSecurityDescriptor; // VOID*                                                                    
/*0x040*/     UINT64       ParentSecurityDescriptor;   // VOID*                                                                    
/*0x048*/     UINT64       DeRefSecurityDescriptor;    // FUNCT_00EF_00EE_CleanupGroupCancelCallback_DeRefSecurityDescriptor_Free* 
/*0x050*/     UINT64       SDLock;                     // VOID*                                                                    
/*0x058*/     struct _ACCESS_REASONS AccessReasons;    // 1 elements, 0x80 bytes (sizeof)                                          
/*0x0D8*/     UINT8        GenerateStagingEvents;                                                                                  
/*0x0D9*/     UINT8        _PADDING0_[0x7];                                                                                        
          }AUX_ACCESS_DATA, *PAUX_ACCESS_DATA;                                                                                     
                                                                                                                                   
          typedef struct _BATTERY_REPORTING_SCALE // 2 elements, 0x8 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      Granularity;                                             
/*0x004*/     ULONG32      Capacity;                                                
          }BATTERY_REPORTING_SCALE, *PBATTERY_REPORTING_SCALE;                                  
                                                                                    
          typedef struct _CACHE_DESCRIPTOR     // 5 elements, 0xC bytes (sizeof) 
          {                                                                      
/*0x000*/     UINT8        Level;                                                
/*0x001*/     UINT8        Associativity;                                        
/*0x002*/     UINT16       LineSize;                                             
/*0x004*/     ULONG32      Size;                                                 
/*0x008*/     enum _PROCESSOR_CACHE_TYPE Type;                                   
          }CACHE_DESCRIPTOR, *PCACHE_DESCRIPTOR;                                  
                                                                                 
typedef struct _CI_NGEN_PATHS // 0 elements, 0x0 bytes (sizeof) 
{                                                               
}CI_NGEN_PATHS, *PCI_NGEN_PATHS;                                  
                                                                
          typedef struct _CLIENT_ID       // 2 elements, 0x10 bytes (sizeof) 
          {                                                                  
/*0x000*/     UINT64       UniqueProcess; // VOID*                           
/*0x008*/     UINT64       UniqueThread;  // VOID*                           
          }CLIENT_ID, *PCLIENT_ID;                                           
                                                                             
          typedef struct _CLIENT_ID32     // 2 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      UniqueProcess;                                   
/*0x004*/     ULONG32      UniqueThread;                                    
          }CLIENT_ID32, *PCLIENT_ID32;                                      
                                                                            
          typedef struct _CLIENT_ID64     // 2 elements, 0x10 bytes (sizeof) 
          {                                                                  
/*0x000*/     UINT64       UniqueProcess;                                    
/*0x008*/     UINT64       UniqueThread;                                     
          }CLIENT_ID64, *PCLIENT_ID64;                                       
                                                                             
          typedef union _LARGE_INTEGER   // 4 elements, 0x8 bytes (sizeof) 
          {                                                                
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              };                                                           
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              }u;                                                          
/*0x000*/     INT64        QuadPart;                                       
          }LARGE_INTEGER, *PLARGE_INTEGER;                                  
                                                                           
          typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR // 4 elements, 0x14 bytes (sizeof)  
          {                                                                                  
/*0x000*/     UINT8        Type;                                                             
/*0x001*/     UINT8        ShareDisposition;                                                 
/*0x002*/     UINT16       Flags;                                                            
              union                                      // 14 elements, 0x10 bytes (sizeof) 
              {                                                                              
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length;                                                   
                  }Generic;                                                                  
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length;                                                   
                  }Port;                                                                     
                  struct                                 // 4 elements, 0x10 bytes (sizeof)  
                  {                                                                          
/*0x004*/             UINT16       Level;                                                    
/*0x006*/             UINT16       Group;                                                    
/*0x008*/             ULONG32      Vector;                                                   
/*0x00C*/             UINT64       Affinity;                                                 
                  }Interrupt;                                                                
                  struct                                 // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                          
                      union                              // 2 elements, 0x10 bytes (sizeof)  
                      {                                                                      
                          struct                         // 4 elements, 0x10 bytes (sizeof)  
                          {                                                                  
/*0x004*/                     UINT16       Group;                                            
/*0x006*/                     UINT16       MessageCount;                                     
/*0x008*/                     ULONG32      Vector;                                           
/*0x00C*/                     UINT64       Affinity;                                         
                          }Raw;                                                              
                          struct                         // 4 elements, 0x10 bytes (sizeof)  
                          {                                                                  
/*0x004*/                     UINT16       Level;                                            
/*0x006*/                     UINT16       Group;                                            
/*0x008*/                     ULONG32      Vector;                                           
/*0x00C*/                     UINT64       Affinity;                                         
                          }Translated;                                                       
                      };                                                                     
                  }MessageInterrupt;                                                         
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length;                                                   
                  }Memory;                                                                   
                  struct                                 // 3 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Channel;                                                  
/*0x008*/             ULONG32      Port;                                                     
/*0x00C*/             ULONG32      Reserved1;                                                
                  }Dma;                                                                      
                  struct                                 // 6 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Channel;                                                  
/*0x008*/             ULONG32      RequestLine;                                              
/*0x00C*/             UINT8        TransferWidth;                                            
/*0x00D*/             UINT8        Reserved1;                                                
/*0x00E*/             UINT8        Reserved2;                                                
/*0x00F*/             UINT8        Reserved3;                                                
                  }DmaV3;                                                                    
                  struct                                 // 1 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Data[3];                                                  
                  }DevicePrivate;                                                            
                  struct                                 // 3 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Start;                                                    
/*0x008*/             ULONG32      Length;                                                   
/*0x00C*/             ULONG32      Reserved;                                                 
                  }BusNumber;                                                                
                  struct                                 // 3 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      DataSize;                                                 
/*0x008*/             ULONG32      Reserved1;                                                
/*0x00C*/             ULONG32      Reserved2;                                                
                  }DeviceSpecificData;                                                       
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length40;                                                 
                  }Memory40;                                                                 
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length48;                                                 
                  }Memory48;                                                                 
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length64;                                                 
                  }Memory64;                                                                 
                  struct                                 // 6 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             UINT8        Class;                                                    
/*0x005*/             UINT8        Type;                                                     
/*0x006*/             UINT8        Reserved1;                                                
/*0x007*/             UINT8        Reserved2;                                                
/*0x008*/             ULONG32      IdLowPart;                                                
/*0x00C*/             ULONG32      IdHighPart;                                               
                  }Connection;                                                               
              }u;                                                                            
          }CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR;                                    
                                                                                             
          typedef struct _CM_PARTIAL_RESOURCE_LIST                          // 4 elements, 0x1C bytes (sizeof) 
          {                                                                                                    
/*0x000*/     UINT16       Version;                                                                            
/*0x002*/     UINT16       Revision;                                                                           
/*0x004*/     ULONG32      Count;                                                                              
/*0x008*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];                                    
          }CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST;                                               
                                                                                                               
          typedef struct _CM_FULL_RESOURCE_DESCRIPTOR               // 3 elements, 0x24 bytes (sizeof) 
          {                                                                                            
/*0x000*/     enum _INTERFACE_TYPE InterfaceType;                                                      
/*0x004*/     ULONG32      BusNumber;                                                                  
/*0x008*/     struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList; // 4 elements, 0x1C bytes (sizeof) 
          }CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR;                                   
                                                                                                       
          typedef struct _CM_RESOURCE_LIST                 // 2 elements, 0x28 bytes (sizeof) 
          {                                                                                   
/*0x000*/     ULONG32      Count;                                                             
/*0x004*/     struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];                                    
          }CM_RESOURCE_LIST, *PCM_RESOURCE_LIST;                                              
                                                                                              
          typedef struct _COMPRESSED_DATA_INFO         // 7 elements, 0xC bytes (sizeof) 
          {                                                                              
/*0x000*/     UINT16       CompressionFormatAndEngine;                                   
/*0x002*/     UINT8        CompressionUnitShift;                                         
/*0x003*/     UINT8        ChunkShift;                                                   
/*0x004*/     UINT8        ClusterShift;                                                 
/*0x005*/     UINT8        Reserved;                                                     
/*0x006*/     UINT16       NumberOfChunks;                                               
/*0x008*/     ULONG32      CompressedChunkSizes[1];                                      
          }COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO;                                  
                                                                                         
          typedef struct _M128A  // 2 elements, 0x10 bytes (sizeof) 
          {                                                         
/*0x000*/     UINT64       Low;                                     
/*0x008*/     INT64        High;                                    
          }M128A, *PM128A;                                          
                                                                    
          typedef struct _XSAVE_FORMAT         // 16 elements, 0x200 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT16       ControlWord;                                             
/*0x002*/     UINT16       StatusWord;                                              
/*0x004*/     UINT8        TagWord;                                                 
/*0x005*/     UINT8        Reserved1;                                               
/*0x006*/     UINT16       ErrorOpcode;                                             
/*0x008*/     ULONG32      ErrorOffset;                                             
/*0x00C*/     UINT16       ErrorSelector;                                           
/*0x00E*/     UINT16       Reserved2;                                               
/*0x010*/     ULONG32      DataOffset;                                              
/*0x014*/     UINT16       DataSelector;                                            
/*0x016*/     UINT16       Reserved3;                                               
/*0x018*/     ULONG32      MxCsr;                                                   
/*0x01C*/     ULONG32      MxCsr_Mask;                                              
/*0x020*/     struct _M128A FloatRegisters[8];                                      
/*0x0A0*/     struct _M128A XmmRegisters[16];                                       
/*0x1A0*/     UINT8        Reserved4[96];                                           
          }XSAVE_FORMAT, *PXSAVE_FORMAT;                                            
                                                                                    
          typedef struct _CONTEXT                    // 64 elements, 0x4D0 bytes (sizeof) 
          {                                                                               
/*0x000*/     UINT64       P1Home;                                                        
/*0x008*/     UINT64       P2Home;                                                        
/*0x010*/     UINT64       P3Home;                                                        
/*0x018*/     UINT64       P4Home;                                                        
/*0x020*/     UINT64       P5Home;                                                        
/*0x028*/     UINT64       P6Home;                                                        
/*0x030*/     ULONG32      ContextFlags;                                                  
/*0x034*/     ULONG32      MxCsr;                                                         
/*0x038*/     UINT16       SegCs;                                                         
/*0x03A*/     UINT16       SegDs;                                                         
/*0x03C*/     UINT16       SegEs;                                                         
/*0x03E*/     UINT16       SegFs;                                                         
/*0x040*/     UINT16       SegGs;                                                         
/*0x042*/     UINT16       SegSs;                                                         
/*0x044*/     ULONG32      EFlags;                                                        
/*0x048*/     UINT64       Dr0;                                                           
/*0x050*/     UINT64       Dr1;                                                           
/*0x058*/     UINT64       Dr2;                                                           
/*0x060*/     UINT64       Dr3;                                                           
/*0x068*/     UINT64       Dr6;                                                           
/*0x070*/     UINT64       Dr7;                                                           
/*0x078*/     UINT64       Rax;                                                           
/*0x080*/     UINT64       Rcx;                                                           
/*0x088*/     UINT64       Rdx;                                                           
/*0x090*/     UINT64       Rbx;                                                           
/*0x098*/     UINT64       Rsp;                                                           
/*0x0A0*/     UINT64       Rbp;                                                           
/*0x0A8*/     UINT64       Rsi;                                                           
/*0x0B0*/     UINT64       Rdi;                                                           
/*0x0B8*/     UINT64       R8;                                                            
/*0x0C0*/     UINT64       R9;                                                            
/*0x0C8*/     UINT64       R10;                                                           
/*0x0D0*/     UINT64       R11;                                                           
/*0x0D8*/     UINT64       R12;                                                           
/*0x0E0*/     UINT64       R13;                                                           
/*0x0E8*/     UINT64       R14;                                                           
/*0x0F0*/     UINT64       R15;                                                           
/*0x0F8*/     UINT64       Rip;                                                           
              union                                  // 2 elements, 0x200 bytes (sizeof)  
              {                                                                           
/*0x100*/         struct _XSAVE_FORMAT FltSave;      // 16 elements, 0x200 bytes (sizeof) 
                  struct                             // 18 elements, 0x200 bytes (sizeof) 
                  {                                                                       
/*0x100*/             struct _M128A Header[2];                                            
/*0x120*/             struct _M128A Legacy[8];                                            
/*0x1A0*/             struct _M128A Xmm0;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1B0*/             struct _M128A Xmm1;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1C0*/             struct _M128A Xmm2;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1D0*/             struct _M128A Xmm3;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1E0*/             struct _M128A Xmm4;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1F0*/             struct _M128A Xmm5;            // 2 elements, 0x10 bytes (sizeof)   
/*0x200*/             struct _M128A Xmm6;            // 2 elements, 0x10 bytes (sizeof)   
/*0x210*/             struct _M128A Xmm7;            // 2 elements, 0x10 bytes (sizeof)   
/*0x220*/             struct _M128A Xmm8;            // 2 elements, 0x10 bytes (sizeof)   
/*0x230*/             struct _M128A Xmm9;            // 2 elements, 0x10 bytes (sizeof)   
/*0x240*/             struct _M128A Xmm10;           // 2 elements, 0x10 bytes (sizeof)   
/*0x250*/             struct _M128A Xmm11;           // 2 elements, 0x10 bytes (sizeof)   
/*0x260*/             struct _M128A Xmm12;           // 2 elements, 0x10 bytes (sizeof)   
/*0x270*/             struct _M128A Xmm13;           // 2 elements, 0x10 bytes (sizeof)   
/*0x280*/             struct _M128A Xmm14;           // 2 elements, 0x10 bytes (sizeof)   
/*0x290*/             struct _M128A Xmm15;           // 2 elements, 0x10 bytes (sizeof)   
/*0x2A0*/             UINT8        _PADDING0_[0x60];                                      
                  };                                                                      
              };                                                                          
/*0x300*/     struct _M128A VectorRegister[26];                                           
/*0x4A0*/     UINT64       VectorControl;                                                 
/*0x4A8*/     UINT64       DebugControl;                                                  
/*0x4B0*/     UINT64       LastBranchToRip;                                               
/*0x4B8*/     UINT64       LastBranchFromRip;                                             
/*0x4C0*/     UINT64       LastExceptionToRip;                                            
/*0x4C8*/     UINT64       LastExceptionFromRip;                                          
          }CONTEXT, *PCONTEXT;                                                            
                                                                                          
          typedef struct _COUNTER_READING       // 4 elements, 0x18 bytes (sizeof) 
          {                                                                        
/*0x000*/     enum _HARDWARE_COUNTER_TYPE Type;                                    
/*0x004*/     ULONG32      Index;                                                  
/*0x008*/     UINT64       Start;                                                  
/*0x010*/     UINT64       Total;                                                  
          }COUNTER_READING, *PCOUNTER_READING;                                     
                                                                                   
          typedef struct _CURDIR              // 2 elements, 0x18 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _UNICODE_STRING DosPath; // 3 elements, 0x10 bytes (sizeof) 
/*0x010*/     UINT64       Handle;            // VOID*                           
          }CURDIR, *PCURDIR;                                                     
                                                                                 
          typedef struct _CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG // 2 elements, 0x10 bytes (sizeof) 
          {                                                                                     
/*0x000*/     ULONG32      Size;                                                                
/*0x004*/     UINT8        _PADDING0_[0x4];                                                     
/*0x008*/     UINT64       TriggerId;                        // WCHAR*                          
          }CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG, *PCUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG;                                   
                                                                                                
          typedef struct _DBGK_SILOSTATE             // 4 elements, 0x20 bytes (sizeof) 
          {                                                                             
/*0x000*/     struct _EX_PUSH_LOCK ErrorPortLock;    // 7 elements, 0x8 bytes (sizeof)  
/*0x008*/     UINT64       ErrorPort;                // struct _DBGKP_ERROR_PORT*       
/*0x010*/     UINT64       ErrorProcess;             // struct _EPROCESS*               
/*0x018*/     UINT64       ErrorPortRegisteredEvent; // struct _KEVENT*                 
          }DBGK_SILOSTATE, *PDBGK_SILOSTATE;                                            
                                                                                        
typedef struct _DBGKP_ERROR_PORT // 0 elements, 0x0 bytes (sizeof) 
{                                                                  
}DBGKP_ERROR_PORT, *PDBGKP_ERROR_PORT;                                  
                                                                   
          typedef struct _DEVICE_CAPABILITIES               // 34 elements, 0x40 bytes (sizeof) 
          {                                                                                     
/*0x000*/     UINT16       Size;                                                                
/*0x002*/     UINT16       Version;                                                             
              struct                                        // 24 elements, 0x4 bytes (sizeof)  
              {                                                                                 
/*0x004*/         ULONG32      DeviceD1 : 1;                // 0 BitPosition                    
/*0x004*/         ULONG32      DeviceD2 : 1;                // 1 BitPosition                    
/*0x004*/         ULONG32      LockSupported : 1;           // 2 BitPosition                    
/*0x004*/         ULONG32      EjectSupported : 1;          // 3 BitPosition                    
/*0x004*/         ULONG32      Removable : 1;               // 4 BitPosition                    
/*0x004*/         ULONG32      DockDevice : 1;              // 5 BitPosition                    
/*0x004*/         ULONG32      UniqueID : 1;                // 6 BitPosition                    
/*0x004*/         ULONG32      SilentInstall : 1;           // 7 BitPosition                    
/*0x004*/         ULONG32      RawDeviceOK : 1;             // 8 BitPosition                    
/*0x004*/         ULONG32      SurpriseRemovalOK : 1;       // 9 BitPosition                    
/*0x004*/         ULONG32      WakeFromD0 : 1;              // 10 BitPosition                   
/*0x004*/         ULONG32      WakeFromD1 : 1;              // 11 BitPosition                   
/*0x004*/         ULONG32      WakeFromD2 : 1;              // 12 BitPosition                   
/*0x004*/         ULONG32      WakeFromD3 : 1;              // 13 BitPosition                   
/*0x004*/         ULONG32      HardwareDisabled : 1;        // 14 BitPosition                   
/*0x004*/         ULONG32      NonDynamic : 1;              // 15 BitPosition                   
/*0x004*/         ULONG32      WarmEjectSupported : 1;      // 16 BitPosition                   
/*0x004*/         ULONG32      NoDisplayInUI : 1;           // 17 BitPosition                   
/*0x004*/         ULONG32      Reserved1 : 1;               // 18 BitPosition                   
/*0x004*/         ULONG32      WakeFromInterrupt : 1;       // 19 BitPosition                   
/*0x004*/         ULONG32      SecureDevice : 1;            // 20 BitPosition                   
/*0x004*/         ULONG32      ChildOfVgaEnabledBridge : 1; // 21 BitPosition                   
/*0x004*/         ULONG32      DecodeIoOnBoot : 1;          // 22 BitPosition                   
/*0x004*/         ULONG32      Reserved : 9;                // 23 BitPosition                   
              };                                                                                
/*0x008*/     ULONG32      Address;                                                             
/*0x00C*/     ULONG32      UINumber;                                                            
/*0x010*/     enum _DEVICE_POWER_STATE DeviceState[7];                                          
/*0x02C*/     enum _SYSTEM_POWER_STATE SystemWake;                                              
/*0x030*/     enum _DEVICE_POWER_STATE DeviceWake;                                              
/*0x034*/     ULONG32      D1Latency;                                                           
/*0x038*/     ULONG32      D2Latency;                                                           
/*0x03C*/     ULONG32      D3Latency;                                                           
          }DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES;                                          
                                                                                                
          typedef struct _DEVICE_MAP                  // 7 elements, 0x48 bytes (sizeof) 
          {                                                                              
/*0x000*/     UINT64       DosDevicesDirectory;       // struct _OBJECT_DIRECTORY*       
/*0x008*/     UINT64       GlobalDosDevicesDirectory; // struct _OBJECT_DIRECTORY*       
/*0x010*/     UINT64       DosDevicesDirectoryHandle; // VOID*                           
/*0x018*/     LONG32       ReferenceCount;                                               
/*0x01C*/     ULONG32      DriveMap;                                                     
/*0x020*/     UINT8        DriveType[32];                                                
/*0x040*/     UINT64       ServerSilo;                // struct _EJOB*                   
          }DEVICE_MAP, *PDEVICE_MAP;                                                     
                                                                                         
          typedef struct _KDEVICE_QUEUE_ENTRY     // 3 elements, 0x18 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _LIST_ENTRY DeviceListEntry; // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     ULONG32      SortKey;                                                  
/*0x014*/     UINT8        Inserted;                                                 
/*0x015*/     UINT8        _PADDING0_[0x3];                                          
          }KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY;                                   
                                                                                     
          typedef struct _WAIT_CONTEXT_BLOCK                    // 14 elements, 0x48 bytes (sizeof) 
          {                                                                                         
              union                                             // 2 elements, 0x18 bytes (sizeof)  
              {                                                                                     
/*0x000*/         struct _KDEVICE_QUEUE_ENTRY WaitQueueEntry;   // 3 elements, 0x18 bytes (sizeof)  
                  struct                                        // 3 elements, 0x18 bytes (sizeof)  
                  {                                                                                 
/*0x000*/             struct _LIST_ENTRY DmaWaitEntry;          // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/             ULONG32      NumberOfChannels;                                                
                      struct                                    // 5 elements, 0x4 bytes (sizeof)   
                      {                                                                             
/*0x014*/                 ULONG32      SyncCallback : 1;        // 0 BitPosition                    
/*0x014*/                 ULONG32      DmaContext : 1;          // 1 BitPosition                    
/*0x014*/                 ULONG32      ZeroMapRegisters : 1;    // 2 BitPosition                    
/*0x014*/                 ULONG32      Reserved : 9;            // 3 BitPosition                    
/*0x014*/                 ULONG32      NumberOfRemapPages : 20; // 12 BitPosition                   
                      };                                                                            
                  };                                                                                
              };                                                                                    
/*0x018*/     UINT64       DeviceRoutine;                       // FUNCT_12D8_12D7_DeviceRoutine*   
/*0x020*/     UINT64       DeviceContext;                       // VOID*                            
/*0x028*/     ULONG32      NumberOfMapRegisters;                                                    
/*0x02C*/     UINT8        _PADDING0_[0x4];                                                         
/*0x030*/     UINT64       DeviceObject;                        // VOID*                            
/*0x038*/     UINT64       CurrentIrp;                          // VOID*                            
/*0x040*/     UINT64       BufferChainingDpc;                   // struct _KDPC*                    
          }WAIT_CONTEXT_BLOCK, *PWAIT_CONTEXT_BLOCK;                                                
                                                                                                    
          typedef struct _KDEVICE_QUEUE          // 7 elements, 0x28 bytes (sizeof) 
          {                                                                         
/*0x000*/     INT16        Type;                                                    
/*0x002*/     INT16        Size;                                                    
/*0x004*/     UINT8        _PADDING0_[0x4];                                         
/*0x008*/     struct _LIST_ENTRY DeviceListHead; // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     UINT64       Lock;                                                    
              union                              // 2 elements, 0x8 bytes (sizeof)  
              {                                                                     
/*0x020*/         UINT8        Busy;                                                
                  struct                         // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                 
/*0x020*/             INT64        Reserved : 8; // 0 BitPosition                   
/*0x020*/             INT64        Hint : 56;    // 8 BitPosition                   
                  };                                                                
              };                                                                    
          }KDEVICE_QUEUE, *PKDEVICE_QUEUE;                                          
                                                                                    
          typedef struct _SINGLE_LIST_ENTRY // 1 elements, 0x8 bytes (sizeof) 
          {                                                                   
/*0x000*/     UINT64       Next;            // struct _SINGLE_LIST_ENTRY*     
          }SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY;                                  
                                                                              
          typedef struct _KDPC                        // 11 elements, 0x40 bytes (sizeof) 
          {                                                                               
              union                                   // 2 elements, 0x8 bytes (sizeof)   
              {                                                                           
/*0x000*/         ULONG32      TargetInfoAsUlong;                                         
                  struct                              // 3 elements, 0x8 bytes (sizeof)   
                  {                                                                       
/*0x000*/             UINT8        Type;                                                  
/*0x001*/             UINT8        Importance;                                            
/*0x002*/             UINT16       Number;                                                
/*0x004*/             UINT8        _PADDING0_[0x4];                                       
                  };                                                                      
              };                                                                          
/*0x008*/     struct _SINGLE_LIST_ENTRY DpcListEntry; // 1 elements, 0x8 bytes (sizeof)   
/*0x010*/     UINT64       ProcessorHistory;                                              
/*0x018*/     UINT64       DeferredRoutine;           // FUNCT_00EF_0672_DeferredRoutine* 
/*0x020*/     UINT64       DeferredContext;           // VOID*                            
/*0x028*/     UINT64       SystemArgument1;           // VOID*                            
/*0x030*/     UINT64       SystemArgument2;           // VOID*                            
/*0x038*/     UINT64       DpcData;                   // VOID*                            
          }KDPC, *PKDPC;                                                                  
                                                                                          
          typedef struct _DISPATCHER_HEADER                                // 58 elements, 0x18 bytes (sizeof) 
          {                                                                                                    
              union                                                        // 8 elements, 0x4 bytes (sizeof)   
              {                                                                                                
/*0x000*/         LONG32       Lock;                                                                           
/*0x000*/         LONG32       LockNV;                                                                         
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        Type;                                                                       
/*0x001*/             UINT8        Signalling;                                                                 
/*0x002*/             UINT8        Size;                                                                       
/*0x003*/             UINT8        Reserved1;                                                                  
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        TimerType;                                                                  
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x001*/                 UINT8        TimerControlFlags;                                                      
                          struct                                           // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x001*/                     UINT8        Absolute : 1;                   // 0 BitPosition                    
/*0x001*/                     UINT8        Wake : 1;                       // 1 BitPosition                    
/*0x001*/                     UINT8        EncodedTolerableDelay : 6;      // 2 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x002*/             UINT8        Hand;                                                                       
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x003*/                 UINT8        TimerMiscFlags;                                                         
                          struct                                           // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x003*/                     UINT8        Index : 6;                      // 0 BitPosition                    
/*0x003*/                     UINT8        Inserted : 1;                   // 6 BitPosition                    
/*0x003*/                     UINT8        Expired : 1;                    // 7 BitPosition                    
                          };                                                                                   
                      };                                                                                       
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        Timer2Type;                                                                 
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x001*/                 UINT8        Timer2Flags;                                                            
                          struct                                           // 7 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x001*/                     UINT8        Timer2Inserted : 1;             // 0 BitPosition                    
/*0x001*/                     UINT8        Timer2Expiring : 1;             // 1 BitPosition                    
/*0x001*/                     UINT8        Timer2CancelPending : 1;        // 2 BitPosition                    
/*0x001*/                     UINT8        Timer2SetPending : 1;           // 3 BitPosition                    
/*0x001*/                     UINT8        Timer2Running : 1;              // 4 BitPosition                    
/*0x001*/                     UINT8        Timer2Disabled : 1;             // 5 BitPosition                    
/*0x001*/                     UINT8        Timer2ReservedFlags : 2;        // 6 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x002*/             UINT8        Timer2ComponentId;                                                          
/*0x003*/             UINT8        Timer2RelativeId;                                                           
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        QueueType;                                                                  
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x001*/                 UINT8        QueueControlFlags;                                                      
                          struct                                           // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x001*/                     UINT8        Abandoned : 1;                  // 0 BitPosition                    
/*0x001*/                     UINT8        DisableIncrement : 1;           // 1 BitPosition                    
/*0x001*/                     UINT8        QueueReservedControlFlags : 6;  // 2 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x002*/             UINT8        QueueSize;                                                                  
/*0x003*/             UINT8        QueueReserved;                                                              
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        ThreadType;                                                                 
/*0x001*/             UINT8        ThreadReserved;                                                             
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x002*/                 UINT8        ThreadControlFlags;                                                     
                          struct                                           // 8 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x002*/                     UINT8        CycleProfiling : 1;             // 0 BitPosition                    
/*0x002*/                     UINT8        CounterProfiling : 1;           // 1 BitPosition                    
/*0x002*/                     UINT8        GroupScheduling : 1;            // 2 BitPosition                    
/*0x002*/                     UINT8        AffinitySet : 1;                // 3 BitPosition                    
/*0x002*/                     UINT8        Tagged : 1;                     // 4 BitPosition                    
/*0x002*/                     UINT8        EnergyProfiling : 1;            // 5 BitPosition                    
/*0x002*/                     UINT8        SchedulerAssist : 1;            // 6 BitPosition                    
/*0x002*/                     UINT8        ThreadReservedControlFlags : 1; // 7 BitPosition                    
                          };                                                                                   
                      };                                                                                       
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x003*/                 UINT8        DebugActive;                                                            
                          struct                                           // 6 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x003*/                     UINT8        ActiveDR7 : 1;                  // 0 BitPosition                    
/*0x003*/                     UINT8        Instrumented : 1;               // 1 BitPosition                    
/*0x003*/                     UINT8        Minimal : 1;                    // 2 BitPosition                    
/*0x003*/                     UINT8        Reserved4 : 3;                  // 3 BitPosition                    
/*0x003*/                     UINT8        UmsScheduled : 1;               // 6 BitPosition                    
/*0x003*/                     UINT8        UmsPrimary : 1;                 // 7 BitPosition                    
                          };                                                                                   
                      };                                                                                       
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        MutantType;                                                                 
/*0x001*/             UINT8        MutantSize;                                                                 
/*0x002*/             UINT8        DpcActive;                                                                  
/*0x003*/             UINT8        MutantReserved;                                                             
                  };                                                                                           
              };                                                                                               
/*0x004*/     LONG32       SignalState;                                                                        
/*0x008*/     struct _LIST_ENTRY WaitListHead;                             // 2 elements, 0x10 bytes (sizeof)  
          }DISPATCHER_HEADER, *PDISPATCHER_HEADER;                                                             
                                                                                                               
          typedef struct _KEVENT                // 1 elements, 0x18 bytes (sizeof)  
          {                                                                         
/*0x000*/     struct _DISPATCHER_HEADER Header; // 58 elements, 0x18 bytes (sizeof) 
          }KEVENT, *PKEVENT;                                                        
                                                                                    
          typedef struct _DEVICE_OBJECT           // 25 elements, 0x150 bytes (sizeof) 
          {                                                                            
/*0x000*/     INT16        Type;                                                       
/*0x002*/     UINT16       Size;                                                       
/*0x004*/     LONG32       ReferenceCount;                                             
/*0x008*/     UINT64       DriverObject;          // struct _DRIVER_OBJECT*            
/*0x010*/     UINT64       NextDevice;            // struct _DEVICE_OBJECT*            
/*0x018*/     UINT64       AttachedDevice;        // struct _DEVICE_OBJECT*            
/*0x020*/     UINT64       CurrentIrp;            // struct _IRP*                      
/*0x028*/     UINT64       Timer;                 // struct _IO_TIMER*                 
/*0x030*/     ULONG32      Flags;                                                      
/*0x034*/     ULONG32      Characteristics;                                            
/*0x038*/     UINT64       Vpb;                   // struct _VPB*                      
/*0x040*/     UINT64       DeviceExtension;       // VOID*                             
/*0x048*/     ULONG32      DeviceType;                                                 
/*0x04C*/     CHAR         StackSize;                                                  
/*0x04D*/     UINT8        _PADDING0_[0x3];                                            
              union                               // 2 elements, 0x48 bytes (sizeof)   
              {                                                                        
/*0x050*/         struct _LIST_ENTRY ListEntry;   // 2 elements, 0x10 bytes (sizeof)   
/*0x050*/         struct _WAIT_CONTEXT_BLOCK Wcb; // 14 elements, 0x48 bytes (sizeof)  
              }Queue;                                                                  
/*0x098*/     ULONG32      AlignmentRequirement;                                       
/*0x09C*/     UINT8        _PADDING1_[0x4];                                            
/*0x0A0*/     struct _KDEVICE_QUEUE DeviceQueue;  // 7 elements, 0x28 bytes (sizeof)   
/*0x0C8*/     struct _KDPC Dpc;                   // 11 elements, 0x40 bytes (sizeof)  
/*0x108*/     ULONG32      ActiveThreadCount;                                          
/*0x10C*/     UINT8        _PADDING2_[0x4];                                            
/*0x110*/     UINT64       SecurityDescriptor;    // VOID*                             
/*0x118*/     struct _KEVENT DeviceLock;          // 1 elements, 0x18 bytes (sizeof)   
/*0x130*/     UINT16       SectorSize;                                                 
/*0x132*/     UINT16       Spare1;                                                     
/*0x134*/     UINT8        _PADDING3_[0x4];                                            
/*0x138*/     UINT64       DeviceObjectExtension; // struct _DEVOBJ_EXTENSION*         
/*0x140*/     UINT64       Reserved;              // VOID*                             
/*0x148*/     UINT8        _PADDING4_[0x8];                                            
          }DEVICE_OBJECT, *PDEVICE_OBJECT;                                             
                                                                                       
typedef struct _DEVICE_OBJECT_POWER_EXTENSION // 0 elements, 0x0 bytes (sizeof) 
{                                                                               
}DEVICE_OBJECT_POWER_EXTENSION, *PDEVICE_OBJECT_POWER_EXTENSION;                                  
                                                                                
          typedef struct _DEVOBJ_EXTENSION   // 15 elements, 0x68 bytes (sizeof)       
          {                                                                            
/*0x000*/     INT16        Type;                                                       
/*0x002*/     UINT16       Size;                                                       
/*0x004*/     UINT8        _PADDING0_[0x4];                                            
/*0x008*/     UINT64       DeviceObject;     // struct _DEVICE_OBJECT*                 
/*0x010*/     ULONG32      PowerFlags;                                                 
/*0x014*/     UINT8        _PADDING1_[0x4];                                            
/*0x018*/     UINT64       Dope;             // struct _DEVICE_OBJECT_POWER_EXTENSION* 
/*0x020*/     ULONG32      ExtensionFlags;                                             
/*0x024*/     UINT8        _PADDING2_[0x4];                                            
/*0x028*/     UINT64       DeviceNode;       // VOID*                                  
/*0x030*/     UINT64       AttachedTo;       // struct _DEVICE_OBJECT*                 
/*0x038*/     LONG32       StartIoCount;                                               
/*0x03C*/     LONG32       StartIoKey;                                                 
/*0x040*/     ULONG32      StartIoFlags;                                               
/*0x044*/     UINT8        _PADDING3_[0x4];                                            
/*0x048*/     UINT64       Vpb;              // struct _VPB*                           
/*0x050*/     UINT64       DependencyNode;   // VOID*                                  
/*0x058*/     UINT64       InterruptContext; // VOID*                                  
/*0x060*/     UINT64       VerifierContext;  // VOID*                                  
          }DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION;                                          
                                                                                       
          typedef struct _SLIST_ENTRY       // 1 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT64       Next;            // struct _SLIST_ENTRY*            
/*0x008*/     UINT8        _PADDING0_[0x8];                                    
          }SLIST_ENTRY, *PSLIST_ENTRY;                                         
                                                                               
          typedef struct _DPH_BLOCK_INFORMATION     // 10 elements, 0x40 bytes (sizeof) 
          {                                                                             
/*0x000*/     ULONG32      StartStamp;                                                  
/*0x004*/     UINT8        _PADDING0_[0x4];                                             
/*0x008*/     UINT64       Heap;                    // VOID*                            
/*0x010*/     UINT64       RequestedSize;                                               
/*0x018*/     UINT64       ActualSize;                                                  
              union                                 // 3 elements, 0x10 bytes (sizeof)  
              {                                                                         
/*0x020*/         struct _LIST_ENTRY FreeQueue;     // 2 elements, 0x10 bytes (sizeof)  
/*0x020*/         struct _SLIST_ENTRY FreePushList; // 1 elements, 0x10 bytes (sizeof)  
/*0x020*/         UINT16       TraceIndex;                                              
              };                                                                        
/*0x030*/     UINT64       StackTrace;              // VOID*                            
/*0x038*/     ULONG32      Padding;                                                     
/*0x03C*/     ULONG32      EndStamp;                                                    
          }DPH_BLOCK_INFORMATION, *PDPH_BLOCK_INFORMATION;                                    
                                                                                        
          typedef struct _RTL_BALANCED_LINKS // 5 elements, 0x20 bytes (sizeof) 
          {                                                                     
/*0x000*/     UINT64       Parent;           // struct _RTL_BALANCED_LINKS*     
/*0x008*/     UINT64       LeftChild;        // struct _RTL_BALANCED_LINKS*     
/*0x010*/     UINT64       RightChild;       // struct _RTL_BALANCED_LINKS*     
/*0x018*/     CHAR         Balance;                                             
/*0x019*/     UINT8        Reserved[3];                                         
/*0x01C*/     UINT8        _PADDING0_[0x4];                                     
          }RTL_BALANCED_LINKS, *PRTL_BALANCED_LINKS;                                   
                                                                                
          typedef struct _DPH_HEAP_BLOCK                 // 14 elements, 0x80 bytes (sizeof) 
          {                                                                                  
              union                                      // 3 elements, 0x20 bytes (sizeof)  
              {                                                                              
/*0x000*/         UINT64       pNextAlloc;               // struct _DPH_HEAP_BLOCK*          
/*0x000*/         struct _LIST_ENTRY AvailableEntry;     // 2 elements, 0x10 bytes (sizeof)  
/*0x000*/         struct _RTL_BALANCED_LINKS TableLinks; // 5 elements, 0x20 bytes (sizeof)  
              };                                                                             
/*0x020*/     UINT64       pUserAllocation;              // UINT8*                           
/*0x028*/     UINT64       pVirtualBlock;                // UINT8*                           
/*0x030*/     UINT64       nVirtualBlockSize;                                                
/*0x038*/     UINT64       nVirtualAccessSize;                                               
/*0x040*/     UINT64       nUserRequestedSize;                                               
/*0x048*/     UINT64       nUserActualSize;                                                  
/*0x050*/     UINT64       UserValue;                    // VOID*                            
/*0x058*/     ULONG32      UserFlags;                                                        
/*0x05C*/     UINT8        _PADDING0_[0x4];                                                  
/*0x060*/     UINT64       StackTrace;                   // struct _RTL_TRACE_BLOCK*         
/*0x068*/     struct _LIST_ENTRY AdjacencyEntry;         // 2 elements, 0x10 bytes (sizeof)  
/*0x078*/     UINT64       pVirtualRegion;               // UINT8*                           
          }DPH_HEAP_BLOCK, *PDPH_HEAP_BLOCK;                                                 
                                                                                             
          typedef struct _RTL_AVL_TABLE                // 11 elements, 0x68 bytes (sizeof) 
          {                                                                                
/*0x000*/     struct _RTL_BALANCED_LINKS BalancedRoot; // 5 elements, 0x20 bytes (sizeof)  
/*0x020*/     UINT64       OrderedPointer;             // VOID*                            
/*0x028*/     ULONG32      WhichOrderedElement;                                            
/*0x02C*/     ULONG32      NumberGenericTableElements;                                     
/*0x030*/     ULONG32      DepthOfTree;                                                    
/*0x034*/     UINT8        _PADDING0_[0x4];                                                
/*0x038*/     UINT64       RestartKey;                 // struct _RTL_BALANCED_LINKS*      
/*0x040*/     ULONG32      DeleteCount;                                                    
/*0x044*/     UINT8        _PADDING1_[0x4];                                                
/*0x048*/     UINT64       CompareRoutine;             // FUNCT_2002_2001_CompareRoutine*  
/*0x050*/     UINT64       AllocateRoutine;            // FUNCT_00F2_200B_AllocateRoutine* 
/*0x058*/     UINT64       FreeRoutine;                // FUNCT_00EF_200F_FreeRoutine*     
/*0x060*/     UINT64       TableContext;               // VOID*                            
          }RTL_AVL_TABLE, *PRTL_AVL_TABLE;                                                 
                                                                                           
          typedef struct _DPH_HEAP_ROOT                        // 33 elements, 0x168 bytes (sizeof) 
          {                                                                                         
/*0x000*/     ULONG32      Signature;                                                               
/*0x004*/     ULONG32      HeapFlags;                                                               
/*0x008*/     UINT64       HeapCritSect;                       // struct _RTL_CRITICAL_SECTION*     
/*0x010*/     ULONG32      nRemoteLockAcquired;                                                     
/*0x014*/     UINT8        _PADDING0_[0x4];                                                         
/*0x018*/     UINT64       pVirtualStorageListHead;            // struct _DPH_HEAP_BLOCK*           
/*0x020*/     UINT64       pVirtualStorageListTail;            // struct _DPH_HEAP_BLOCK*           
/*0x028*/     ULONG32      nVirtualStorageRanges;                                                   
/*0x02C*/     UINT8        _PADDING1_[0x4];                                                         
/*0x030*/     UINT64       nVirtualStorageBytes;                                                    
/*0x038*/     struct _RTL_AVL_TABLE BusyNodesTable;            // 11 elements, 0x68 bytes (sizeof)  
/*0x0A0*/     UINT64       NodeToAllocate;                     // struct _DPH_HEAP_BLOCK*           
/*0x0A8*/     ULONG32      nBusyAllocations;                                                        
/*0x0AC*/     UINT8        _PADDING2_[0x4];                                                         
/*0x0B0*/     UINT64       nBusyAllocationBytesCommitted;                                           
/*0x0B8*/     UINT64       pFreeAllocationListHead;            // struct _DPH_HEAP_BLOCK*           
/*0x0C0*/     UINT64       pFreeAllocationListTail;            // struct _DPH_HEAP_BLOCK*           
/*0x0C8*/     ULONG32      nFreeAllocations;                                                        
/*0x0CC*/     UINT8        _PADDING3_[0x4];                                                         
/*0x0D0*/     UINT64       nFreeAllocationBytesCommitted;                                           
/*0x0D8*/     struct _LIST_ENTRY AvailableAllocationHead;      // 2 elements, 0x10 bytes (sizeof)   
/*0x0E8*/     ULONG32      nAvailableAllocations;                                                   
/*0x0EC*/     UINT8        _PADDING4_[0x4];                                                         
/*0x0F0*/     UINT64       nAvailableAllocationBytesCommitted;                                      
/*0x0F8*/     UINT64       pUnusedNodeListHead;                // struct _DPH_HEAP_BLOCK*           
/*0x100*/     UINT64       pUnusedNodeListTail;                // struct _DPH_HEAP_BLOCK*           
/*0x108*/     ULONG32      nUnusedNodes;                                                            
/*0x10C*/     UINT8        _PADDING5_[0x4];                                                         
/*0x110*/     UINT64       nBusyAllocationBytesAccessible;                                          
/*0x118*/     UINT64       pNodePoolListHead;                  // struct _DPH_HEAP_BLOCK*           
/*0x120*/     UINT64       pNodePoolListTail;                  // struct _DPH_HEAP_BLOCK*           
/*0x128*/     ULONG32      nNodePools;                                                              
/*0x12C*/     UINT8        _PADDING6_[0x4];                                                         
/*0x130*/     UINT64       nNodePoolBytes;                                                          
/*0x138*/     struct _LIST_ENTRY NextHeap;                     // 2 elements, 0x10 bytes (sizeof)   
/*0x148*/     ULONG32      ExtraFlags;                                                              
/*0x14C*/     ULONG32      Seed;                                                                    
/*0x150*/     UINT64       NormalHeap;                         // VOID*                             
/*0x158*/     UINT64       CreateStackTrace;                   // struct _RTL_TRACE_BLOCK*          
/*0x160*/     UINT64       FirstThread;                        // VOID*                             
          }DPH_HEAP_ROOT, *PDPH_HEAP_ROOT;                                                          
                                                                                                    
          typedef struct _DRIVER_EXTENSION           // 9 elements, 0x50 bytes (sizeof) 
          {                                                                             
/*0x000*/     UINT64       DriverObject;             // struct _DRIVER_OBJECT*          
/*0x008*/     UINT64       AddDevice;                // FUNCT_00A0_0E38_AddDevice*      
/*0x010*/     ULONG32      Count;                                                       
/*0x014*/     UINT8        _PADDING0_[0x4];                                             
/*0x018*/     struct _UNICODE_STRING ServiceKeyName; // 3 elements, 0x10 bytes (sizeof) 
/*0x028*/     UINT64       ClientDriverExtension;    // struct _IO_CLIENT_EXTENSION*    
/*0x030*/     UINT64       FsFilterCallbacks;        // struct _FS_FILTER_CALLBACKS*    
/*0x038*/     UINT64       KseCallbacks;             // VOID*                           
/*0x040*/     UINT64       DvCallbacks;              // VOID*                           
/*0x048*/     UINT64       VerifierContext;          // VOID*                           
          }DRIVER_EXTENSION, *PDRIVER_EXTENSION;                                        
                                                                                        
          typedef struct _DRIVER_OBJECT          // 15 elements, 0x150 bytes (sizeof)            
          {                                                                                      
/*0x000*/     INT16        Type;                                                                 
/*0x002*/     INT16        Size;                                                                 
/*0x004*/     UINT8        _PADDING0_[0x4];                                                      
/*0x008*/     UINT64       DeviceObject;         // struct _DEVICE_OBJECT*                       
/*0x010*/     ULONG32      Flags;                                                                
/*0x014*/     UINT8        _PADDING1_[0x4];                                                      
/*0x018*/     UINT64       DriverStart;          // VOID*                                        
/*0x020*/     ULONG32      DriverSize;                                                           
/*0x024*/     UINT8        _PADDING2_[0x4];                                                      
/*0x028*/     UINT64       DriverSection;        // VOID*                                        
/*0x030*/     UINT64       DriverExtension;      // struct _DRIVER_EXTENSION*                    
/*0x038*/     struct _UNICODE_STRING DriverName; // 3 elements, 0x10 bytes (sizeof)              
/*0x048*/     UINT64       HardwareDatabase;     // struct _UNICODE_STRING*                      
/*0x050*/     UINT64       FastIoDispatch;       // struct _FAST_IO_DISPATCH*                    
/*0x058*/     UINT64       DriverInit;           // FUNCT_00A0_12AF_DriverInit*                  
/*0x060*/     UINT64       DriverStartIo;        // FUNCT_00EF_0F0B_DriverStartIo_CancelRoutine* 
/*0x068*/     UINT64       DriverUnload;         // FUNCT_00EF_12B3_DriverUnload*                
/*0x070*/     UINT64       MajorFunction[28];    // FUNCT_00A0_12B7_MajorFunction*               
          }DRIVER_OBJECT, *PDRIVER_OBJECT;                                                       
                                                                                                 
          typedef struct _RTL_BALANCED_NODE     // 6 elements, 0x18 bytes (sizeof) 
          {                                                                        
              union                             // 2 elements, 0x10 bytes (sizeof) 
              {                                                                    
/*0x000*/         UINT64       Children[2];     // struct _RTL_BALANCED_NODE*      
                  struct                        // 2 elements, 0x10 bytes (sizeof) 
                  {                                                                
/*0x000*/             UINT64       Left;        // struct _RTL_BALANCED_NODE*      
/*0x008*/             UINT64       Right;       // struct _RTL_BALANCED_NODE*      
                  };                                                               
              };                                                                   
              union                             // 2 elements, 0x8 bytes (sizeof)  
              {                                                                    
                  struct                        // 2 elements, 0x1 bytes (sizeof)  
                  {                                                                
/*0x010*/             UINT8        Red : 1;     // 0 BitPosition                   
/*0x010*/             UINT8        Balance : 2; // 0 BitPosition                   
                  };                                                               
/*0x010*/         UINT64       ParentValue;                                        
              };                                                                   
          }RTL_BALANCED_NODE, *PRTL_BALANCED_NODE;                                   
                                                                                   
          typedef struct _DYNAMIC_FUNCTION_TABLE    // 12 elements, 0x70 bytes (sizeof)      
          {                                                                                  
/*0x000*/     struct _LIST_ENTRY ListEntry;         // 2 elements, 0x10 bytes (sizeof)       
/*0x010*/     UINT64       FunctionTable;           // struct _IMAGE_RUNTIME_FUNCTION_ENTRY* 
/*0x018*/     union _LARGE_INTEGER TimeStamp;       // 4 elements, 0x8 bytes (sizeof)        
/*0x020*/     UINT64       MinimumAddress;                                                   
/*0x028*/     UINT64       MaximumAddress;                                                   
/*0x030*/     UINT64       BaseAddress;                                                      
/*0x038*/     UINT64       Callback;                // FUNCT_1507_151C_Callback*             
/*0x040*/     UINT64       Context;                 // VOID*                                 
/*0x048*/     UINT64       OutOfProcessCallbackDll; // WCHAR*                                
/*0x050*/     enum _FUNCTION_TABLE_TYPE Type;                                                
/*0x054*/     ULONG32      EntryCount;                                                       
/*0x058*/     struct _RTL_BALANCED_NODE TreeNode;   // 6 elements, 0x18 bytes (sizeof)       
          }DYNAMIC_FUNCTION_TABLE, *PDYNAMIC_FUNCTION_TABLE;                                         
                                                                                             
typedef struct _ECP_LIST // 0 elements, 0x0 bytes (sizeof) 
{                                                          
}ECP_LIST, *PECP_LIST;                                     
                                                           
          typedef struct _OWNER_ENTRY                        // 6 elements, 0x10 bytes (sizeof) 
          {                                                                                     
/*0x000*/     UINT64       OwnerThread;                                                         
              union                                          // 2 elements, 0x8 bytes (sizeof)  
              {                                                                                 
                  struct                                     // 4 elements, 0x4 bytes (sizeof)  
                  {                                                                             
/*0x008*/             ULONG32      IoPriorityBoosted : 1;    // 0 BitPosition                   
/*0x008*/             ULONG32      OwnerReferenced : 1;      // 1 BitPosition                   
/*0x008*/             ULONG32      IoQoSPriorityBoosted : 1; // 2 BitPosition                   
/*0x008*/             ULONG32      OwnerCount : 29;          // 3 BitPosition                   
                  };                                                                            
/*0x008*/         ULONG32      TableSize;                                                       
              };                                                                                
          }OWNER_ENTRY, *POWNER_ENTRY;                                                          
                                                                                                
          typedef struct _ERESOURCE                   // 17 elements, 0x68 bytes (sizeof) 
          {                                                                               
/*0x000*/     struct _LIST_ENTRY SystemResourcesList; // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/     UINT64       OwnerTable;                // struct _OWNER_ENTRY*             
/*0x018*/     INT16        ActiveCount;                                                   
              union                                   // 2 elements, 0x6 bytes (sizeof)   
              {                                                                           
/*0x01A*/         UINT16       Flag;                                                      
                  struct                              // 2 elements, 0x6 bytes (sizeof)   
                  {                                                                       
/*0x01A*/             UINT8        ReservedLowFlags;                                      
/*0x01B*/             UINT8        WaiterPriority;                                        
/*0x01C*/             UINT8        _PADDING0_[0x4];                                       
                  };                                                                      
              };                                                                          
/*0x020*/     UINT64       SharedWaiters;             // VOID*                            
/*0x028*/     UINT64       ExclusiveWaiters;          // VOID*                            
/*0x030*/     struct _OWNER_ENTRY OwnerEntry;         // 6 elements, 0x10 bytes (sizeof)  
/*0x040*/     ULONG32      ActiveEntries;                                                 
/*0x044*/     ULONG32      ContentionCount;                                               
/*0x048*/     ULONG32      NumberOfSharedWaiters;                                         
/*0x04C*/     ULONG32      NumberOfExclusiveWaiters;                                      
/*0x050*/     UINT64       Reserved2;                 // VOID*                            
              union                                   // 2 elements, 0x8 bytes (sizeof)   
              {                                                                           
/*0x058*/         UINT64       Address;               // VOID*                            
/*0x058*/         UINT64       CreatorBackTraceIndex;                                     
              };                                                                          
/*0x060*/     UINT64       SpinLock;                                                      
          }ERESOURCE, *PERESOURCE;                                                        
                                                                                          
          typedef struct _KAFFINITY_EX // 4 elements, 0xA8 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT16       Count;                                         
/*0x002*/     UINT16       Size;                                          
/*0x004*/     ULONG32      Reserved;                                      
/*0x008*/     UINT64       Bitmap[20];                                    
          }KAFFINITY_EX, *PKAFFINITY_EX;                                   
                                                                          
          typedef struct _PROCESS_DISK_COUNTERS // 5 elements, 0x28 bytes (sizeof) 
          {                                                                        
/*0x000*/     UINT64       BytesRead;                                              
/*0x008*/     UINT64       BytesWritten;                                           
/*0x010*/     UINT64       ReadOperationCount;                                     
/*0x018*/     UINT64       WriteOperationCount;                                    
/*0x020*/     UINT64       FlushOperationCount;                                    
          }PROCESS_DISK_COUNTERS, *PPROCESS_DISK_COUNTERS;                                   
                                                                                   
          typedef struct _WNF_STATE_NAME // 1 elements, 0x8 bytes (sizeof) 
          {                                                                
/*0x000*/     ULONG32      Data[2];                                        
          }WNF_STATE_NAME, *PWNF_STATE_NAME;                                  
                                                                           
          typedef struct _PS_JOB_WAKE_INFORMATION // 3 elements, 0x48 bytes (sizeof) 
          {                                                                          
/*0x000*/     UINT64       NotificationChannel;                                      
/*0x008*/     UINT64       WakeCounters[7];                                          
/*0x040*/     UINT64       NoWakeCounter;                                            
          }PS_JOB_WAKE_INFORMATION, *PPS_JOB_WAKE_INFORMATION;                                   
                                                                                     
          typedef struct _JOBOBJECT_WAKE_FILTER // 2 elements, 0x8 bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      HighEdgeFilter;                                        
/*0x004*/     ULONG32      LowEdgeFilter;                                         
          }JOBOBJECT_WAKE_FILTER, *PJOBOBJECT_WAKE_FILTER;                                  
                                                                                  
          typedef struct _EPROCESS_VALUES       // 11 elements, 0x58 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT64       KernelTime;                                              
/*0x008*/     UINT64       UserTime;                                                
/*0x010*/     UINT64       ReadyTime;                                               
/*0x018*/     UINT64       CycleTime;                                               
/*0x020*/     UINT64       ContextSwitches;                                         
/*0x028*/     INT64        ReadOperationCount;                                      
/*0x030*/     INT64        WriteOperationCount;                                     
/*0x038*/     INT64        OtherOperationCount;                                     
/*0x040*/     INT64        ReadTransferCount;                                       
/*0x048*/     INT64        WriteTransferCount;                                      
/*0x050*/     INT64        OtherTransferCount;                                      
          }EPROCESS_VALUES, *PEPROCESS_VALUES;                                      
                                                                                    
          typedef struct _PS_PROPERTY_SET  // 2 elements, 0x18 bytes (sizeof) 
          {                                                                   
/*0x000*/     struct _LIST_ENTRY ListHead; // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     UINT64       Lock;                                              
          }PS_PROPERTY_SET, *PPS_PROPERTY_SET;                                   
                                                                              
          typedef struct _RTL_BITMAP        // 2 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     ULONG32      SizeOfBitMap;                                       
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     UINT64       Buffer;          // ULONG32*                        
          }RTL_BITMAP, *PRTL_BITMAP;                                           
                                                                               
          typedef struct _JOB_RATE_CONTROL_HEADER     // 4 elements, 0x28 bytes (sizeof) 
          {                                                                              
/*0x000*/     UINT64       RateControlQuotaReference; // VOID*                           
/*0x008*/     struct _RTL_BITMAP OverQuotaHistory;    // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     UINT64       BitMapBuffer;              // UINT8*                          
/*0x020*/     UINT64       BitMapBufferSize;                                             
          }JOB_RATE_CONTROL_HEADER, *PJOB_RATE_CONTROL_HEADER;                                   
                                                                                         
          typedef struct _EX_RUNDOWN_REF // 2 elements, 0x8 bytes (sizeof) 
          {                                                                
              union                      // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         UINT64       Count;                                      
/*0x000*/         UINT64       Ptr;      // VOID*                          
              };                                                           
          }EX_RUNDOWN_REF, *PEX_RUNDOWN_REF;                                  
                                                                           
          typedef struct _PS_IO_CONTROL_ENTRY               // 7 elements, 0x38 bytes (sizeof) 
          {                                                                                    
              union                                         // 2 elements, 0x18 bytes (sizeof) 
              {                                                                                
/*0x000*/         struct _RTL_BALANCED_NODE VolumeTreeNode; // 6 elements, 0x18 bytes (sizeof) 
                  struct                                    // 2 elements, 0x18 bytes (sizeof) 
                  {                                                                            
/*0x000*/             struct _LIST_ENTRY FreeListEntry;     // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/             UINT64       ReservedForParentValue;                                     
                  };                                                                           
              };                                                                               
/*0x018*/     UINT64       VolumeKey;                                                          
/*0x020*/     struct _EX_RUNDOWN_REF Rundown;               // 2 elements, 0x8 bytes (sizeof)  
/*0x028*/     UINT64       IoControl;                       // VOID*                           
/*0x030*/     UINT64       VolumeIoAttribution;             // VOID*                           
          }PS_IO_CONTROL_ENTRY, *PPS_IO_CONTROL_ENTRY;                                         
                                                                                               
          typedef struct _RTL_RB_TREE       // 3 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT64       Root;            // struct _RTL_BALANCED_NODE*      
              union                         // 2 elements, 0x8 bytes (sizeof)  
              {                                                                
/*0x008*/         UINT8        Encoded : 1; // 0 BitPosition                   
/*0x008*/         UINT64       Min;         // struct _RTL_BALANCED_NODE*      
              };                                                               
          }RTL_RB_TREE, *PRTL_RB_TREE;                                         
                                                                               
          typedef struct _WORK_QUEUE_ITEM // 3 elements, 0x20 bytes (sizeof)                                                                            
          {                                                                                                                                             
/*0x000*/     struct _LIST_ENTRY List;    // 2 elements, 0x10 bytes (sizeof)                                                                            
/*0x010*/     UINT64       WorkerRoutine; // FUNCT_00EF_08F6_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure* 
/*0x018*/     UINT64       Parameter;     // VOID*                                                                                                      
          }WORK_QUEUE_ITEM, *PWORK_QUEUE_ITEM;                                                                                                              
                                                                                                                                                        
          typedef union _JOBOBJECT_ENERGY_TRACKING_STATE // 3 elements, 0x8 bytes (sizeof) 
          {                                                                                
/*0x000*/     UINT64       Value;                                                          
              struct                                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                                            
/*0x000*/         ULONG32      UpdateMask;                                                 
/*0x004*/         ULONG32      DesiredState;                                               
              };                                                                           
          }JOBOBJECT_ENERGY_TRACKING_STATE, *PJOBOBJECT_ENERGY_TRACKING_STATE;                                  
                                                                                           
          typedef struct _EJOB                                                  // 153 elements, 0x620 bytes (sizeof)      
          {                                                                                                                
/*0x000*/     struct _KEVENT Event;                                             // 1 elements, 0x18 bytes (sizeof)         
/*0x018*/     struct _LIST_ENTRY JobLinks;                                      // 2 elements, 0x10 bytes (sizeof)         
/*0x028*/     struct _LIST_ENTRY ProcessListHead;                               // 2 elements, 0x10 bytes (sizeof)         
/*0x038*/     struct _ERESOURCE JobLock;                                        // 17 elements, 0x68 bytes (sizeof)        
/*0x0A0*/     union _LARGE_INTEGER TotalUserTime;                               // 4 elements, 0x8 bytes (sizeof)          
/*0x0A8*/     union _LARGE_INTEGER TotalKernelTime;                             // 4 elements, 0x8 bytes (sizeof)          
/*0x0B0*/     union _LARGE_INTEGER TotalCycleTime;                              // 4 elements, 0x8 bytes (sizeof)          
/*0x0B8*/     union _LARGE_INTEGER ThisPeriodTotalUserTime;                     // 4 elements, 0x8 bytes (sizeof)          
/*0x0C0*/     union _LARGE_INTEGER ThisPeriodTotalKernelTime;                   // 4 elements, 0x8 bytes (sizeof)          
/*0x0C8*/     UINT64       TotalContextSwitches;                                                                           
/*0x0D0*/     ULONG32      TotalPageFaultCount;                                                                            
/*0x0D4*/     ULONG32      TotalProcesses;                                                                                 
/*0x0D8*/     ULONG32      ActiveProcesses;                                                                                
/*0x0DC*/     ULONG32      TotalTerminatedProcesses;                                                                       
/*0x0E0*/     union _LARGE_INTEGER PerProcessUserTimeLimit;                     // 4 elements, 0x8 bytes (sizeof)          
/*0x0E8*/     union _LARGE_INTEGER PerJobUserTimeLimit;                         // 4 elements, 0x8 bytes (sizeof)          
/*0x0F0*/     UINT64       MinimumWorkingSetSize;                                                                          
/*0x0F8*/     UINT64       MaximumWorkingSetSize;                                                                          
/*0x100*/     ULONG32      LimitFlags;                                                                                     
/*0x104*/     ULONG32      ActiveProcessLimit;                                                                             
/*0x108*/     struct _KAFFINITY_EX Affinity;                                    // 4 elements, 0xA8 bytes (sizeof)         
/*0x1B0*/     UINT64       AccessState;                                         // struct _JOB_ACCESS_STATE*               
/*0x1B8*/     UINT64       AccessStateQuotaReference;                           // VOID*                                   
/*0x1C0*/     ULONG32      UIRestrictionsClass;                                                                            
/*0x1C4*/     ULONG32      EndOfJobTimeAction;                                                                             
/*0x1C8*/     UINT64       CompletionPort;                                      // VOID*                                   
/*0x1D0*/     UINT64       CompletionKey;                                       // VOID*                                   
/*0x1D8*/     UINT64       CompletionCount;                                                                                
/*0x1E0*/     ULONG32      SessionId;                                                                                      
/*0x1E4*/     ULONG32      SchedulingClass;                                                                                
/*0x1E8*/     UINT64       ReadOperationCount;                                                                             
/*0x1F0*/     UINT64       WriteOperationCount;                                                                            
/*0x1F8*/     UINT64       OtherOperationCount;                                                                            
/*0x200*/     UINT64       ReadTransferCount;                                                                              
/*0x208*/     UINT64       WriteTransferCount;                                                                             
/*0x210*/     UINT64       OtherTransferCount;                                                                             
/*0x218*/     struct _PROCESS_DISK_COUNTERS DiskIoInfo;                         // 5 elements, 0x28 bytes (sizeof)         
/*0x240*/     UINT64       ProcessMemoryLimit;                                                                             
/*0x248*/     UINT64       JobMemoryLimit;                                                                                 
/*0x250*/     UINT64       JobTotalMemoryLimit;                                                                            
/*0x258*/     UINT64       PeakProcessMemoryUsed;                                                                          
/*0x260*/     UINT64       PeakJobMemoryUsed;                                                                              
/*0x268*/     struct _KAFFINITY_EX EffectiveAffinity;                           // 4 elements, 0xA8 bytes (sizeof)         
/*0x310*/     union _LARGE_INTEGER EffectivePerProcessUserTimeLimit;            // 4 elements, 0x8 bytes (sizeof)          
/*0x318*/     UINT64       EffectiveMinimumWorkingSetSize;                                                                 
/*0x320*/     UINT64       EffectiveMaximumWorkingSetSize;                                                                 
/*0x328*/     UINT64       EffectiveProcessMemoryLimit;                                                                    
/*0x330*/     UINT64       EffectiveProcessMemoryLimitJob;                      // struct _EJOB*                           
/*0x338*/     UINT64       EffectivePerProcessUserTimeLimitJob;                 // struct _EJOB*                           
/*0x340*/     UINT64       EffectiveNetIoRateLimitJob;                          // struct _EJOB*                           
/*0x348*/     UINT64       EffectiveHeapAttributionJob;                         // struct _EJOB*                           
/*0x350*/     ULONG32      EffectiveLimitFlags;                                                                            
/*0x354*/     ULONG32      EffectiveSchedulingClass;                                                                       
/*0x358*/     ULONG32      EffectiveFreezeCount;                                                                           
/*0x35C*/     ULONG32      EffectiveBackgroundCount;                                                                       
/*0x360*/     ULONG32      EffectiveSwapCount;                                                                             
/*0x364*/     ULONG32      EffectiveNotificationLimitCount;                                                                
/*0x368*/     UINT8        EffectivePriorityClass;                                                                         
/*0x369*/     UINT8        PriorityClass;                                                                                  
/*0x36A*/     UINT8        NestingDepth;                                                                                   
/*0x36B*/     UINT8        Reserved1[1];                                                                                   
/*0x36C*/     ULONG32      CompletionFilter;                                                                               
              union                                                             // 2 elements, 0x48 bytes (sizeof)         
              {                                                                                                            
/*0x370*/         struct _WNF_STATE_NAME WakeChannel;                           // 1 elements, 0x8 bytes (sizeof)          
/*0x370*/         struct _PS_JOB_WAKE_INFORMATION WakeInfo;                     // 3 elements, 0x48 bytes (sizeof)         
              };                                                                                                           
/*0x3B8*/     struct _JOBOBJECT_WAKE_FILTER WakeFilter;                         // 2 elements, 0x8 bytes (sizeof)          
/*0x3C0*/     ULONG32      LowEdgeLatchFilter;                                                                             
/*0x3C4*/     UINT8        _PADDING0_[0x4];                                                                                
/*0x3C8*/     UINT64       NotificationLink;                                    // struct _EJOB*                           
/*0x3D0*/     UINT64       CurrentJobMemoryUsed;                                                                           
/*0x3D8*/     UINT64       NotificationInfo;                                    // struct _JOB_NOTIFICATION_INFORMATION*   
/*0x3E0*/     UINT64       NotificationInfoQuotaReference;                      // VOID*                                   
/*0x3E8*/     UINT64       NotificationPacket;                                  // struct _IO_MINI_COMPLETION_PACKET_USER* 
/*0x3F0*/     UINT64       CpuRateControl;                                      // struct _JOB_CPU_RATE_CONTROL*           
/*0x3F8*/     UINT64       EffectiveSchedulingGroup;                            // VOID*                                   
/*0x400*/     UINT64       ReadyTime;                                                                                      
/*0x408*/     struct _EX_PUSH_LOCK MemoryLimitsLock;                            // 7 elements, 0x8 bytes (sizeof)          
/*0x410*/     struct _LIST_ENTRY SiblingJobLinks;                               // 2 elements, 0x10 bytes (sizeof)         
/*0x420*/     struct _LIST_ENTRY ChildJobListHead;                              // 2 elements, 0x10 bytes (sizeof)         
/*0x430*/     UINT64       ParentJob;                                           // struct _EJOB*                           
/*0x438*/     UINT64       RootJob;                                             // struct _EJOB*                           
/*0x440*/     struct _LIST_ENTRY IteratorListHead;                              // 2 elements, 0x10 bytes (sizeof)         
/*0x450*/     UINT64       AncestorCount;                                                                                  
              union                                                             // 2 elements, 0x8 bytes (sizeof)          
              {                                                                                                            
/*0x458*/         UINT64       Ancestors;                                       // struct _EJOB**                          
/*0x458*/         UINT64       SessionObject;                                   // VOID*                                   
              };                                                                                                           
/*0x460*/     struct _EPROCESS_VALUES Accounting;                               // 11 elements, 0x58 bytes (sizeof)        
/*0x4B8*/     ULONG32      ShadowActiveProcessCount;                                                                       
/*0x4BC*/     ULONG32      ActiveAuxiliaryProcessCount;                                                                    
/*0x4C0*/     ULONG32      SequenceNumber;                                                                                 
/*0x4C4*/     ULONG32      JobId;                                                                                          
/*0x4C8*/     struct _GUID ContainerId;                                         // 4 elements, 0x10 bytes (sizeof)         
/*0x4D8*/     struct _GUID ContainerTelemetryId;                                // 4 elements, 0x10 bytes (sizeof)         
/*0x4E8*/     UINT64       ServerSiloGlobals;                                   // struct _ESERVERSILO_GLOBALS*            
/*0x4F0*/     struct _PS_PROPERTY_SET PropertySet;                              // 2 elements, 0x18 bytes (sizeof)         
/*0x508*/     UINT64       Storage;                                             // struct _PSP_STORAGE*                    
/*0x510*/     UINT64       NetRateControl;                                      // struct _JOB_NET_RATE_CONTROL*           
              union                                                             // 2 elements, 0x4 bytes (sizeof)          
              {                                                                                                            
/*0x518*/         ULONG32      JobFlags;                                                                                   
                  struct                                                        // 32 elements, 0x4 bytes (sizeof)         
                  {                                                                                                        
/*0x518*/             ULONG32      CloseDone : 1;                               // 0 BitPosition                           
/*0x518*/             ULONG32      MultiGroup : 1;                              // 1 BitPosition                           
/*0x518*/             ULONG32      OutstandingNotification : 1;                 // 2 BitPosition                           
/*0x518*/             ULONG32      NotificationInProgress : 1;                  // 3 BitPosition                           
/*0x518*/             ULONG32      UILimits : 1;                                // 4 BitPosition                           
/*0x518*/             ULONG32      CpuRateControlActive : 1;                    // 5 BitPosition                           
/*0x518*/             ULONG32      OwnCpuRateControl : 1;                       // 6 BitPosition                           
/*0x518*/             ULONG32      Terminating : 1;                             // 7 BitPosition                           
/*0x518*/             ULONG32      WorkingSetLock : 1;                          // 8 BitPosition                           
/*0x518*/             ULONG32      JobFrozen : 1;                               // 9 BitPosition                           
/*0x518*/             ULONG32      Background : 1;                              // 10 BitPosition                          
/*0x518*/             ULONG32      WakeNotificationAllocated : 1;               // 11 BitPosition                          
/*0x518*/             ULONG32      WakeNotificationEnabled : 1;                 // 12 BitPosition                          
/*0x518*/             ULONG32      WakeNotificationPending : 1;                 // 13 BitPosition                          
/*0x518*/             ULONG32      LimitNotificationRequired : 1;               // 14 BitPosition                          
/*0x518*/             ULONG32      ZeroCountNotificationRequired : 1;           // 15 BitPosition                          
/*0x518*/             ULONG32      CycleTimeNotificationRequired : 1;           // 16 BitPosition                          
/*0x518*/             ULONG32      CycleTimeNotificationPending : 1;            // 17 BitPosition                          
/*0x518*/             ULONG32      TimersVirtualized : 1;                       // 18 BitPosition                          
/*0x518*/             ULONG32      JobSwapped : 1;                              // 19 BitPosition                          
/*0x518*/             ULONG32      ViolationDetected : 1;                       // 20 BitPosition                          
/*0x518*/             ULONG32      EmptyJobNotified : 1;                        // 21 BitPosition                          
/*0x518*/             ULONG32      NoSystemCharge : 1;                          // 22 BitPosition                          
/*0x518*/             ULONG32      DropNoWakeCharges : 1;                       // 23 BitPosition                          
/*0x518*/             ULONG32      NoWakeChargePolicyDecided : 1;               // 24 BitPosition                          
/*0x518*/             ULONG32      NetRateControlActive : 1;                    // 25 BitPosition                          
/*0x518*/             ULONG32      OwnNetRateControl : 1;                       // 26 BitPosition                          
/*0x518*/             ULONG32      IoRateControlActive : 1;                     // 27 BitPosition                          
/*0x518*/             ULONG32      OwnIoRateControl : 1;                        // 28 BitPosition                          
/*0x518*/             ULONG32      DisallowNewProcesses : 1;                    // 29 BitPosition                          
/*0x518*/             ULONG32      Silo : 1;                                    // 30 BitPosition                          
/*0x518*/             ULONG32      ContainerTelemetryIdSet : 1;                 // 31 BitPosition                          
                  };                                                                                                       
              };                                                                                                           
              union                                                             // 2 elements, 0x4 bytes (sizeof)          
              {                                                                                                            
/*0x51C*/         ULONG32      JobFlags2;                                                                                  
                  struct                                                        // 3 elements, 0x4 bytes (sizeof)          
                  {                                                                                                        
/*0x51C*/             ULONG32      ParentLocked : 1;                            // 0 BitPosition                           
/*0x51C*/             ULONG32      EnableUsermodeSiloThreadImpersonation : 1;   // 1 BitPosition                           
/*0x51C*/             ULONG32      DisallowUsermodeSiloThreadImpersonation : 1; // 2 BitPosition                           
                  };                                                                                                       
              };                                                                                                           
/*0x520*/     UINT64       EnergyValues;                                        // struct _PROCESS_EXTENDED_ENERGY_VALUES* 
/*0x528*/     UINT64       SharedCommitCharge;                                                                             
/*0x530*/     ULONG32      DiskIoAttributionUserRefCount;                                                                  
/*0x534*/     ULONG32      DiskIoAttributionRefCount;                                                                      
              union                                                             // 2 elements, 0x8 bytes (sizeof)          
              {                                                                                                            
/*0x538*/         UINT64       DiskIoAttributionContext;                        // VOID*                                   
/*0x538*/         UINT64       DiskIoAttributionOwnerJob;                       // struct _EJOB*                           
              };                                                                                                           
/*0x540*/     struct _JOB_RATE_CONTROL_HEADER IoRateControlHeader;              // 4 elements, 0x28 bytes (sizeof)         
/*0x568*/     struct _PS_IO_CONTROL_ENTRY GlobalIoControl;                      // 7 elements, 0x38 bytes (sizeof)         
/*0x5A0*/     LONG32       IoControlStateLock;                                                                             
/*0x5A4*/     UINT8        _PADDING1_[0x4];                                                                                
/*0x5A8*/     struct _RTL_RB_TREE VolumeIoControlTree;                          // 3 elements, 0x10 bytes (sizeof)         
/*0x5B8*/     UINT64       IoRateOverQuotaHistory;                                                                         
/*0x5C0*/     ULONG32      IoRateCurrentGeneration;                                                                        
/*0x5C4*/     ULONG32      IoRateLastQueryGeneration;                                                                      
/*0x5C8*/     ULONG32      IoRateGenerationLength;                                                                         
/*0x5CC*/     ULONG32      IoRateOverQuotaNotifySequenceId;                                                                
/*0x5D0*/     UINT64       LastThrottledIoTime;                                                                            
/*0x5D8*/     struct _EX_PUSH_LOCK IoControlLock;                               // 7 elements, 0x8 bytes (sizeof)          
/*0x5E0*/     UINT64       SiloHardReferenceCount;                                                                         
/*0x5E8*/     struct _WORK_QUEUE_ITEM RundownWorkItem;                          // 3 elements, 0x20 bytes (sizeof)         
/*0x608*/     UINT64       PartitionObject;                                     // VOID*                                   
/*0x610*/     UINT64       PartitionOwnerJob;                                   // struct _EJOB*                           
/*0x618*/     union _JOBOBJECT_ENERGY_TRACKING_STATE EnergyTrackingState;       // 3 elements, 0x8 bytes (sizeof)          
          }EJOB, *PEJOB;                                                                                                   
                                                                                                                           
          typedef union _ENERGY_STATE_DURATION    // 4 elements, 0x8 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT64       Value;                                                   
              struct                              // 1 elements, 0x8 bytes (sizeof) 
              {                                                                     
/*0x000*/         ULONG32      LastChangeTime;                                      
                  struct                          // 2 elements, 0x4 bytes (sizeof) 
                  {                                                                 
/*0x004*/             ULONG32      Duration : 31; // 0 BitPosition                  
/*0x004*/             ULONG32      IsInState : 1; // 31 BitPosition                 
                  };                                                                
              };                                                                    
          }ENERGY_STATE_DURATION, *PENERGY_STATE_DURATION;                                  
                                                                                    
          typedef struct _GROUP_AFFINITY // 3 elements, 0x10 bytes (sizeof) 
          {                                                                 
/*0x000*/     UINT64       Mask;                                            
/*0x008*/     UINT16       Group;                                           
/*0x00A*/     UINT16       Reserved[3];                                     
          }GROUP_AFFINITY, *PGROUP_AFFINITY;                                   
                                                                            
          typedef struct _flags                      // 5 elements, 0x1 bytes (sizeof) 
          {                                                                            
/*0x000*/     UINT8        Removable : 1;            // 0 BitPosition                  
/*0x000*/     UINT8        GroupAssigned : 1;        // 1 BitPosition                  
/*0x000*/     UINT8        GroupCommitted : 1;       // 2 BitPosition                  
/*0x000*/     UINT8        GroupAssignmentFixed : 1; // 3 BitPosition                  
/*0x000*/     UINT8        Fill : 4;                 // 4 BitPosition                  
          }flags, *Pflags;                                                             
                                                                                       
          typedef struct _KHETERO_PROCESSOR_SET // 3 elements, 0x18 bytes (sizeof) 
          {                                                                        
/*0x000*/     UINT64       IdealMask;                                              
/*0x008*/     UINT64       PreferredMask;                                          
/*0x010*/     UINT64       AvailableMask;                                          
          }KHETERO_PROCESSOR_SET, *PKHETERO_PROCESSOR_SET;                                   
                                                                                   
          typedef struct _KNODE                            // 25 elements, 0x180 bytes (sizeof) 
          {                                                                                     
/*0x000*/     UINT64       IdleNonParkedCpuSet;                                                 
/*0x008*/     UINT64       IdleSmtSet;                                                          
/*0x010*/     UINT64       IdleCpuSet;                                                          
/*0x018*/     UINT8        _PADDING0_[0x28];                                                    
/*0x040*/     UINT64       DeepIdleSet;                                                         
/*0x048*/     UINT64       IdleConstrainedSet;                                                  
/*0x050*/     UINT64       NonParkedSet;                                                        
/*0x058*/     UINT64       NonIsrTargetedSet;                                                   
/*0x060*/     LONG32       ParkLock;                                                            
/*0x064*/     ULONG32      Seed;                                                                
/*0x068*/     UINT8        _PADDING1_[0x18];                                                    
/*0x080*/     ULONG32      SiblingMask;                                                         
/*0x084*/     UINT8        _PADDING2_[0x4];                                                     
              union                                        // 2 elements, 0x10 bytes (sizeof)   
              {                                                                                 
/*0x088*/         struct _GROUP_AFFINITY Affinity;         // 3 elements, 0x10 bytes (sizeof)   
                  struct                                   // 5 elements, 0x10 bytes (sizeof)   
                  {                                                                             
/*0x088*/             UINT8        AffinityFill[10];                                            
/*0x092*/             UINT16       NodeNumber;                                                  
/*0x094*/             UINT16       PrimaryNodeNumber;                                           
/*0x096*/             UINT8        Stride;                                                      
/*0x097*/             UINT8        Spare0;                                                      
                  };                                                                            
              };                                                                                
/*0x098*/     UINT64       SharedReadyQueueLeaders;                                             
/*0x0A0*/     ULONG32      ProximityId;                                                         
/*0x0A4*/     ULONG32      Lowest;                                                              
/*0x0A8*/     ULONG32      Highest;                                                             
/*0x0AC*/     UINT8        MaximumProcessors;                                                   
/*0x0AD*/     struct _flags Flags;                         // 5 elements, 0x1 bytes (sizeof)    
/*0x0AE*/     UINT8        Spare10;                                                             
/*0x0AF*/     UINT8        _PADDING3_[0x1];                                                     
/*0x0B0*/     struct _KHETERO_PROCESSOR_SET HeteroSets[5];                                      
/*0x128*/     UINT64       PpmConfiguredQosSets[4];                                             
/*0x148*/     UINT8        _PADDING4_[0x38];                                                    
          }KNODE, *PKNODE;                                                                      
                                                                                                
          typedef struct _ENODE                                // 2 elements, 0x1C0 bytes (sizeof)  
          {                                                                                         
/*0x000*/     struct _KNODE Ncb;                               // 25 elements, 0x180 bytes (sizeof) 
/*0x180*/     struct _WORK_QUEUE_ITEM HotAddProcessorWorkItem; // 3 elements, 0x20 bytes (sizeof)   
/*0x1A0*/     UINT8        _PADDING0_[0x20];                                                        
          }ENODE, *PENODE;                                                                          
                                                                                                    
          typedef union _KEXECUTE_OPTIONS                           // 10 elements, 0x1 bytes (sizeof) 
          {                                                                                            
              struct                                                // 8 elements, 0x1 bytes (sizeof)  
              {                                                                                        
/*0x000*/         UINT8        ExecuteDisable : 1;                  // 0 BitPosition                   
/*0x000*/         UINT8        ExecuteEnable : 1;                   // 1 BitPosition                   
/*0x000*/         UINT8        DisableThunkEmulation : 1;           // 2 BitPosition                   
/*0x000*/         UINT8        Permanent : 1;                       // 3 BitPosition                   
/*0x000*/         UINT8        ExecuteDispatchEnable : 1;           // 4 BitPosition                   
/*0x000*/         UINT8        ImageDispatchEnable : 1;             // 5 BitPosition                   
/*0x000*/         UINT8        DisableExceptionChainValidation : 1; // 6 BitPosition                   
/*0x000*/         UINT8        Spare : 1;                           // 7 BitPosition                   
              };                                                                                       
/*0x000*/     UINT8        ExecuteOptions;                                                             
/*0x000*/     UINT8        ExecuteOptionsNV;                                                           
          }KEXECUTE_OPTIONS, *PKEXECUTE_OPTIONS;                                                       
                                                                                                       
          typedef union _KSTACK_COUNT           // 3 elements, 0x4 bytes (sizeof) 
          {                                                                       
/*0x000*/     LONG32       Value;                                                 
              struct                            // 2 elements, 0x4 bytes (sizeof) 
              {                                                                   
/*0x000*/         ULONG32      State : 3;       // 0 BitPosition                  
/*0x000*/         ULONG32      StackCount : 29; // 3 BitPosition                  
              };                                                                  
          }KSTACK_COUNT, *PKSTACK_COUNT;                                          
                                                                                  
          typedef struct _KPROCESS                            // 45 elements, 0x2D8 bytes (sizeof) 
          {                                                                                        
/*0x000*/     struct _DISPATCHER_HEADER Header;               // 58 elements, 0x18 bytes (sizeof)  
/*0x018*/     struct _LIST_ENTRY ProfileListHead;             // 2 elements, 0x10 bytes (sizeof)   
/*0x028*/     UINT64       DirectoryTableBase;                                                     
/*0x030*/     struct _LIST_ENTRY ThreadListHead;              // 2 elements, 0x10 bytes (sizeof)   
/*0x040*/     ULONG32      ProcessLock;                                                            
/*0x044*/     ULONG32      ProcessTimerDelay;                                                      
/*0x048*/     UINT64       DeepFreezeStartTime;                                                    
/*0x050*/     struct _KAFFINITY_EX Affinity;                  // 4 elements, 0xA8 bytes (sizeof)   
/*0x0F8*/     struct _LIST_ENTRY ReadyListHead;               // 2 elements, 0x10 bytes (sizeof)   
/*0x108*/     struct _SINGLE_LIST_ENTRY SwapListEntry;        // 1 elements, 0x8 bytes (sizeof)    
/*0x110*/     struct _KAFFINITY_EX ActiveProcessors;          // 4 elements, 0xA8 bytes (sizeof)   
              union                                           // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                    
                  struct                                      // 11 elements, 0x4 bytes (sizeof)   
                  {                                                                                
/*0x1B8*/             ULONG32      AutoAlignment : 1;         // 0 BitPosition                     
/*0x1B8*/             ULONG32      DisableBoost : 1;          // 1 BitPosition                     
/*0x1B8*/             ULONG32      DisableQuantum : 1;        // 2 BitPosition                     
/*0x1B8*/             ULONG32      DeepFreeze : 1;            // 3 BitPosition                     
/*0x1B8*/             ULONG32      TimerVirtualization : 1;   // 4 BitPosition                     
/*0x1B8*/             ULONG32      CheckStackExtents : 1;     // 5 BitPosition                     
/*0x1B8*/             ULONG32      CacheIsolationEnabled : 1; // 6 BitPosition                     
/*0x1B8*/             ULONG32      PpmPolicy : 3;             // 7 BitPosition                     
/*0x1B8*/             ULONG32      ActiveGroupsMask : 20;     // 10 BitPosition                    
/*0x1B8*/             ULONG32      VaSpaceDeleted : 1;        // 30 BitPosition                    
/*0x1B8*/             ULONG32      ReservedFlags : 1;         // 31 BitPosition                    
                  };                                                                               
/*0x1B8*/         LONG32       ProcessFlags;                                                       
              };                                                                                   
/*0x1BC*/     CHAR         BasePriority;                                                           
/*0x1BD*/     CHAR         QuantumReset;                                                           
/*0x1BE*/     CHAR         Visited;                                                                
/*0x1BF*/     union _KEXECUTE_OPTIONS Flags;                  // 10 elements, 0x1 bytes (sizeof)   
/*0x1C0*/     ULONG32      ThreadSeed[20];                                                         
/*0x210*/     UINT16       IdealNode[20];                                                          
/*0x238*/     UINT16       IdealGlobalNode;                                                        
/*0x23A*/     UINT16       Spare1;                                                                 
/*0x23C*/     union _KSTACK_COUNT StackCount;                 // 3 elements, 0x4 bytes (sizeof)    
/*0x240*/     struct _LIST_ENTRY ProcessListEntry;            // 2 elements, 0x10 bytes (sizeof)   
/*0x250*/     UINT64       CycleTime;                                                              
/*0x258*/     UINT64       ContextSwitches;                                                        
/*0x260*/     UINT64       SchedulingGroup;                   // struct _KSCHEDULING_GROUP*        
/*0x268*/     ULONG32      FreezeCount;                                                            
/*0x26C*/     ULONG32      KernelTime;                                                             
/*0x270*/     ULONG32      UserTime;                                                               
/*0x274*/     ULONG32      ReadyTime;                                                              
/*0x278*/     UINT64       UserDirectoryTableBase;                                                 
/*0x280*/     UINT8        AddressPolicy;                                                          
/*0x281*/     UINT8        Spare2[71];                                                             
/*0x2C8*/     UINT64       InstrumentationCallback;           // VOID*                             
              union                                           // 2 elements, 0x8 bytes (sizeof)    
              {                                                                                    
/*0x2D0*/         UINT64       SecureHandle;                                                       
                  struct                                      // 2 elements, 0x8 bytes (sizeof)    
                  {                                                                                
/*0x2D0*/             UINT64       SecureProcess : 1;         // 0 BitPosition                     
/*0x2D0*/             UINT64       Unused : 1;                // 1 BitPosition                     
                  }Flags;                                                                          
              }SecureState;                                                                        
          }KPROCESS, *PKPROCESS;                                                                   
                                                                                                   
          typedef struct _EX_FAST_REF      // 3 elements, 0x8 bytes (sizeof) 
          {                                                                  
              union                        // 3 elements, 0x8 bytes (sizeof) 
              {                                                              
/*0x000*/         UINT64       Object;     // VOID*                          
/*0x000*/         UINT64       RefCnt : 4; // 0 BitPosition                  
/*0x000*/         UINT64       Value;                                        
              };                                                             
          }EX_FAST_REF, *PEX_FAST_REF;                                       
                                                                             
          typedef struct _RTL_AVL_TREE // 1 elements, 0x8 bytes (sizeof) 
          {                                                              
/*0x000*/     UINT64       Root;       // struct _RTL_BALANCED_NODE*     
          }RTL_AVL_TREE, *PRTL_AVL_TREE;                                  
                                                                         
          typedef struct _SE_AUDIT_PROCESS_CREATION_INFO // 1 elements, 0x8 bytes (sizeof)   
          {                                                                                  
/*0x000*/     UINT64       ImageFileName;                // struct _OBJECT_NAME_INFORMATION* 
          }SE_AUDIT_PROCESS_CREATION_INFO, *PSE_AUDIT_PROCESS_CREATION_INFO;                                    
                                                                                             
          typedef struct _MMSUPPORT_FLAGS                         // 17 elements, 0x4 bytes (sizeof) 
          {                                                                                          
              union                                               // 2 elements, 0x2 bytes (sizeof)  
              {                                                                                      
                  struct                                          // 2 elements, 0x2 bytes (sizeof)  
                  {                                                                                  
                      struct                                      // 4 elements, 0x1 bytes (sizeof)  
                      {                                                                              
/*0x000*/                 UINT8        WorkingSetType : 3;        // 0 BitPosition                   
/*0x000*/                 UINT8        Reserved0 : 3;             // 3 BitPosition                   
/*0x000*/                 UINT8        MaximumWorkingSetHard : 1; // 6 BitPosition                   
/*0x000*/                 UINT8        MinimumWorkingSetHard : 1; // 7 BitPosition                   
                      };                                                                             
                      struct                                      // 4 elements, 0x1 bytes (sizeof)  
                      {                                                                              
/*0x001*/                 UINT8        SessionMaster : 1;         // 0 BitPosition                   
/*0x001*/                 UINT8        TrimmerState : 2;          // 1 BitPosition                   
/*0x001*/                 UINT8        Reserved : 1;              // 3 BitPosition                   
/*0x001*/                 UINT8        PageStealers : 4;          // 4 BitPosition                   
                      };                                                                             
                  };                                                                                 
/*0x000*/         UINT16       u1;                                                                   
              };                                                                                     
/*0x002*/     UINT8        MemoryPriority;                                                           
              union                                               // 2 elements, 0x1 bytes (sizeof)  
              {                                                                                      
                  struct                                          // 6 elements, 0x1 bytes (sizeof)  
                  {                                                                                  
/*0x003*/             UINT8        WsleDeleted : 1;               // 0 BitPosition                   
/*0x003*/             UINT8        SvmEnabled : 1;                // 1 BitPosition                   
/*0x003*/             UINT8        ForceAge : 1;                  // 2 BitPosition                   
/*0x003*/             UINT8        ForceTrim : 1;                 // 3 BitPosition                   
/*0x003*/             UINT8        NewMaximum : 1;                // 4 BitPosition                   
/*0x003*/             UINT8        CommitReleaseState : 2;        // 5 BitPosition                   
                  };                                                                                 
/*0x003*/         UINT8        u2;                                                                   
              };                                                                                     
          }MMSUPPORT_FLAGS, *PMMSUPPORT_FLAGS;                                                       
                                                                                                     
          typedef struct _MMSUPPORT_INSTANCE               // 19 elements, 0xC0 bytes (sizeof) 
          {                                                                                    
/*0x000*/     ULONG32      NextPageColor;                                                      
/*0x004*/     ULONG32      PageFaultCount;                                                     
/*0x008*/     UINT64       TrimmedPageCount;                                                   
/*0x010*/     UINT64       VmWorkingSetList;               // struct _MMWSL_INSTANCE*          
/*0x018*/     struct _LIST_ENTRY WorkingSetExpansionLinks; // 2 elements, 0x10 bytes (sizeof)  
/*0x028*/     UINT64       AgeDistribution[8];                                                 
/*0x068*/     UINT64       ExitOutswapGate;                // struct _KGATE*                   
/*0x070*/     UINT64       MinimumWorkingSetSize;                                              
/*0x078*/     UINT64       WorkingSetLeafSize;                                                 
/*0x080*/     UINT64       WorkingSetLeafPrivateSize;                                          
/*0x088*/     UINT64       WorkingSetSize;                                                     
/*0x090*/     UINT64       WorkingSetPrivateSize;                                              
/*0x098*/     UINT64       MaximumWorkingSetSize;                                              
/*0x0A0*/     UINT64       PeakWorkingSetSize;                                                 
/*0x0A8*/     ULONG32      HardFaultCount;                                                     
/*0x0AC*/     UINT16       LastTrimStamp;                                                      
/*0x0AE*/     UINT16       PartitionId;                                                        
/*0x0B0*/     UINT64       SelfmapLock;                                                        
/*0x0B8*/     struct _MMSUPPORT_FLAGS Flags;               // 17 elements, 0x4 bytes (sizeof)  
/*0x0BC*/     UINT8        _PADDING0_[0x4];                                                    
          }MMSUPPORT_INSTANCE, *PMMSUPPORT_INSTANCE;                                           
                                                                                               
          typedef struct _MMSUPPORT_SHARED            // 11 elements, 0x50 bytes (sizeof) 
          {                                                                               
/*0x000*/     LONG32       WorkingSetLock;                                                
/*0x004*/     LONG32       GoodCitizenWaiting;                                            
/*0x008*/     UINT64       ReleasedCommitDebt;                                            
/*0x010*/     UINT64       ResetPagesRepurposedCount;                                     
/*0x018*/     UINT64       WsSwapSupport;             // VOID*                            
/*0x020*/     UINT64       CommitReleaseContext;      // VOID*                            
/*0x028*/     LONG32       WorkingSetCoreLock;                                            
/*0x02C*/     UINT8        _PADDING0_[0x4];                                               
/*0x030*/     UINT64       AccessLog;                 // VOID*                            
/*0x038*/     UINT64       ChargedWslePages;                                              
/*0x040*/     UINT64       ActualWslePages;                                               
/*0x048*/     UINT64       ShadowMapping;             // VOID*                            
          }MMSUPPORT_SHARED, *PMMSUPPORT_SHARED;                                          
                                                                                          
          typedef struct _MMSUPPORT_FULL           // 2 elements, 0x110 bytes (sizeof) 
          {                                                                            
/*0x000*/     struct _MMSUPPORT_INSTANCE Instance; // 19 elements, 0xC0 bytes (sizeof) 
/*0x0C0*/     struct _MMSUPPORT_SHARED Shared;     // 11 elements, 0x50 bytes (sizeof) 
          }MMSUPPORT_FULL, *PMMSUPPORT_FULL;                                           
                                                                                       
          typedef struct _PS_PROTECTION        // 4 elements, 0x1 bytes (sizeof) 
          {                                                                      
              union                            // 2 elements, 0x1 bytes (sizeof) 
              {                                                                  
/*0x000*/         UINT8        Level;                                            
                  struct                       // 3 elements, 0x1 bytes (sizeof) 
                  {                                                              
/*0x000*/             UINT8        Type : 3;   // 0 BitPosition                  
/*0x000*/             UINT8        Audit : 1;  // 3 BitPosition                  
/*0x000*/             UINT8        Signer : 4; // 4 BitPosition                  
                  };                                                             
              };                                                                 
          }PS_PROTECTION, *PPS_PROTECTION;                                       
                                                                                 
          typedef union _PS_INTERLOCKED_TIMER_DELAY_VALUES // 7 elements, 0x8 bytes (sizeof) 
          {                                                                                  
              struct                                       // 6 elements, 0x8 bytes (sizeof) 
              {                                                                              
/*0x000*/         UINT64       DelayMs : 30;               // 0 BitPosition                  
/*0x000*/         UINT64       CoalescingWindowMs : 30;    // 30 BitPosition                 
/*0x000*/         UINT64       Reserved : 1;               // 60 BitPosition                 
/*0x000*/         UINT64       NewTimerWheel : 1;          // 61 BitPosition                 
/*0x000*/         UINT64       Retry : 1;                  // 62 BitPosition                 
/*0x000*/         UINT64       Locked : 1;                 // 63 BitPosition                 
              };                                                                             
/*0x000*/     UINT64       All;                                                              
          }PS_INTERLOCKED_TIMER_DELAY_VALUES, *PPS_INTERLOCKED_TIMER_DELAY_VALUES;                                  
                                                                                             
          typedef struct _PS_PROCESS_WAKE_INFORMATION   // 4 elements, 0x30 bytes (sizeof) 
          {                                                                                
/*0x000*/     UINT64       NotificationChannel;                                            
/*0x008*/     ULONG32      WakeCounters[7];                                                
/*0x024*/     struct _JOBOBJECT_WAKE_FILTER WakeFilter; // 2 elements, 0x8 bytes (sizeof)  
/*0x02C*/     ULONG32      NoWakeCounter;                                                  
          }PS_PROCESS_WAKE_INFORMATION, *PPS_PROCESS_WAKE_INFORMATION;                                   
                                                                                           
          typedef struct _EPROCESS                                               // 227 elements, 0x850 bytes (sizeof) 
          {                                                                                                            
/*0x000*/     struct _KPROCESS Pcb;                                              // 45 elements, 0x2D8 bytes (sizeof)  
/*0x2D8*/     struct _EX_PUSH_LOCK ProcessLock;                                  // 7 elements, 0x8 bytes (sizeof)     
/*0x2E0*/     UINT64       UniqueProcessId;                                      // VOID*                              
/*0x2E8*/     struct _LIST_ENTRY ActiveProcessLinks;                             // 2 elements, 0x10 bytes (sizeof)    
/*0x2F8*/     struct _EX_RUNDOWN_REF RundownProtect;                             // 2 elements, 0x8 bytes (sizeof)     
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x300*/         ULONG32      Flags2;                                                                                 
                  struct                                                         // 28 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x300*/             ULONG32      JobNotReallyActive : 1;                       // 0 BitPosition                      
/*0x300*/             ULONG32      AccountingFolded : 1;                         // 1 BitPosition                      
/*0x300*/             ULONG32      NewProcessReported : 1;                       // 2 BitPosition                      
/*0x300*/             ULONG32      ExitProcessReported : 1;                      // 3 BitPosition                      
/*0x300*/             ULONG32      ReportCommitChanges : 1;                      // 4 BitPosition                      
/*0x300*/             ULONG32      LastReportMemory : 1;                         // 5 BitPosition                      
/*0x300*/             ULONG32      ForceWakeCharge : 1;                          // 6 BitPosition                      
/*0x300*/             ULONG32      CrossSessionCreate : 1;                       // 7 BitPosition                      
/*0x300*/             ULONG32      NeedsHandleRundown : 1;                       // 8 BitPosition                      
/*0x300*/             ULONG32      RefTraceEnabled : 1;                          // 9 BitPosition                      
/*0x300*/             ULONG32      PicoCreated : 1;                              // 10 BitPosition                     
/*0x300*/             ULONG32      EmptyJobEvaluated : 1;                        // 11 BitPosition                     
/*0x300*/             ULONG32      DefaultPagePriority : 3;                      // 12 BitPosition                     
/*0x300*/             ULONG32      PrimaryTokenFrozen : 1;                       // 15 BitPosition                     
/*0x300*/             ULONG32      ProcessVerifierTarget : 1;                    // 16 BitPosition                     
/*0x300*/             ULONG32      RestrictSetThreadContext : 1;                 // 17 BitPosition                     
/*0x300*/             ULONG32      AffinityPermanent : 1;                        // 18 BitPosition                     
/*0x300*/             ULONG32      AffinityUpdateEnable : 1;                     // 19 BitPosition                     
/*0x300*/             ULONG32      PropagateNode : 1;                            // 20 BitPosition                     
/*0x300*/             ULONG32      ExplicitAffinity : 1;                         // 21 BitPosition                     
/*0x300*/             ULONG32      ProcessExecutionState : 2;                    // 22 BitPosition                     
/*0x300*/             ULONG32      EnableReadVmLogging : 1;                      // 24 BitPosition                     
/*0x300*/             ULONG32      EnableWriteVmLogging : 1;                     // 25 BitPosition                     
/*0x300*/             ULONG32      FatalAccessTerminationRequested : 1;          // 26 BitPosition                     
/*0x300*/             ULONG32      DisableSystemAllowedCpuSet : 1;               // 27 BitPosition                     
/*0x300*/             ULONG32      ProcessStateChangeRequest : 2;                // 28 BitPosition                     
/*0x300*/             ULONG32      ProcessStateChangeInProgress : 1;             // 30 BitPosition                     
/*0x300*/             ULONG32      InPrivate : 1;                                // 31 BitPosition                     
                  };                                                                                                   
              };                                                                                                       
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x304*/         ULONG32      Flags;                                                                                  
                  struct                                                         // 29 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x304*/             ULONG32      CreateReported : 1;                           // 0 BitPosition                      
/*0x304*/             ULONG32      NoDebugInherit : 1;                           // 1 BitPosition                      
/*0x304*/             ULONG32      ProcessExiting : 1;                           // 2 BitPosition                      
/*0x304*/             ULONG32      ProcessDelete : 1;                            // 3 BitPosition                      
/*0x304*/             ULONG32      ManageExecutableMemoryWrites : 1;             // 4 BitPosition                      
/*0x304*/             ULONG32      VmDeleted : 1;                                // 5 BitPosition                      
/*0x304*/             ULONG32      OutswapEnabled : 1;                           // 6 BitPosition                      
/*0x304*/             ULONG32      Outswapped : 1;                               // 7 BitPosition                      
/*0x304*/             ULONG32      FailFastOnCommitFail : 1;                     // 8 BitPosition                      
/*0x304*/             ULONG32      Wow64VaSpace4Gb : 1;                          // 9 BitPosition                      
/*0x304*/             ULONG32      AddressSpaceInitialized : 2;                  // 10 BitPosition                     
/*0x304*/             ULONG32      SetTimerResolution : 1;                       // 12 BitPosition                     
/*0x304*/             ULONG32      BreakOnTermination : 1;                       // 13 BitPosition                     
/*0x304*/             ULONG32      DeprioritizeViews : 1;                        // 14 BitPosition                     
/*0x304*/             ULONG32      WriteWatch : 1;                               // 15 BitPosition                     
/*0x304*/             ULONG32      ProcessInSession : 1;                         // 16 BitPosition                     
/*0x304*/             ULONG32      OverrideAddressSpace : 1;                     // 17 BitPosition                     
/*0x304*/             ULONG32      HasAddressSpace : 1;                          // 18 BitPosition                     
/*0x304*/             ULONG32      LaunchPrefetched : 1;                         // 19 BitPosition                     
/*0x304*/             ULONG32      Background : 1;                               // 20 BitPosition                     
/*0x304*/             ULONG32      VmTopDown : 1;                                // 21 BitPosition                     
/*0x304*/             ULONG32      ImageNotifyDone : 1;                          // 22 BitPosition                     
/*0x304*/             ULONG32      PdeUpdateNeeded : 1;                          // 23 BitPosition                     
/*0x304*/             ULONG32      VdmAllowed : 1;                               // 24 BitPosition                     
/*0x304*/             ULONG32      ProcessRundown : 1;                           // 25 BitPosition                     
/*0x304*/             ULONG32      ProcessInserted : 1;                          // 26 BitPosition                     
/*0x304*/             ULONG32      DefaultIoPriority : 3;                        // 27 BitPosition                     
/*0x304*/             ULONG32      ProcessSelfDelete : 1;                        // 30 BitPosition                     
/*0x304*/             ULONG32      SetTimerResolutionLink : 1;                   // 31 BitPosition                     
                  };                                                                                                   
              };                                                                                                       
/*0x308*/     union _LARGE_INTEGER CreateTime;                                   // 4 elements, 0x8 bytes (sizeof)     
/*0x310*/     UINT64       ProcessQuotaUsage[2];                                                                       
/*0x320*/     UINT64       ProcessQuotaPeak[2];                                                                        
/*0x330*/     UINT64       PeakVirtualSize;                                                                            
/*0x338*/     UINT64       VirtualSize;                                                                                
/*0x340*/     struct _LIST_ENTRY SessionProcessLinks;                            // 2 elements, 0x10 bytes (sizeof)    
              union                                                              // 3 elements, 0x8 bytes (sizeof)     
              {                                                                                                        
/*0x350*/         UINT64       ExceptionPortData;                                // VOID*                              
/*0x350*/         UINT64       ExceptionPortValue;                                                                     
/*0x350*/         UINT64       ExceptionPortState : 3;                           // 0 BitPosition                      
              };                                                                                                       
/*0x358*/     struct _EX_FAST_REF Token;                                         // 3 elements, 0x8 bytes (sizeof)     
/*0x360*/     UINT64       MmReserved;                                                                                 
/*0x368*/     struct _EX_PUSH_LOCK AddressCreationLock;                          // 7 elements, 0x8 bytes (sizeof)     
/*0x370*/     struct _EX_PUSH_LOCK PageTableCommitmentLock;                      // 7 elements, 0x8 bytes (sizeof)     
/*0x378*/     UINT64       RotateInProgress;                                     // struct _ETHREAD*                   
/*0x380*/     UINT64       ForkInProgress;                                       // struct _ETHREAD*                   
/*0x388*/     UINT64       CommitChargeJob;                                      // struct _EJOB*                      
/*0x390*/     struct _RTL_AVL_TREE CloneRoot;                                    // 1 elements, 0x8 bytes (sizeof)     
/*0x398*/     UINT64       NumberOfPrivatePages;                                                                       
/*0x3A0*/     UINT64       NumberOfLockedPages;                                                                        
/*0x3A8*/     UINT64       Win32Process;                                         // VOID*                              
/*0x3B0*/     UINT64       Job;                                                  // struct _EJOB*                      
/*0x3B8*/     UINT64       SectionObject;                                        // VOID*                              
/*0x3C0*/     UINT64       SectionBaseAddress;                                   // VOID*                              
/*0x3C8*/     ULONG32      Cookie;                                                                                     
/*0x3CC*/     UINT8        _PADDING0_[0x4];                                                                            
/*0x3D0*/     UINT64       WorkingSetWatch;                                      // struct _PAGEFAULT_HISTORY*         
/*0x3D8*/     UINT64       Win32WindowStation;                                   // VOID*                              
/*0x3E0*/     UINT64       InheritedFromUniqueProcessId;                         // VOID*                              
/*0x3E8*/     UINT64       Spare0;                                               // VOID*                              
/*0x3F0*/     UINT64       OwnerProcessId;                                                                             
/*0x3F8*/     UINT64       Peb;                                                  // struct _PEB*                       
/*0x400*/     UINT64       Session;                                              // struct _MM_SESSION_SPACE*          
/*0x408*/     UINT64       Spare1;                                               // VOID*                              
/*0x410*/     UINT64       QuotaBlock;                                           // struct _EPROCESS_QUOTA_BLOCK*      
/*0x418*/     UINT64       ObjectTable;                                          // struct _HANDLE_TABLE*              
/*0x420*/     UINT64       DebugPort;                                            // VOID*                              
/*0x428*/     UINT64       WoW64Process;                                         // struct _EWOW64PROCESS*             
/*0x430*/     UINT64       DeviceMap;                                            // VOID*                              
/*0x438*/     UINT64       EtwDataSource;                                        // VOID*                              
/*0x440*/     UINT64       PageDirectoryPte;                                                                           
/*0x448*/     UINT64       ImageFilePointer;                                     // struct _FILE_OBJECT*               
/*0x450*/     UINT8        ImageFileName[15];                                                                          
/*0x45F*/     UINT8        PriorityClass;                                                                              
/*0x460*/     UINT64       SecurityPort;                                         // VOID*                              
/*0x468*/     struct _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo; // 1 elements, 0x8 bytes (sizeof)     
/*0x470*/     struct _LIST_ENTRY JobLinks;                                       // 2 elements, 0x10 bytes (sizeof)    
/*0x480*/     UINT64       HighestUserAddress;                                   // VOID*                              
/*0x488*/     struct _LIST_ENTRY ThreadListHead;                                 // 2 elements, 0x10 bytes (sizeof)    
/*0x498*/     ULONG32      ActiveThreads;                                                                              
/*0x49C*/     ULONG32      ImagePathHash;                                                                              
/*0x4A0*/     ULONG32      DefaultHardErrorProcessing;                                                                 
/*0x4A4*/     LONG32       LastThreadExitStatus;                                                                       
/*0x4A8*/     struct _EX_FAST_REF PrefetchTrace;                                 // 3 elements, 0x8 bytes (sizeof)     
/*0x4B0*/     UINT64       LockedPagesList;                                      // VOID*                              
/*0x4B8*/     union _LARGE_INTEGER ReadOperationCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x4C0*/     union _LARGE_INTEGER WriteOperationCount;                          // 4 elements, 0x8 bytes (sizeof)     
/*0x4C8*/     union _LARGE_INTEGER OtherOperationCount;                          // 4 elements, 0x8 bytes (sizeof)     
/*0x4D0*/     union _LARGE_INTEGER ReadTransferCount;                            // 4 elements, 0x8 bytes (sizeof)     
/*0x4D8*/     union _LARGE_INTEGER WriteTransferCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x4E0*/     union _LARGE_INTEGER OtherTransferCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x4E8*/     UINT64       CommitChargeLimit;                                                                          
/*0x4F0*/     UINT64       CommitCharge;                                                                               
/*0x4F8*/     UINT64       CommitChargePeak;                                                                           
/*0x500*/     struct _MMSUPPORT_FULL Vm;                                         // 2 elements, 0x110 bytes (sizeof)   
/*0x610*/     struct _LIST_ENTRY MmProcessLinks;                                 // 2 elements, 0x10 bytes (sizeof)    
/*0x620*/     ULONG32      ModifiedPageCount;                                                                          
/*0x624*/     LONG32       ExitStatus;                                                                                 
/*0x628*/     struct _RTL_AVL_TREE VadRoot;                                      // 1 elements, 0x8 bytes (sizeof)     
/*0x630*/     UINT64       VadHint;                                              // VOID*                              
/*0x638*/     UINT64       VadCount;                                                                                   
/*0x640*/     UINT64       VadPhysicalPages;                                                                           
/*0x648*/     UINT64       VadPhysicalPagesLimit;                                                                      
/*0x650*/     struct _ALPC_PROCESS_CONTEXT AlpcContext;                          // 3 elements, 0x20 bytes (sizeof)    
/*0x670*/     struct _LIST_ENTRY TimerResolutionLink;                            // 2 elements, 0x10 bytes (sizeof)    
/*0x680*/     UINT64       TimerResolutionStackRecord;                           // struct _PO_DIAG_STACK_RECORD*      
/*0x688*/     ULONG32      RequestedTimerResolution;                                                                   
/*0x68C*/     ULONG32      SmallestTimerResolution;                                                                    
/*0x690*/     union _LARGE_INTEGER ExitTime;                                     // 4 elements, 0x8 bytes (sizeof)     
/*0x698*/     UINT64       InvertedFunctionTable;                                // struct _INVERTED_FUNCTION_TABLE*   
/*0x6A0*/     struct _EX_PUSH_LOCK InvertedFunctionTableLock;                    // 7 elements, 0x8 bytes (sizeof)     
/*0x6A8*/     ULONG32      ActiveThreadsHighWatermark;                                                                 
/*0x6AC*/     ULONG32      LargePrivateVadCount;                                                                       
/*0x6B0*/     struct _EX_PUSH_LOCK ThreadListLock;                               // 7 elements, 0x8 bytes (sizeof)     
/*0x6B8*/     UINT64       WnfContext;                                           // VOID*                              
/*0x6C0*/     UINT64       ServerSilo;                                           // struct _EJOB*                      
/*0x6C8*/     UINT8        SignatureLevel;                                                                             
/*0x6C9*/     UINT8        SectionSignatureLevel;                                                                      
/*0x6CA*/     struct _PS_PROTECTION Protection;                                  // 4 elements, 0x1 bytes (sizeof)     
              struct                                                             // 3 elements, 0x1 bytes (sizeof)     
              {                                                                                                        
/*0x6CB*/         UINT8        HangCount : 3;                                    // 0 BitPosition                      
/*0x6CB*/         UINT8        GhostCount : 3;                                   // 3 BitPosition                      
/*0x6CB*/         UINT8        PrefilterException : 1;                           // 6 BitPosition                      
              };                                                                                                       
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x6CC*/         ULONG32      Flags3;                                                                                 
                  struct                                                         // 24 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x6CC*/             ULONG32      Minimal : 1;                                  // 0 BitPosition                      
/*0x6CC*/             ULONG32      ReplacingPageRoot : 1;                        // 1 BitPosition                      
/*0x6CC*/             ULONG32      Crashed : 1;                                  // 2 BitPosition                      
/*0x6CC*/             ULONG32      JobVadsAreTracked : 1;                        // 3 BitPosition                      
/*0x6CC*/             ULONG32      VadTrackingDisabled : 1;                      // 4 BitPosition                      
/*0x6CC*/             ULONG32      AuxiliaryProcess : 1;                         // 5 BitPosition                      
/*0x6CC*/             ULONG32      SubsystemProcess : 1;                         // 6 BitPosition                      
/*0x6CC*/             ULONG32      IndirectCpuSets : 1;                          // 7 BitPosition                      
/*0x6CC*/             ULONG32      RelinquishedCommit : 1;                       // 8 BitPosition                      
/*0x6CC*/             ULONG32      HighGraphicsPriority : 1;                     // 9 BitPosition                      
/*0x6CC*/             ULONG32      CommitFailLogged : 1;                         // 10 BitPosition                     
/*0x6CC*/             ULONG32      ReserveFailLogged : 1;                        // 11 BitPosition                     
/*0x6CC*/             ULONG32      SystemProcess : 1;                            // 12 BitPosition                     
/*0x6CC*/             ULONG32      HideImageBaseAddresses : 1;                   // 13 BitPosition                     
/*0x6CC*/             ULONG32      AddressPolicyFrozen : 1;                      // 14 BitPosition                     
/*0x6CC*/             ULONG32      ProcessFirstResume : 1;                       // 15 BitPosition                     
/*0x6CC*/             ULONG32      ForegroundExternal : 1;                       // 16 BitPosition                     
/*0x6CC*/             ULONG32      ForegroundSystem : 1;                         // 17 BitPosition                     
/*0x6CC*/             ULONG32      HighMemoryPriority : 1;                       // 18 BitPosition                     
/*0x6CC*/             ULONG32      EnableProcessSuspendResumeLogging : 1;        // 19 BitPosition                     
/*0x6CC*/             ULONG32      EnableThreadSuspendResumeLogging : 1;         // 20 BitPosition                     
/*0x6CC*/             ULONG32      SecurityDomainChanged : 1;                    // 21 BitPosition                     
/*0x6CC*/             ULONG32      SecurityFreezeComplete : 1;                   // 22 BitPosition                     
/*0x6CC*/             ULONG32      VmProcessorHost : 1;                          // 23 BitPosition                     
                  };                                                                                                   
              };                                                                                                       
/*0x6D0*/     LONG32       DeviceAsid;                                                                                 
/*0x6D4*/     UINT8        _PADDING1_[0x4];                                                                            
/*0x6D8*/     UINT64       SvmData;                                              // VOID*                              
/*0x6E0*/     struct _EX_PUSH_LOCK SvmProcessLock;                               // 7 elements, 0x8 bytes (sizeof)     
/*0x6E8*/     UINT64       SvmLock;                                                                                    
/*0x6F0*/     struct _LIST_ENTRY SvmProcessDeviceListHead;                       // 2 elements, 0x10 bytes (sizeof)    
/*0x700*/     UINT64       LastFreezeInterruptTime;                                                                    
/*0x708*/     UINT64       DiskCounters;                                         // struct _PROCESS_DISK_COUNTERS*     
/*0x710*/     UINT64       PicoContext;                                          // VOID*                              
/*0x718*/     UINT64       EnclaveTable;                                         // VOID*                              
/*0x720*/     UINT64       EnclaveNumber;                                                                              
/*0x728*/     struct _EX_PUSH_LOCK EnclaveLock;                                  // 7 elements, 0x8 bytes (sizeof)     
/*0x730*/     ULONG32      HighPriorityFaultsAllowed;                                                                  
/*0x734*/     UINT8        _PADDING2_[0x4];                                                                            
/*0x738*/     UINT64       EnergyContext;                                        // struct _PO_PROCESS_ENERGY_CONTEXT* 
/*0x740*/     UINT64       VmContext;                                            // VOID*                              
/*0x748*/     UINT64       SequenceNumber;                                                                             
/*0x750*/     UINT64       CreateInterruptTime;                                                                        
/*0x758*/     UINT64       CreateUnbiasedInterruptTime;                                                                
/*0x760*/     UINT64       TotalUnbiasedFrozenTime;                                                                    
/*0x768*/     UINT64       LastAppStateUpdateTime;                                                                     
              struct                                                             // 2 elements, 0x8 bytes (sizeof)     
              {                                                                                                        
/*0x770*/         UINT64       LastAppStateUptime : 61;                          // 0 BitPosition                      
/*0x770*/         UINT64       LastAppState : 3;                                 // 61 BitPosition                     
              };                                                                                                       
/*0x778*/     UINT64       SharedCommitCharge;                                                                         
/*0x780*/     struct _EX_PUSH_LOCK SharedCommitLock;                             // 7 elements, 0x8 bytes (sizeof)     
/*0x788*/     struct _LIST_ENTRY SharedCommitLinks;                              // 2 elements, 0x10 bytes (sizeof)    
              union                                                              // 2 elements, 0x10 bytes (sizeof)    
              {                                                                                                        
                  struct                                                         // 2 elements, 0x10 bytes (sizeof)    
                  {                                                                                                    
/*0x798*/             UINT64       AllowedCpuSets;                                                                     
/*0x7A0*/             UINT64       DefaultCpuSets;                                                                     
                  };                                                                                                   
                  struct                                                         // 2 elements, 0x10 bytes (sizeof)    
                  {                                                                                                    
/*0x798*/             UINT64       AllowedCpuSetsIndirect;                       // UINT64*                            
/*0x7A0*/             UINT64       DefaultCpuSetsIndirect;                       // UINT64*                            
                  };                                                                                                   
              };                                                                                                       
/*0x7A8*/     UINT64       DiskIoAttribution;                                    // VOID*                              
/*0x7B0*/     UINT64       DxgProcess;                                           // VOID*                              
/*0x7B8*/     ULONG32      Win32KFilterSet;                                                                            
/*0x7BC*/     UINT8        _PADDING3_[0x4];                                                                            
/*0x7C0*/     union _PS_INTERLOCKED_TIMER_DELAY_VALUES ProcessTimerDelay;        // 7 elements, 0x8 bytes (sizeof)     
/*0x7C8*/     ULONG32      KTimerSets;                                                                                 
/*0x7CC*/     ULONG32      KTimer2Sets;                                                                                
/*0x7D0*/     ULONG32      ThreadTimerSets;                                                                            
/*0x7D4*/     UINT8        _PADDING4_[0x4];                                                                            
/*0x7D8*/     UINT64       VirtualTimerListLock;                                                                       
/*0x7E0*/     struct _LIST_ENTRY VirtualTimerListHead;                           // 2 elements, 0x10 bytes (sizeof)    
              union                                                              // 2 elements, 0x30 bytes (sizeof)    
              {                                                                                                        
/*0x7F0*/         struct _WNF_STATE_NAME WakeChannel;                            // 1 elements, 0x8 bytes (sizeof)     
/*0x7F0*/         struct _PS_PROCESS_WAKE_INFORMATION WakeInfo;                  // 4 elements, 0x30 bytes (sizeof)    
              };                                                                                                       
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x820*/         ULONG32      MitigationFlags;                                                                        
                  struct                                                         // 32 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x820*/             ULONG32      ControlFlowGuardEnabled : 1;                  // 0 BitPosition                      
/*0x820*/             ULONG32      ControlFlowGuardExportSuppressionEnabled : 1; // 1 BitPosition                      
/*0x820*/             ULONG32      ControlFlowGuardStrict : 1;                   // 2 BitPosition                      
/*0x820*/             ULONG32      DisallowStrippedImages : 1;                   // 3 BitPosition                      
/*0x820*/             ULONG32      ForceRelocateImages : 1;                      // 4 BitPosition                      
/*0x820*/             ULONG32      HighEntropyASLREnabled : 1;                   // 5 BitPosition                      
/*0x820*/             ULONG32      StackRandomizationDisabled : 1;               // 6 BitPosition                      
/*0x820*/             ULONG32      ExtensionPointDisable : 1;                    // 7 BitPosition                      
/*0x820*/             ULONG32      DisableDynamicCode : 1;                       // 8 BitPosition                      
/*0x820*/             ULONG32      DisableDynamicCodeAllowOptOut : 1;            // 9 BitPosition                      
/*0x820*/             ULONG32      DisableDynamicCodeAllowRemoteDowngrade : 1;   // 10 BitPosition                     
/*0x820*/             ULONG32      AuditDisableDynamicCode : 1;                  // 11 BitPosition                     
/*0x820*/             ULONG32      DisallowWin32kSystemCalls : 1;                // 12 BitPosition                     
/*0x820*/             ULONG32      AuditDisallowWin32kSystemCalls : 1;           // 13 BitPosition                     
/*0x820*/             ULONG32      EnableFilteredWin32kAPIs : 1;                 // 14 BitPosition                     
/*0x820*/             ULONG32      AuditFilteredWin32kAPIs : 1;                  // 15 BitPosition                     
/*0x820*/             ULONG32      DisableNonSystemFonts : 1;                    // 16 BitPosition                     
/*0x820*/             ULONG32      AuditNonSystemFontLoading : 1;                // 17 BitPosition                     
/*0x820*/             ULONG32      PreferSystem32Images : 1;                     // 18 BitPosition                     
/*0x820*/             ULONG32      ProhibitRemoteImageMap : 1;                   // 19 BitPosition                     
/*0x820*/             ULONG32      AuditProhibitRemoteImageMap : 1;              // 20 BitPosition                     
/*0x820*/             ULONG32      ProhibitLowILImageMap : 1;                    // 21 BitPosition                     
/*0x820*/             ULONG32      AuditProhibitLowILImageMap : 1;               // 22 BitPosition                     
/*0x820*/             ULONG32      SignatureMitigationOptIn : 1;                 // 23 BitPosition                     
/*0x820*/             ULONG32      AuditBlockNonMicrosoftBinaries : 1;           // 24 BitPosition                     
/*0x820*/             ULONG32      AuditBlockNonMicrosoftBinariesAllowStore : 1; // 25 BitPosition                     
/*0x820*/             ULONG32      LoaderIntegrityContinuityEnabled : 1;         // 26 BitPosition                     
/*0x820*/             ULONG32      AuditLoaderIntegrityContinuity : 1;           // 27 BitPosition                     
/*0x820*/             ULONG32      EnableModuleTamperingProtection : 1;          // 28 BitPosition                     
/*0x820*/             ULONG32      EnableModuleTamperingProtectionNoInherit : 1; // 29 BitPosition                     
/*0x820*/             ULONG32      RestrictIndirectBranchPrediction : 1;         // 30 BitPosition                     
/*0x820*/             ULONG32      IsolateSecurityDomain : 1;                    // 31 BitPosition                     
                  }MitigationFlagsValues;                                                                              
              };                                                                                                       
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x824*/         ULONG32      MitigationFlags2;                                                                       
                  struct                                                         // 15 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x824*/             ULONG32      EnableExportAddressFilter : 1;                // 0 BitPosition                      
/*0x824*/             ULONG32      AuditExportAddressFilter : 1;                 // 1 BitPosition                      
/*0x824*/             ULONG32      EnableExportAddressFilterPlus : 1;            // 2 BitPosition                      
/*0x824*/             ULONG32      AuditExportAddressFilterPlus : 1;             // 3 BitPosition                      
/*0x824*/             ULONG32      EnableRopStackPivot : 1;                      // 4 BitPosition                      
/*0x824*/             ULONG32      AuditRopStackPivot : 1;                       // 5 BitPosition                      
/*0x824*/             ULONG32      EnableRopCallerCheck : 1;                     // 6 BitPosition                      
/*0x824*/             ULONG32      AuditRopCallerCheck : 1;                      // 7 BitPosition                      
/*0x824*/             ULONG32      EnableRopSimExec : 1;                         // 8 BitPosition                      
/*0x824*/             ULONG32      AuditRopSimExec : 1;                          // 9 BitPosition                      
/*0x824*/             ULONG32      EnableImportAddressFilter : 1;                // 10 BitPosition                     
/*0x824*/             ULONG32      AuditImportAddressFilter : 1;                 // 11 BitPosition                     
/*0x824*/             ULONG32      DisablePageCombine : 1;                       // 12 BitPosition                     
/*0x824*/             ULONG32      SpeculativeStoreBypassDisable : 1;            // 13 BitPosition                     
/*0x824*/             ULONG32      CetShadowStacks : 1;                          // 14 BitPosition                     
                  }MitigationFlags2Values;                                                                             
              };                                                                                                       
/*0x828*/     UINT64       PartitionObject;                                      // VOID*                              
/*0x830*/     UINT64       SecurityDomain;                                                                             
/*0x838*/     UINT64       ParentSecurityDomain;                                                                       
/*0x840*/     UINT64       CoverageSamplerContext;                               // VOID*                              
/*0x848*/     UINT64       MmHotPatchContext;                                    // VOID*                              
          }EPROCESS, *PEPROCESS;                                                                                       
                                                                                                                       
typedef struct _EPROCESS_QUOTA_BLOCK // 0 elements, 0x0 bytes (sizeof) 
{                                                                      
}EPROCESS_QUOTA_BLOCK, *PEPROCESS_QUOTA_BLOCK;                                  
                                                                       
          typedef struct _OBP_SYSTEM_DOS_DEVICE_STATE // 2 elements, 0x6C bytes (sizeof) 
