// #################################################################################
// Generated by Symbol Type Viewer 32Bit/64Bit - Version 1.0.0.6 beta
// http://www.syseclabs.com
// Coding by Lionel d'Hauenens
// #################################################################################
// Image         : 32bit
// ImageName     : windows\X86\6.1.7601.17514\ntdll.dll
// LoadedPdbName : symbols\ntdll.pdb\120028FA453F4CD5A6A404EC37396A582\ntdll.pdb

#ifdef __cplusplus
extern "C" {
#endif

//////////////////
//   C Define   //
//////////////////

#define VOID void
#define STDCALL __stdcall
#define FASTCALL __fastcall
#define CDECL __cdecl
#define THISCALL __thiscall
#define NEAR 
#define FAR 
//---------------------------------------------------------------------

//////////////////
// C Basic Type //
//////////////////

typedef signed char INT8;
typedef signed char CHAR;
typedef signed short INT16;
typedef signed int INT32;
typedef signed int BOOL;
typedef signed __int64 INT64;
typedef signed __int64 LONG64;
typedef signed long LONG32;
typedef unsigned char UINT8;
typedef unsigned char BYTE;
typedef unsigned short UINT16;
typedef unsigned short WCHAR;
typedef unsigned int UINT32;
typedef unsigned __int64 UINT64;
typedef unsigned __int64 ULONG64;
typedef unsigned long ULONG32;
typedef float FLOAT32;
typedef double FLOAT64;
typedef struct {unsigned short W[5];} FLOAT80;
typedef struct { __int64 LowPart;__int64 HighPart;} FLOAT128;
typedef double DATE;
typedef signed long HRESULT;
typedef union { struct {unsigned long Lo; long Hi;}; __int64 int64;} CURRENCY;
typedef wchar_t OLECHAR;
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Enum types

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE  // 3 elements, 0x4 bytes
{
    StandardDesign  = 0 /*0x0*/,
    NEC98x86        = 1 /*0x1*/,
    EndAlternatives = 2 /*0x2*/
}ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef enum _BUS_QUERY_ID_TYPE  // 6 elements, 0x4 bytes
{
    BusQueryDeviceID           = 0 /*0x0*/,
    BusQueryHardwareIDs        = 1 /*0x1*/,
    BusQueryCompatibleIDs      = 2 /*0x2*/,
    BusQueryInstanceID         = 3 /*0x3*/,
    BusQueryDeviceSerialNumber = 4 /*0x4*/,
    BusQueryContainerID        = 5 /*0x5*/
}BUS_QUERY_ID_TYPE, *PBUS_QUERY_ID_TYPE;

typedef enum _DEVICE_POWER_STATE  // 6 elements, 0x4 bytes
{
    PowerDeviceUnspecified = 0 /*0x0*/,
    PowerDeviceD0          = 1 /*0x1*/,
    PowerDeviceD1          = 2 /*0x2*/,
    PowerDeviceD2          = 3 /*0x3*/,
    PowerDeviceD3          = 4 /*0x4*/,
    PowerDeviceMaximum     = 5 /*0x5*/
}DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_RELATION_TYPE  // 7 elements, 0x4 bytes
{
    BusRelations         = 0 /*0x0*/,
    EjectionRelations    = 1 /*0x1*/,
    PowerRelations       = 2 /*0x2*/,
    RemovalRelations     = 3 /*0x3*/,
    TargetDeviceRelation = 4 /*0x4*/,
    SingleBusRelations   = 5 /*0x5*/,
    TransportRelations   = 6 /*0x6*/
}DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _DEVICE_TEXT_TYPE  // 2 elements, 0x4 bytes
{
    DeviceTextDescription         = 0 /*0x0*/,
    DeviceTextLocationInformation = 1 /*0x1*/
}DEVICE_TEXT_TYPE, *PDEVICE_TEXT_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE  // 4 elements, 0x4 bytes
{
    DeviceUsageTypeUndefined   = 0 /*0x0*/,
    DeviceUsageTypePaging      = 1 /*0x1*/,
    DeviceUsageTypeHibernation = 2 /*0x2*/,
    DeviceUsageTypeDumpFile    = 3 /*0x3*/
}DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum _DISPLAYCONFIG_SCANLINE_ORDERING  // 6 elements, 0x4 bytes
{
    DISPLAYCONFIG_SCANLINE_ORDERING_UNSPECIFIED                = 0 /*0x0*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_PROGRESSIVE                = 1 /*0x1*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED                 = 2 /*0x2*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_UPPERFIELDFIRST = 2 /*0x2*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_LOWERFIELDFIRST = 3 /*0x3*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_FORCE_UINT32               = -1 /*0xFF*/
}DISPLAYCONFIG_SCANLINE_ORDERING, *PDISPLAYCONFIG_SCANLINE_ORDERING;

typedef enum _EVENT_TYPE  // 2 elements, 0x4 bytes
{
    NotificationEvent    = 0 /*0x0*/,
    SynchronizationEvent = 1 /*0x1*/
}EVENT_TYPE, *PEVENT_TYPE;

typedef enum _EXCEPTION_DISPOSITION  // 4 elements, 0x4 bytes
{
    ExceptionContinueExecution = 0 /*0x0*/,
    ExceptionContinueSearch    = 1 /*0x1*/,
    ExceptionNestedException   = 2 /*0x2*/,
    ExceptionCollidedUnwind    = 3 /*0x3*/
}EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _FILE_INFORMATION_CLASS  // 56 elements, 0x4 bytes
{
    FileDirectoryInformation                = 1 /*0x1*/,
    FileFullDirectoryInformation            = 2 /*0x2*/,
    FileBothDirectoryInformation            = 3 /*0x3*/,
    FileBasicInformation                    = 4 /*0x4*/,
    FileStandardInformation                 = 5 /*0x5*/,
    FileInternalInformation                 = 6 /*0x6*/,
    FileEaInformation                       = 7 /*0x7*/,
    FileAccessInformation                   = 8 /*0x8*/,
    FileNameInformation                     = 9 /*0x9*/,
    FileRenameInformation                   = 10 /*0xA*/,
    FileLinkInformation                     = 11 /*0xB*/,
    FileNamesInformation                    = 12 /*0xC*/,
    FileDispositionInformation              = 13 /*0xD*/,
    FilePositionInformation                 = 14 /*0xE*/,
    FileFullEaInformation                   = 15 /*0xF*/,
    FileModeInformation                     = 16 /*0x10*/,
    FileAlignmentInformation                = 17 /*0x11*/,
    FileAllInformation                      = 18 /*0x12*/,
    FileAllocationInformation               = 19 /*0x13*/,
    FileEndOfFileInformation                = 20 /*0x14*/,
    FileAlternateNameInformation            = 21 /*0x15*/,
    FileStreamInformation                   = 22 /*0x16*/,
    FilePipeInformation                     = 23 /*0x17*/,
    FilePipeLocalInformation                = 24 /*0x18*/,
    FilePipeRemoteInformation               = 25 /*0x19*/,
    FileMailslotQueryInformation            = 26 /*0x1A*/,
    FileMailslotSetInformation              = 27 /*0x1B*/,
    FileCompressionInformation              = 28 /*0x1C*/,
    FileObjectIdInformation                 = 29 /*0x1D*/,
    FileCompletionInformation               = 30 /*0x1E*/,
    FileMoveClusterInformation              = 31 /*0x1F*/,
    FileQuotaInformation                    = 32 /*0x20*/,
    FileReparsePointInformation             = 33 /*0x21*/,
    FileNetworkOpenInformation              = 34 /*0x22*/,
    FileAttributeTagInformation             = 35 /*0x23*/,
    FileTrackingInformation                 = 36 /*0x24*/,
    FileIdBothDirectoryInformation          = 37 /*0x25*/,
    FileIdFullDirectoryInformation          = 38 /*0x26*/,
    FileValidDataLengthInformation          = 39 /*0x27*/,
    FileShortNameInformation                = 40 /*0x28*/,
    FileIoCompletionNotificationInformation = 41 /*0x29*/,
    FileIoStatusBlockRangeInformation       = 42 /*0x2A*/,
    FileIoPriorityHintInformation           = 43 /*0x2B*/,
    FileSfioReserveInformation              = 44 /*0x2C*/,
    FileSfioVolumeInformation               = 45 /*0x2D*/,
    FileHardLinkInformation                 = 46 /*0x2E*/,
    FileProcessIdsUsingFileInformation      = 47 /*0x2F*/,
    FileNormalizedNameInformation           = 48 /*0x30*/,
    FileNetworkPhysicalNameInformation      = 49 /*0x31*/,
    FileIdGlobalTxDirectoryInformation      = 50 /*0x32*/,
    FileIsRemoteDeviceInformation           = 51 /*0x33*/,
    FileAttributeCacheInformation           = 52 /*0x34*/,
    FileNumaNodeInformation                 = 53 /*0x35*/,
    FileStandardLinkInformation             = 54 /*0x36*/,
    FileRemoteProtocolInformation           = 55 /*0x37*/,
    FileMaximumInformation                  = 56 /*0x38*/
}FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FS_FILTER_SECTION_SYNC_TYPE  // 2 elements, 0x4 bytes
{
    SyncTypeOther         = 0 /*0x0*/,
    SyncTypeCreateSection = 1 /*0x1*/
}FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

typedef enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE  // 2 elements, 0x4 bytes
{
    NotifyTypeCreate  = 0 /*0x0*/,
    NotifyTypeRetired = 1 /*0x1*/
}FS_FILTER_STREAM_FO_NOTIFICATION_TYPE, *PFS_FILTER_STREAM_FO_NOTIFICATION_TYPE;

typedef enum _FSINFOCLASS  // 11 elements, 0x4 bytes
{
    FileFsVolumeInformation      = 1 /*0x1*/,
    FileFsLabelInformation       = 2 /*0x2*/,
    FileFsSizeInformation        = 3 /*0x3*/,
    FileFsDeviceInformation      = 4 /*0x4*/,
    FileFsAttributeInformation   = 5 /*0x5*/,
    FileFsControlInformation     = 6 /*0x6*/,
    FileFsFullSizeInformation    = 7 /*0x7*/,
    FileFsObjectIdInformation    = 8 /*0x8*/,
    FileFsDriverPathInformation  = 9 /*0x9*/,
    FileFsVolumeFlagsInformation = 10 /*0xA*/,
    FileFsMaximumInformation     = 11 /*0xB*/
}FSINFOCLASS, *PFSINFOCLASS;

typedef enum _HARDWARE_COUNTER_TYPE  // 2 elements, 0x4 bytes
{
    PMCCounter             = 0 /*0x0*/,
    MaxHardwareCounterType = 1 /*0x1*/
}HARDWARE_COUNTER_TYPE, *PHARDWARE_COUNTER_TYPE;

typedef enum _HEAP_FAILURE_TYPE  // 14 elements, 0x4 bytes
{
    heap_failure_internal                    = 0 /*0x0*/,
    heap_failure_unknown                     = 1 /*0x1*/,
    heap_failure_generic                     = 2 /*0x2*/,
    heap_failure_entry_corruption            = 3 /*0x3*/,
    heap_failure_multiple_entries_corruption = 4 /*0x4*/,
    heap_failure_virtual_block_corruption    = 5 /*0x5*/,
    heap_failure_buffer_overrun              = 6 /*0x6*/,
    heap_failure_buffer_underrun             = 7 /*0x7*/,
    heap_failure_block_not_busy              = 8 /*0x8*/,
    heap_failure_invalid_argument            = 9 /*0x9*/,
    heap_failure_usage_after_free            = 10 /*0xA*/,
    heap_failure_cross_heap_operation        = 11 /*0xB*/,
    heap_failure_freelists_corruption        = 12 /*0xC*/,
    heap_failure_listentry_corruption        = 13 /*0xD*/
}HEAP_FAILURE_TYPE, *PHEAP_FAILURE_TYPE;

typedef enum _INTERFACE_TYPE  // 19 elements, 0x4 bytes
{
    InterfaceTypeUndefined = -1 /*0xFF*/,
    Internal               = 0 /*0x0*/,
    Isa                    = 1 /*0x1*/,
    Eisa                   = 2 /*0x2*/,
    MicroChannel           = 3 /*0x3*/,
    TurboChannel           = 4 /*0x4*/,
    PCIBus                 = 5 /*0x5*/,
    VMEBus                 = 6 /*0x6*/,
    NuBus                  = 7 /*0x7*/,
    PCMCIABus              = 8 /*0x8*/,
    CBus                   = 9 /*0x9*/,
    MPIBus                 = 10 /*0xA*/,
    MPSABus                = 11 /*0xB*/,
    ProcessorInternal      = 12 /*0xC*/,
    InternalPowerBus       = 13 /*0xD*/,
    PNPISABus              = 14 /*0xE*/,
    PNPBus                 = 15 /*0xF*/,
    Vmcs                   = 16 /*0x10*/,
    MaximumInterfaceType   = 17 /*0x11*/
}INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _IO_ALLOCATION_ACTION  // 3 elements, 0x4 bytes
{
    KeepObject                    = 1 /*0x1*/,
    DeallocateObject              = 2 /*0x2*/,
    DeallocateObjectKeepRegisters = 3 /*0x3*/
}IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _IO_PRIORITY_HINT  // 6 elements, 0x4 bytes
{
    IoPriorityVeryLow  = 0 /*0x0*/,
    IoPriorityLow      = 1 /*0x1*/,
    IoPriorityNormal   = 2 /*0x2*/,
    IoPriorityHigh     = 3 /*0x3*/,
    IoPriorityCritical = 4 /*0x4*/,
    MaxIoPriorityTypes = 5 /*0x5*/
}IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

typedef enum _IRQ_PRIORITY  // 4 elements, 0x4 bytes
{
    IrqPriorityUndefined = 0 /*0x0*/,
    IrqPriorityLow       = 1 /*0x1*/,
    IrqPriorityNormal    = 2 /*0x2*/,
    IrqPriorityHigh      = 3 /*0x3*/
}IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef enum _KOBJECTS  // 26 elements, 0x4 bytes
{
    EventNotificationObject    = 0 /*0x0*/,
    EventSynchronizationObject = 1 /*0x1*/,
    MutantObject               = 2 /*0x2*/,
    ProcessObject              = 3 /*0x3*/,
    QueueObject                = 4 /*0x4*/,
    SemaphoreObject            = 5 /*0x5*/,
    ThreadObject               = 6 /*0x6*/,
    GateObject                 = 7 /*0x7*/,
    TimerNotificationObject    = 8 /*0x8*/,
    TimerSynchronizationObject = 9 /*0x9*/,
    Spare2Object               = 10 /*0xA*/,
    Spare3Object               = 11 /*0xB*/,
    Spare4Object               = 12 /*0xC*/,
    Spare5Object               = 13 /*0xD*/,
    Spare6Object               = 14 /*0xE*/,
    Spare7Object               = 15 /*0xF*/,
    Spare8Object               = 16 /*0x10*/,
    Spare9Object               = 17 /*0x11*/,
    ApcObject                  = 18 /*0x12*/,
    DpcObject                  = 19 /*0x13*/,
    DeviceQueueObject          = 20 /*0x14*/,
    EventPairObject            = 21 /*0x15*/,
    InterruptObject            = 22 /*0x16*/,
    ProfileObject              = 23 /*0x17*/,
    ThreadedDpcObject          = 24 /*0x18*/,
    MaximumKernelObject        = 25 /*0x19*/
}KOBJECTS, *PKOBJECTS;

typedef enum _KPROCESS_STATE  // 7 elements, 0x4 bytes
{
    ProcessInMemory      = 0 /*0x0*/,
    ProcessOutOfMemory   = 1 /*0x1*/,
    ProcessInTransition  = 2 /*0x2*/,
    ProcessOutTransition = 3 /*0x3*/,
    ProcessInSwap        = 4 /*0x4*/,
    ProcessOutSwap       = 5 /*0x5*/,
    ProcessAllSwapStates = 6 /*0x6*/
}KPROCESS_STATE, *PKPROCESS_STATE;

typedef enum _KSPIN_LOCK_QUEUE_NUMBER  // 18 elements, 0x4 bytes
{
    LockQueueUnusedSpare0       = 0 /*0x0*/,
    LockQueueExpansionLock      = 1 /*0x1*/,
    LockQueueUnusedSpare2       = 2 /*0x2*/,
    LockQueueSystemSpaceLock    = 3 /*0x3*/,
    LockQueueVacbLock           = 4 /*0x4*/,
    LockQueueMasterLock         = 5 /*0x5*/,
    LockQueueNonPagedPoolLock   = 6 /*0x6*/,
    LockQueueIoCancelLock       = 7 /*0x7*/,
    LockQueueWorkQueueLock      = 8 /*0x8*/,
    LockQueueIoVpbLock          = 9 /*0x9*/,
    LockQueueIoDatabaseLock     = 10 /*0xA*/,
    LockQueueIoCompletionLock   = 11 /*0xB*/,
    LockQueueNtfsStructLock     = 12 /*0xC*/,
    LockQueueAfdWorkQueueLock   = 13 /*0xD*/,
    LockQueueBcbLock            = 14 /*0xE*/,
    LockQueueMmNonPagedPoolLock = 15 /*0xF*/,
    LockQueueUnusedSpare16      = 16 /*0x10*/,
    LockQueueMaximumLock        = 17 /*0x11*/
}KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

typedef enum _KWAIT_BLOCK_STATE  // 5 elements, 0x4 bytes
{
    WaitBlockBypassStart    = 0 /*0x0*/,
    WaitBlockBypassComplete = 1 /*0x1*/,
    WaitBlockActive         = 2 /*0x2*/,
    WaitBlockInactive       = 3 /*0x3*/,
    WaitBlockAllStates      = 4 /*0x4*/
}KWAIT_BLOCK_STATE, *PKWAIT_BLOCK_STATE;

typedef enum _KWAIT_STATE  // 4 elements, 0x4 bytes
{
    WaitInProgress   = 0 /*0x0*/,
    WaitCommitted    = 1 /*0x1*/,
    WaitAborted      = 2 /*0x2*/,
    MaximumWaitState = 3 /*0x3*/
}KWAIT_STATE, *PKWAIT_STATE;

typedef enum _LSA_FOREST_TRUST_RECORD_TYPE  // 4 elements, 0x4 bytes
{
    ForestTrustTopLevelName   = 0 /*0x0*/,
    ForestTrustTopLevelNameEx = 1 /*0x1*/,
    ForestTrustDomainInfo     = 2 /*0x2*/,
    ForestTrustRecordTypeLast = 2 /*0x2*/
}LSA_FOREST_TRUST_RECORD_TYPE, *PLSA_FOREST_TRUST_RECORD_TYPE;

typedef enum _MCA_EXCEPTION_TYPE  // 2 elements, 0x4 bytes
{
    HAL_MCE_RECORD = 0 /*0x0*/,
    HAL_MCA_RECORD = 1 /*0x1*/
}MCA_EXCEPTION_TYPE, *PMCA_EXCEPTION_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG  // 1 elements, 0x4 bytes
{
    MmFrameBufferCached = 2 /*0x2*/
}MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _MM_PAGE_ACCESS_TYPE  // 4 elements, 0x4 bytes
{
    MmPteAccessType         = 0 /*0x0*/,
    MmCcReadAheadType       = 1 /*0x1*/,
    MmPfnRepurposeType      = 2 /*0x2*/,
    MmMaximumPageAccessType = 3 /*0x3*/
}MM_PAGE_ACCESS_TYPE, *PMM_PAGE_ACCESS_TYPE;

typedef enum _MODE  // 3 elements, 0x4 bytes
{
    KernelMode  = 0 /*0x0*/,
    UserMode    = 1 /*0x1*/,
    MaximumMode = 2 /*0x2*/
}MODE, *PMODE;

typedef enum _NT_PRODUCT_TYPE  // 3 elements, 0x4 bytes
{
    NtProductWinNt    = 1 /*0x1*/,
    NtProductLanManNt = 2 /*0x2*/,
    NtProductServer   = 3 /*0x3*/
}NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _OB_OPEN_REASON  // 5 elements, 0x4 bytes
{
    ObCreateHandle    = 0 /*0x0*/,
    ObOpenHandle      = 1 /*0x1*/,
    ObDuplicateHandle = 2 /*0x2*/,
    ObInheritHandle   = 3 /*0x3*/,
    ObMaxOpenReason   = 4 /*0x4*/
}OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _PF_FILE_ACCESS_TYPE  // 3 elements, 0x4 bytes
{
    PfFileAccessTypeRead  = 0 /*0x0*/,
    PfFileAccessTypeWrite = 1 /*0x1*/,
    PfFileAccessTypeMax   = 2 /*0x2*/
}PF_FILE_ACCESS_TYPE, *PPF_FILE_ACCESS_TYPE;

typedef enum _POOL_TYPE  // 15 elements, 0x4 bytes
{
    NonPagedPool                         = 0 /*0x0*/,
    PagedPool                            = 1 /*0x1*/,
    NonPagedPoolMustSucceed              = 2 /*0x2*/,
    DontUseThisType                      = 3 /*0x3*/,
    NonPagedPoolCacheAligned             = 4 /*0x4*/,
    PagedPoolCacheAligned                = 5 /*0x5*/,
    NonPagedPoolCacheAlignedMustS        = 6 /*0x6*/,
    MaxPoolType                          = 7 /*0x7*/,
    NonPagedPoolSession                  = 32 /*0x20*/,
    PagedPoolSession                     = 33 /*0x21*/,
    NonPagedPoolMustSucceedSession       = 34 /*0x22*/,
    DontUseThisTypeSession               = 35 /*0x23*/,
    NonPagedPoolCacheAlignedSession      = 36 /*0x24*/,
    PagedPoolCacheAlignedSession         = 37 /*0x25*/,
    NonPagedPoolCacheAlignedMustSSession = 38 /*0x26*/
}POOL_TYPE, *PPOOL_TYPE;

typedef enum _POWER_ACTION  // 8 elements, 0x4 bytes
{
    PowerActionNone          = 0 /*0x0*/,
    PowerActionReserved      = 1 /*0x1*/,
    PowerActionSleep         = 2 /*0x2*/,
    PowerActionHibernate     = 3 /*0x3*/,
    PowerActionShutdown      = 4 /*0x4*/,
    PowerActionShutdownReset = 5 /*0x5*/,
    PowerActionShutdownOff   = 6 /*0x6*/,
    PowerActionWarmEject     = 7 /*0x7*/
}POWER_ACTION, *PPOWER_ACTION;

typedef enum _POWER_STATE_TYPE  // 2 elements, 0x4 bytes
{
    SystemPowerState = 0 /*0x0*/,
    DevicePowerState = 1 /*0x1*/
}POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER  // 10 elements, 0x4 bytes
{
    LookasideSmallIrpList      = 0 /*0x0*/,
    LookasideMediumIrpList     = 1 /*0x1*/,
    LookasideLargeIrpList      = 2 /*0x2*/,
    LookasideMdlList           = 3 /*0x3*/,
    LookasideCreateInfoList    = 4 /*0x4*/,
    LookasideNameBufferList    = 5 /*0x5*/,
    LookasideTwilightList      = 6 /*0x6*/,
    LookasideCompletionList    = 7 /*0x7*/,
    LookasideScratchBufferList = 8 /*0x8*/,
    LookasideMaximumList       = 9 /*0x9*/
}PP_NPAGED_LOOKASIDE_NUMBER, *PPP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _PROC_HYPERVISOR_STATE  // 3 elements, 0x4 bytes
{
    ProcHypervisorNone    = 0 /*0x0*/,
    ProcHypervisorPresent = 1 /*0x1*/,
    ProcHypervisorPower   = 2 /*0x2*/
}PROC_HYPERVISOR_STATE, *PPROC_HYPERVISOR_STATE;

typedef enum _PROCESSOR_CACHE_TYPE  // 4 elements, 0x4 bytes
{
    CacheUnified     = 0 /*0x0*/,
    CacheInstruction = 1 /*0x1*/,
    CacheData        = 2 /*0x2*/,
    CacheTrace       = 3 /*0x3*/
}PROCESSOR_CACHE_TYPE, *PPROCESSOR_CACHE_TYPE;

typedef enum _PS_RESOURCE_TYPE  // 6 elements, 0x4 bytes
{
    PsResourceNonPagedPool = 0 /*0x0*/,
    PsResourcePagedPool    = 1 /*0x1*/,
    PsResourcePageFile     = 2 /*0x2*/,
    PsResourceWorkingSet   = 3 /*0x3*/,
    PsResourceCpuRate      = 4 /*0x4*/,
    PsResourceMax          = 5 /*0x5*/
}PS_RESOURCE_TYPE, *PPS_RESOURCE_TYPE;

typedef enum _REG_NOTIFY_CLASS  // 59 elements, 0x4 bytes
{
    RegNtDeleteKey                    = 0 /*0x0*/,
    RegNtPreDeleteKey                 = 0 /*0x0*/,
    RegNtSetValueKey                  = 1 /*0x1*/,
    RegNtPreSetValueKey               = 1 /*0x1*/,
    RegNtDeleteValueKey               = 2 /*0x2*/,
    RegNtPreDeleteValueKey            = 2 /*0x2*/,
    RegNtSetInformationKey            = 3 /*0x3*/,
    RegNtPreSetInformationKey         = 3 /*0x3*/,
    RegNtRenameKey                    = 4 /*0x4*/,
    RegNtPreRenameKey                 = 4 /*0x4*/,
    RegNtEnumerateKey                 = 5 /*0x5*/,
    RegNtPreEnumerateKey              = 5 /*0x5*/,
    RegNtEnumerateValueKey            = 6 /*0x6*/,
    RegNtPreEnumerateValueKey         = 6 /*0x6*/,
    RegNtQueryKey                     = 7 /*0x7*/,
    RegNtPreQueryKey                  = 7 /*0x7*/,
    RegNtQueryValueKey                = 8 /*0x8*/,
    RegNtPreQueryValueKey             = 8 /*0x8*/,
    RegNtQueryMultipleValueKey        = 9 /*0x9*/,
    RegNtPreQueryMultipleValueKey     = 9 /*0x9*/,
    RegNtPreCreateKey                 = 10 /*0xA*/,
    RegNtPostCreateKey                = 11 /*0xB*/,
    RegNtPreOpenKey                   = 12 /*0xC*/,
    RegNtPostOpenKey                  = 13 /*0xD*/,
    RegNtKeyHandleClose               = 14 /*0xE*/,
    RegNtPreKeyHandleClose            = 14 /*0xE*/,
    RegNtPostDeleteKey                = 15 /*0xF*/,
    RegNtPostSetValueKey              = 16 /*0x10*/,
    RegNtPostDeleteValueKey           = 17 /*0x11*/,
    RegNtPostSetInformationKey        = 18 /*0x12*/,
    RegNtPostRenameKey                = 19 /*0x13*/,
    RegNtPostEnumerateKey             = 20 /*0x14*/,
    RegNtPostEnumerateValueKey        = 21 /*0x15*/,
    RegNtPostQueryKey                 = 22 /*0x16*/,
    RegNtPostQueryValueKey            = 23 /*0x17*/,
    RegNtPostQueryMultipleValueKey    = 24 /*0x18*/,
    RegNtPostKeyHandleClose           = 25 /*0x19*/,
    RegNtPreCreateKeyEx               = 26 /*0x1A*/,
    RegNtPostCreateKeyEx              = 27 /*0x1B*/,
    RegNtPreOpenKeyEx                 = 28 /*0x1C*/,
    RegNtPostOpenKeyEx                = 29 /*0x1D*/,
    RegNtPreFlushKey                  = 30 /*0x1E*/,
    RegNtPostFlushKey                 = 31 /*0x1F*/,
    RegNtPreLoadKey                   = 32 /*0x20*/,
    RegNtPostLoadKey                  = 33 /*0x21*/,
    RegNtPreUnLoadKey                 = 34 /*0x22*/,
    RegNtPostUnLoadKey                = 35 /*0x23*/,
    RegNtPreQueryKeySecurity          = 36 /*0x24*/,
    RegNtPostQueryKeySecurity         = 37 /*0x25*/,
    RegNtPreSetKeySecurity            = 38 /*0x26*/,
    RegNtPostSetKeySecurity           = 39 /*0x27*/,
    RegNtCallbackObjectContextCleanup = 40 /*0x28*/,
    RegNtPreRestoreKey                = 41 /*0x29*/,
    RegNtPostRestoreKey               = 42 /*0x2A*/,
    RegNtPreSaveKey                   = 43 /*0x2B*/,
    RegNtPostSaveKey                  = 44 /*0x2C*/,
    RegNtPreReplaceKey                = 45 /*0x2D*/,
    RegNtPostReplaceKey               = 46 /*0x2E*/,
    MaxRegNtNotifyClass               = 47 /*0x2F*/
}REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef enum _ReplacesCorHdrNumericDefines  // 24 elements, 0x4 bytes
{
    COMIMAGE_FLAGS_ILONLY                      = 1 /*0x1*/,
    COMIMAGE_FLAGS_32BITREQUIRED               = 2 /*0x2*/,
    COMIMAGE_FLAGS_IL_LIBRARY                  = 4 /*0x4*/,
    COMIMAGE_FLAGS_STRONGNAMESIGNED            = 8 /*0x8*/,
    COMIMAGE_FLAGS_NATIVE_ENTRYPOINT           = 16 /*0x10*/,
    COMIMAGE_FLAGS_TRACKDEBUGDATA              = 65536 /*0x10000*/,
    COR_VERSION_MAJOR_V2                       = 2 /*0x2*/,
    COR_VERSION_MAJOR                          = 2 /*0x2*/,
    COR_VERSION_MINOR                          = 0 /*0x0*/,
    COR_DELETED_NAME_LENGTH                    = 8 /*0x8*/,
    COR_VTABLEGAP_NAME_LENGTH                  = 8 /*0x8*/,
    NATIVE_TYPE_MAX_CB                         = 1 /*0x1*/,
    COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE       = 255 /*0xFF*/,
    IMAGE_COR_MIH_METHODRVA                    = 1 /*0x1*/,
    IMAGE_COR_MIH_EHRVA                        = 2 /*0x2*/,
    IMAGE_COR_MIH_BASICBLOCK                   = 8 /*0x8*/,
    COR_VTABLE_32BIT                           = 1 /*0x1*/,
    COR_VTABLE_64BIT                           = 2 /*0x2*/,
    COR_VTABLE_FROM_UNMANAGED                  = 4 /*0x4*/,
    COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8 /*0x8*/,
    COR_VTABLE_CALL_MOST_DERIVED               = 16 /*0x10*/,
    IMAGE_COR_EATJ_THUNK_SIZE                  = 32 /*0x20*/,
    MAX_CLASS_NAME                             = 1024 /*0x400*/,
    MAX_PACKAGE_NAME                           = 1024 /*0x400*/
}ReplacesCorHdrNumericDefines, *PReplacesCorHdrNumericDefines;

typedef enum _RTL_GENERIC_COMPARE_RESULTS  // 3 elements, 0x4 bytes
{
    GenericLessThan    = 0 /*0x0*/,
    GenericGreaterThan = 1 /*0x1*/,
    GenericEqual       = 2 /*0x2*/
}RTL_GENERIC_COMPARE_RESULTS, *PRTL_GENERIC_COMPARE_RESULTS;

typedef enum _SECURITY_IMPERSONATION_LEVEL  // 4 elements, 0x4 bytes
{
    SecurityAnonymous      = 0 /*0x0*/,
    SecurityIdentification = 1 /*0x1*/,
    SecurityImpersonation  = 2 /*0x2*/,
    SecurityDelegation     = 3 /*0x3*/
}SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _SECURITY_OPERATION_CODE  // 4 elements, 0x4 bytes
{
    SetSecurityDescriptor    = 0 /*0x0*/,
    QuerySecurityDescriptor  = 1 /*0x1*/,
    DeleteSecurityDescriptor = 2 /*0x2*/,
    AssignSecurityDescriptor = 3 /*0x3*/
}SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _SYSTEM_POWER_STATE  // 8 elements, 0x4 bytes
{
    PowerSystemUnspecified = 0 /*0x0*/,
    PowerSystemWorking     = 1 /*0x1*/,
    PowerSystemSleeping1   = 2 /*0x2*/,
    PowerSystemSleeping2   = 3 /*0x3*/,
    PowerSystemSleeping3   = 4 /*0x4*/,
    PowerSystemHibernate   = 5 /*0x5*/,
    PowerSystemShutdown    = 6 /*0x6*/,
    PowerSystemMaximum     = 7 /*0x7*/
}SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _TP_CALLBACK_PRIORITY  // 4 elements, 0x4 bytes
{
    TP_CALLBACK_PRIORITY_HIGH    = 0 /*0x0*/,
    TP_CALLBACK_PRIORITY_NORMAL  = 1 /*0x1*/,
    TP_CALLBACK_PRIORITY_LOW     = 2 /*0x2*/,
    TP_CALLBACK_PRIORITY_INVALID = 3 /*0x3*/
}TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT  // 9 elements, 0x4 bytes
{
    WheaDataFormatIPFSalRecord = 0 /*0x0*/,
    WheaDataFormatXPFMCA       = 1 /*0x1*/,
    WheaDataFormatMemory       = 2 /*0x2*/,
    WheaDataFormatPCIExpress   = 3 /*0x3*/,
    WheaDataFormatNMIPort      = 4 /*0x4*/,
    WheaDataFormatPCIXBus      = 5 /*0x5*/,
    WheaDataFormatPCIXDevice   = 6 /*0x6*/,
    WheaDataFormatGeneric      = 7 /*0x7*/,
    WheaDataFormatMax          = 8 /*0x8*/
}WHEA_ERROR_PACKET_DATA_FORMAT, *PWHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _WHEA_ERROR_SEVERITY  // 4 elements, 0x4 bytes
{
    WheaErrSevRecoverable   = 0 /*0x0*/,
    WheaErrSevFatal         = 1 /*0x1*/,
    WheaErrSevCorrected     = 2 /*0x2*/,
    WheaErrSevInformational = 3 /*0x3*/
}WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_SOURCE_TYPE  // 13 elements, 0x4 bytes
{
    WheaErrSrcTypeMCE        = 0 /*0x0*/,
    WheaErrSrcTypeCMC        = 1 /*0x1*/,
    WheaErrSrcTypeCPE        = 2 /*0x2*/,
    WheaErrSrcTypeNMI        = 3 /*0x3*/,
    WheaErrSrcTypePCIe       = 4 /*0x4*/,
    WheaErrSrcTypeGeneric    = 5 /*0x5*/,
    WheaErrSrcTypeINIT       = 6 /*0x6*/,
    WheaErrSrcTypeBOOT       = 7 /*0x7*/,
    WheaErrSrcTypeSCIGeneric = 8 /*0x8*/,
    WheaErrSrcTypeIPFMCA     = 9 /*0x9*/,
    WheaErrSrcTypeIPFCMC     = 10 /*0xA*/,
    WheaErrSrcTypeIPFCPE     = 11 /*0xB*/,
    WheaErrSrcTypeMax        = 12 /*0xC*/
}WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_TYPE  // 7 elements, 0x4 bytes
{
    WheaErrTypeProcessor  = 0 /*0x0*/,
    WheaErrTypeMemory     = 1 /*0x1*/,
    WheaErrTypePCIExpress = 2 /*0x2*/,
    WheaErrTypeNMI        = 3 /*0x3*/,
    WheaErrTypePCIXBus    = 4 /*0x4*/,
    WheaErrTypePCIXDevice = 5 /*0x5*/,
    WheaErrTypeGeneric    = 6 /*0x6*/
}WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef enum _WORKING_SET_TYPE  // 7 elements, 0x4 bytes
{
    WorkingSetTypeUser        = 0 /*0x0*/,
    WorkingSetTypeSession     = 1 /*0x1*/,
    WorkingSetTypeSystemTypes = 2 /*0x2*/,
    WorkingSetTypeSystemCache = 2 /*0x2*/,
    WorkingSetTypePagedPool   = 3 /*0x3*/,
    WorkingSetTypeSystemPtes  = 4 /*0x4*/,
    WorkingSetTypeMaximum     = 5 /*0x5*/
}WORKING_SET_TYPE, *PWORKING_SET_TYPE;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Information about structure types

typedef struct _ACCESS_REASONS;
typedef struct _ACCESS_STATE;
typedef struct _ACL;
typedef struct _ACTIVATION_CONTEXT;
typedef struct _ACTIVATION_CONTEXT_DATA;
typedef struct _ACTIVATION_CONTEXT_STACK;
typedef struct _ALPC_PROCESS_CONTEXT;
typedef struct _ASSEMBLY_STORAGE_MAP;
typedef struct _AUX_ACCESS_DATA;
typedef struct _CACHE_DESCRIPTOR;
typedef struct _CACHED_KSTACK_LIST;
typedef struct _CLIENT_ID;
typedef struct _CM_FULL_RESOURCE_DESCRIPTOR;
typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR;
typedef struct _CM_PARTIAL_RESOURCE_LIST;
typedef struct _CM_RESOURCE_LIST;
typedef struct _COMPRESSED_DATA_INFO;
typedef struct _CONTEXT;
typedef struct _COUNTER_READING;
typedef struct _CURDIR;
typedef struct _DESCRIPTOR;
typedef struct _DEVICE_CAPABILITIES;
typedef struct _DEVICE_OBJECT;
typedef struct _DEVICE_OBJECT_POWER_EXTENSION;
typedef struct _DEVOBJ_EXTENSION;
typedef struct _DISPATCHER_HEADER;
typedef struct _DPH_BLOCK_INFORMATION;
typedef struct _DPH_HEAP_BLOCK;
typedef struct _DPH_HEAP_ROOT;
typedef struct _DRIVER_EXTENSION;
typedef struct _DRIVER_OBJECT;
typedef struct _ECP_LIST;
typedef struct _EJOB;
typedef struct _EPROCESS;
typedef struct _EPROCESS_QUOTA_BLOCK;
typedef struct _ERESOURCE;
typedef struct _ETHREAD;
typedef struct _EVENT_DATA_DESCRIPTOR;
typedef struct _EVENT_DESCRIPTOR;
typedef struct _EX_FAST_REF;
typedef struct _EX_PUSH_LOCK;
typedef struct _EX_PUSH_LOCK_CACHE_AWARE;
typedef struct _EX_PUSH_LOCK_WAIT_BLOCK;
typedef struct _EX_RUNDOWN_REF;
typedef struct _EXCEPTION_RECORD;
typedef struct _EXCEPTION_REGISTRATION_RECORD;
typedef struct _FAST_IO_DISPATCH;
typedef struct _FAST_MUTEX;
typedef struct _FILE_BASIC_INFORMATION;
typedef struct _FILE_GET_QUOTA_INFORMATION;
typedef struct _FILE_NETWORK_OPEN_INFORMATION;
typedef struct _FILE_OBJECT;
typedef struct _FILE_STANDARD_INFORMATION;
typedef struct _flags;
typedef struct _FLOATING_SAVE_AREA;
typedef struct _FLS_CALLBACK_INFO;
typedef struct _FS_FILTER_CALLBACK_DATA;
typedef struct _FS_FILTER_CALLBACKS;
typedef union _FS_FILTER_PARAMETERS;
typedef struct _GDI_TEB_BATCH;
typedef struct _GENERAL_LOOKASIDE;
typedef struct _GENERAL_LOOKASIDE_POOL;
typedef struct _GENERIC_MAPPING;
typedef struct _GROUP_AFFINITY;
typedef struct _GUID;
typedef struct _HANDLE_TABLE;
typedef struct _HANDLE_TABLE_ENTRY;
typedef struct _HANDLE_TABLE_ENTRY_INFO;
typedef struct _HANDLE_TRACE_DB_ENTRY;
typedef struct _HANDLE_TRACE_DEBUG_INFO;
typedef struct _HARDWARE_PTE_X86;
typedef struct _HEAP;
typedef struct _HEAP_BUCKET;
typedef union _HEAP_BUCKET_COUNTERS;
typedef union _HEAP_BUCKET_RUN_INFO;
typedef struct _HEAP_COUNTERS;
typedef struct _HEAP_DEBUGGING_INFORMATION;
typedef struct _HEAP_ENTRY;
typedef struct _HEAP_ENTRY_EXTRA;
typedef struct _HEAP_FAILURE_INFORMATION;
typedef struct _HEAP_FREE_ENTRY;
typedef struct _HEAP_LIST_LOOKUP;
typedef struct _HEAP_LOCAL_DATA;
typedef struct _HEAP_LOCAL_SEGMENT_INFO;
typedef struct _HEAP_LOCK;
typedef struct _HEAP_PSEUDO_TAG_ENTRY;
typedef struct _HEAP_SEGMENT;
typedef struct _HEAP_SUBSEGMENT;
typedef struct _HEAP_TAG_ENTRY;
typedef struct _HEAP_TUNING_PARAMETERS;
typedef struct _HEAP_UCR_DESCRIPTOR;
typedef struct _HEAP_USERDATA_HEADER;
typedef struct _IMAGE_DATA_DIRECTORY;
typedef struct _IMAGE_DOS_HEADER;
typedef struct _IMAGE_FILE_HEADER;
typedef struct _IMAGE_NT_HEADERS;
typedef struct _IMAGE_OPTIONAL_HEADER;
typedef struct _INITIAL_PRIVILEGE_SET;
typedef struct _INTERFACE;
typedef struct _INTERLOCK_SEQ;
typedef struct _IO_CLIENT_EXTENSION;
typedef struct _IO_COMPLETION_CONTEXT;
typedef struct _IO_DRIVER_CREATE_CONTEXT;
typedef struct _IO_PRIORITY_INFO;
typedef struct _IO_RESOURCE_DESCRIPTOR;
typedef struct _IO_RESOURCE_LIST;
typedef struct _IO_RESOURCE_REQUIREMENTS_LIST;
typedef struct _IO_SECURITY_CONTEXT;
typedef struct _IO_STACK_LOCATION;
typedef struct _IO_STATUS_BLOCK;
typedef struct _IO_TIMER;
typedef struct _IRP;
typedef struct _JOB_ACCESS_STATE;
typedef struct _KAFFINITY_EX;
typedef struct _KAPC;
typedef struct _KAPC_STATE;
typedef struct _KDEVICE_QUEUE;
typedef struct _KDEVICE_QUEUE_ENTRY;
typedef struct _KDPC;
typedef struct _KDPC_DATA;
typedef struct _KEVENT;
typedef union _KEXECUTE_OPTIONS;
typedef struct _KGATE;
typedef struct _KGDTENTRY;
typedef struct _KIDTENTRY;
typedef struct _KiIoAccessMap;
typedef struct _KNODE;
typedef struct _KPCR;
typedef struct _KPRCB;
typedef struct _KPROCESS;
typedef struct _KPROCESSOR_STATE;
typedef struct _KQUEUE;
typedef struct _KSEMAPHORE;
typedef struct _KSPECIAL_REGISTERS;
typedef struct _KSPIN_LOCK_QUEUE;
typedef union _KSTACK_COUNT;
typedef struct _KSYSTEM_TIME;
typedef struct _KTHREAD;
typedef struct _KTHREAD_COUNTERS;
typedef struct _KTIMER;
typedef struct _KTIMER_TABLE;
typedef struct _KTIMER_TABLE_ENTRY;
typedef struct _KTRAP_FRAME;
typedef struct _KTSS;
typedef struct _KUSER_SHARED_DATA;
typedef struct _KWAIT_BLOCK;
typedef union _KWAIT_STATUS_REGISTER;
typedef union _LARGE_INTEGER;
typedef struct _LDR_DATA_TABLE_ENTRY;
typedef struct _LFH_BLOCK_ZONE;
typedef struct _LFH_HEAP;
typedef struct _LIST_ENTRY;
typedef struct _LIST_ENTRY32;
typedef struct _LIST_ENTRY64;
typedef struct _LOOKASIDE_LIST_EX;
typedef struct _LUID;
typedef struct _LUID_AND_ATTRIBUTES;
typedef struct _M128A;
typedef struct _MAILSLOT_CREATE_PARAMETERS;
typedef struct _MCA_EXCEPTION;
typedef union _MCI_ADDR;
typedef union _MCI_STATS;
typedef struct _MDL;
typedef struct _MM_AVL_TABLE;
typedef struct _MM_DRIVER_VERIFIER_DATA;
typedef struct _MM_PAGE_ACCESS_INFO;
typedef union _MM_PAGE_ACCESS_INFO_FLAGS;
typedef struct _MM_PAGE_ACCESS_INFO_HEADER;
typedef struct _MMADDRESS_NODE;
typedef struct _MMSUPPORT;
typedef struct _MMSUPPORT_FLAGS;
typedef struct _MMWSL;
typedef struct _NAMED_PIPE_CREATE_PARAMETERS;
typedef struct _NPAGED_LOOKASIDE_LIST;
typedef struct _NT_TIB;
typedef struct _OBJECT_ATTRIBUTES;
typedef struct _OBJECT_DUMP_CONTROL;
typedef struct _OBJECT_HANDLE_INFORMATION;
typedef struct _OBJECT_NAME_INFORMATION;
typedef struct _OBJECT_TYPE;
typedef struct _OBJECT_TYPE_INITIALIZER;
typedef struct _OWNER_ENTRY;
typedef struct _PAGED_LOOKASIDE_LIST;
typedef struct _PAGEFAULT_HISTORY;
typedef struct _PEB;
typedef struct _PEB_LDR_DATA;
typedef struct _PERFINFO_GROUPMASK;
typedef struct _PF_KERNEL_GLOBALS;
typedef struct _PO_DIAG_STACK_RECORD;
typedef struct _POWER_SEQUENCE;
typedef union _POWER_STATE;
typedef struct _PP_LOOKASIDE_LIST;
typedef struct _PPM_FFH_THROTTLE_STATE_INFO;
typedef struct _PPM_IDLE_STATE;
typedef struct _PPM_IDLE_STATES;
typedef struct _PRIVILEGE_SET;
typedef struct _PROC_HISTORY_ENTRY;
typedef struct _PROC_IDLE_ACCOUNTING;
typedef struct _PROC_IDLE_SNAP;
typedef struct _PROC_IDLE_STATE_ACCOUNTING;
typedef struct _PROC_IDLE_STATE_BUCKET;
typedef struct _PROC_PERF_CONSTRAINT;
typedef struct _PROC_PERF_DOMAIN;
typedef struct _PROC_PERF_LOAD;
typedef struct _PROCESSOR_NUMBER;
typedef struct _PROCESSOR_POWER_STATE;
typedef union _PS_CLIENT_SECURITY_CONTEXT;
typedef struct _PS_CPU_QUOTA_BLOCK;
typedef struct _PS_PER_CPU_QUOTA_CACHE_AWARE;
typedef union _PSP_CPU_QUOTA_APC;
typedef union _PSP_CPU_SHARE_CAPTURED_WEIGHT_DATA;
typedef struct _QUAD;
typedef struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME;
typedef struct _RTL_AVL_TABLE;
typedef struct _RTL_BALANCED_LINKS;
typedef struct _RTL_CRITICAL_SECTION;
typedef struct _RTL_CRITICAL_SECTION_DEBUG;
typedef struct _RTL_DRIVE_LETTER_CURDIR;
typedef struct _RTL_DYNAMIC_HASH_TABLE;
typedef struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENTRY;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR;
typedef struct _RTL_SRWLOCK;
typedef struct _RTL_STACK_DATABASE_LOCK;
typedef struct _RTL_STACK_TRACE_ENTRY;
typedef struct _RTL_STD_LIST_ENTRY;
typedef struct _RTL_STD_LIST_HEAD;
typedef struct _RTL_TRACE_BLOCK;
typedef struct _RTL_TRACE_DATABASE;
typedef struct _RTL_TRACE_SEGMENT;
typedef struct _RTL_USER_PROCESS_PARAMETERS;
typedef struct _SCSI_REQUEST_BLOCK;
typedef struct _SE_AUDIT_PROCESS_CREATION_INFO;
typedef struct _SECTION_OBJECT_POINTERS;
typedef struct _SECURITY_DESCRIPTOR;
typedef struct _SECURITY_QUALITY_OF_SERVICE;
typedef struct _SECURITY_SUBJECT_CONTEXT;
typedef struct _SID;
typedef struct _SID_IDENTIFIER_AUTHORITY;
typedef struct _SINGLE_LIST_ENTRY;
typedef union _SLIST_HEADER;
typedef struct _STACK_TRACE_DATABASE;
typedef struct _STRING;
typedef struct _SYSTEM_POWER_STATE_CONTEXT;
typedef struct _TEB;
typedef struct _TEB_ACTIVE_FRAME;
typedef struct _TEB_ACTIVE_FRAME_CONTEXT;
typedef struct _TERMINATION_PORT;
typedef struct _THREAD_PERFORMANCE_DATA;
typedef struct _TP_CALLBACK_ENVIRON_V3;
typedef struct _TP_CALLBACK_INSTANCE;
typedef struct _TP_CLEANUP_GROUP;
typedef struct _TP_DIRECT;
typedef struct _TP_NBQ_GUARD;
typedef struct _TP_POOL;
typedef struct _TP_TASK;
typedef struct _TP_TASK_CALLBACKS;
typedef struct _TXN_PARAMETER_BLOCK;
typedef union _ULARGE_INTEGER;
typedef struct _UNICODE_STRING;
typedef struct _USER_MEMORY_CACHE_ENTRY;
typedef struct _VPB;
typedef struct _WAIT_CONTEXT_BLOCK;
typedef union _WHEA_ERROR_PACKET_FLAGS;
typedef struct _WHEA_ERROR_PACKET_V2;
typedef struct _WHEA_ERROR_RECORD;
typedef struct _WHEA_ERROR_RECORD_HEADER;
typedef union _WHEA_ERROR_RECORD_HEADER_FLAGS;
typedef union _WHEA_ERROR_RECORD_HEADER_VALIDBITS;
typedef struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;
typedef union _WHEA_PERSISTENCE_INFO;
typedef union _WHEA_REVISION;
typedef union _WHEA_TIMESTAMP;
typedef struct _XSAVE_AREA;
typedef struct _XSAVE_AREA_HEADER;
typedef struct _XSAVE_FORMAT;
typedef struct _XSTATE_CONFIGURATION;
typedef struct _XSTATE_CONTEXT;
typedef struct _XSTATE_FEATURE;
typedef struct _XSTATE_SAVE;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Function types

typedef VOID (NEAR STDCALL FUNCT_00A4_00A3_CleanupGroupCancelCallback_DeRefSecurityDescriptor) (VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00A4_00AB_FinalizationCallback) (struct _TP_CALLBACK_INSTANCE*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00A4_00C8_ExecuteCallback) (struct _TP_CALLBACK_INSTANCE*, struct _TP_TASK*);
typedef VOID (NEAR STDCALL FUNCT_00A4_00CD_Unposted) (struct _TP_TASK*, struct _TP_POOL*);
typedef VOID (NEAR STDCALL FUNCT_00A4_00E0_Callback) (struct _TP_CALLBACK_INSTANCE*, struct _TP_DIRECT*, VOID*, struct _IO_STATUS_BLOCK*);
typedef enum _EXCEPTION_DISPOSITION (NEAR STDCALL FUNCT_015F_015E_Handler) (struct _EXCEPTION_RECORD*, VOID*, struct _CONTEXT*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00A4_024F_PostProcessInitRoutine) ();
typedef VOID (NEAR STDCALL FUNCT_00A4_0530_DeferredRoutine) (struct _KDPC*, VOID*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00A4_057F_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00A4_0576_KernelRoutine) (struct _KAPC*, FUNCT_00A4_057F_NormalRoutine**, VOID**, VOID**, VOID**);
typedef VOID (NEAR STDCALL FUNCT_00A4_057F_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00A4_0584_RundownRoutine) (struct _KAPC*);
typedef VOID* (NEAR STDCALL FUNCT_00A7_0652_AllocateEx) (enum _POOL_TYPE, ULONG32, ULONG32, struct _LOOKASIDE_LIST_EX*);
typedef VOID* (NEAR STDCALL FUNCT_00A7_065C_Allocate) (enum _POOL_TYPE, ULONG32, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00A4_0661_FreeEx) (VOID*, struct _LOOKASIDE_LIST_EX*);
typedef VOID (NEAR STDCALL FUNCT_00A4_0665_Free_InterfaceReference_InterfaceDereference_DeleteProcedure) (VOID*);
typedef VOID (NEAR STDCALL FUNCT_00A4_066B_WorkerRoutine) (VOID*, VOID*, VOID*, VOID*);
typedef LONG32 (NEAR FASTCALL FUNCT_000F_06C3_IdleCheck) (VOID*);
typedef VOID (NEAR FASTCALL FUNCT_00A4_06C5_IdleHandler) (VOID*);
typedef UINT8 (NEAR FASTCALL FUNCT_0067_0708_FeedbackHandler) (ULONG32*, ULONG32, UINT8);
typedef VOID (NEAR FASTCALL FUNCT_00A4_070E_GetFFHThrottleState) (UINT64*);
typedef VOID (NEAR FASTCALL FUNCT_00A4_0712_BoostPolicyHandler) (ULONG32);
typedef ULONG32 (NEAR FASTCALL FUNCT_0009_0715_PerfSelectionHandler) (ULONG32, ULONG32, ULONG32, ULONG32, ULONG32, ULONG32*, ULONG32*);
typedef VOID (NEAR FASTCALL FUNCT_00A4_071E_PerfHandler) (ULONG32, ULONG32);
typedef LONG32 (NEAR STDCALL FUNCT_000F_086F_AddDevice) (struct _DRIVER_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0887_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter) (struct _FS_FILTER_CALLBACK_DATA*, VOID**);
typedef VOID (NEAR STDCALL FUNCT_00A4_0900_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter) (struct _FS_FILTER_CALLBACK_DATA*, LONG32, VOID*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0924_FastIoCheckIfPossible) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_092E_FastIoRead_FastIoWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, VOID*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0938_FastIoQueryBasicInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_BASIC_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0946_FastIoQueryStandardInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_STANDARD_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0954_FastIoLock) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, UINT8, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0ABC_FastIoUnlockSingle) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0AC5_FastIoUnlockAll) (struct _FILE_OBJECT*, struct _EPROCESS*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0ACB_FastIoUnlockAllByKey) (struct _FILE_OBJECT*, VOID*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0AD2_FastIoDeviceControl) (struct _FILE_OBJECT*, UINT8, VOID*, ULONG32, VOID*, ULONG32, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00A4_0ADD_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection) (struct _FILE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00A4_0AE0_FastIoDetachDevice) (struct _DEVICE_OBJECT*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0AE4_FastIoQueryNetworkOpenInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0AF4_AcquireForModWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _ERESOURCE**, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0AFA_MdlRead_PrepareMdlWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0B0E_MdlReadComplete_MdlReadCompleteCompressed) (struct _FILE_OBJECT*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0B13_MdlWriteComplete_MdlWriteCompleteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0B19_FastIoReadCompressed_FastIoWriteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, VOID*, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _COMPRESSED_DATA_INFO*, ULONG32, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0B2E_FastIoQueryOpen) (struct _IRP*, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00A4_0B55_UserApcRoutine) (VOID*, struct _IO_STATUS_BLOCK*, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00A4_0B5A_DriverStartIo_CancelRoutine) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0DDC_CompletionRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0DE1_ReleaseForModWrite) (struct _FILE_OBJECT*, struct _ERESOURCE*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0DE6_AcquireForCcFlush_ReleaseForCcFlush) (struct _FILE_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0DEA_DriverInit) (struct _DRIVER_OBJECT*, struct _UNICODE_STRING*);
typedef VOID (NEAR STDCALL FUNCT_00A4_0DEE_DriverUnload) (struct _DRIVER_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0DF2_MajorFunction) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef VOID (NEAR STDCALL FUNCT_00A4_0DFC_TimerRoutine) (struct _DEVICE_OBJECT*, VOID*);
typedef enum _IO_ALLOCATION_ACTION (NEAR STDCALL FUNCT_0E0C_0E0B_DeviceRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00A4_0E8D_DumpProcedure) (VOID*, struct _OBJECT_DUMP_CONTROL*);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0E95_OpenProcedure) (enum _OB_OPEN_REASON, CHAR, struct _EPROCESS*, VOID*, ULONG32*, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00A4_0EA3_CloseProcedure) (struct _EPROCESS*, VOID*, ULONG32, ULONG32);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0EA9_ParseProcedure) (VOID*, VOID*, struct _ACCESS_STATE*, CHAR, ULONG32, struct _UNICODE_STRING*, struct _UNICODE_STRING*, VOID*, struct _SECURITY_QUALITY_OF_SERVICE*, VOID**);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0EB5_SecurityProcedure) (VOID*, enum _SECURITY_OPERATION_CODE, ULONG32*, VOID*, ULONG32*, VOID**, enum _POOL_TYPE, struct _GENERIC_MAPPING*, CHAR);
typedef LONG32 (NEAR STDCALL FUNCT_000F_0EC6_QueryNameProcedure) (VOID*, UINT8, struct _OBJECT_NAME_INFORMATION*, ULONG32, ULONG32*, CHAR);
typedef UINT8 (NEAR STDCALL FUNCT_0067_0ECE_OkayToCloseProcedure) (struct _EPROCESS*, VOID*, VOID*, CHAR);
typedef LONG32 (NEAR STDCALL FUNCT_000F_1024_CommitRoutine) (VOID*, VOID**, ULONG32*);
typedef LONG32 (NEAR STDCALL FUNCT_000F_1218_HeapLeakEnumerationRoutine) (LONG32, VOID*, VOID*, ULONG32, ULONG32, VOID*);
typedef ULONG32 (NEAR STDCALL FUNCT_0009_1281_HashFunction) (ULONG32, VOID**);
typedef enum _RTL_GENERIC_COMPARE_RESULTS (NEAR STDCALL FUNCT_1315_1314_CompareRoutine) (struct _RTL_AVL_TABLE*, VOID*, VOID*);
typedef VOID* (NEAR STDCALL FUNCT_00A7_131E_AllocateRoutine) (struct _RTL_AVL_TABLE*, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00A4_1322_FreeRoutine) (struct _RTL_AVL_TABLE*, VOID*);

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Structure types

          typedef struct _ACCESS_REASONS // 1 elements, 0x80 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      Data[32];                                        
          }ACCESS_REASONS, *PACCESS_REASONS;                                   
                                                                            
          typedef struct _LUID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     ULONG32      LowPart;                                    
/*0x004*/     LONG32       HighPart;                                   
          }LUID, *PLUID;                                               
                                                                       
          typedef struct _SECURITY_SUBJECT_CONTEXT                   // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                             
/*0x000*/     VOID*        ClientToken;                                                                 
/*0x004*/     enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                                    
/*0x008*/     VOID*        PrimaryToken;                                                                
/*0x00C*/     VOID*        ProcessAuditId;                                                              
          }SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT;                                        
                                                                                                        
          typedef struct _LUID_AND_ATTRIBUTES // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _LUID Luid;              // 2 elements, 0x8 bytes (sizeof) 
/*0x008*/     ULONG32      Attributes;                                          
          }LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES;                                  
                                                                                
          typedef struct _INITIAL_PRIVILEGE_SET         // 3 elements, 0x2C bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[3];                                    
          }INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET;                                   
                                                                                           
          typedef struct _PRIVILEGE_SET                 // 3 elements, 0x14 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[1];                                    
          }PRIVILEGE_SET, *PPRIVILEGE_SET;                                                 
                                                                                           
          typedef struct _UNICODE_STRING  // 3 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     UINT16       Length;                                          
/*0x002*/     UINT16       MaximumLength;                                   
/*0x004*/     UINT16*      Buffer;                                          
          }UNICODE_STRING, *PUNICODE_STRING;                                  
                                                                            
          typedef struct _ACCESS_STATE                                 // 16 elements, 0x74 bytes (sizeof) 
          {                                                                                                
/*0x000*/     struct _LUID OperationID;                                // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     UINT8        SecurityEvaluated;                                                              
/*0x009*/     UINT8        GenerateAudit;                                                                  
/*0x00A*/     UINT8        GenerateOnClose;                                                                
/*0x00B*/     UINT8        PrivilegesAllocated;                                                            
/*0x00C*/     ULONG32      Flags;                                                                          
/*0x010*/     ULONG32      RemainingDesiredAccess;                                                         
/*0x014*/     ULONG32      PreviouslyGrantedAccess;                                                        
/*0x018*/     ULONG32      OriginalDesiredAccess;                                                          
/*0x01C*/     struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext; // 4 elements, 0x10 bytes (sizeof)  
/*0x02C*/     VOID*        SecurityDescriptor;                                                             
/*0x030*/     VOID*        AuxData;                                                                        
              union                                                    // 2 elements, 0x2C bytes (sizeof)  
              {                                                                                            
/*0x034*/         struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;   // 3 elements, 0x2C bytes (sizeof)  
/*0x034*/         struct _PRIVILEGE_SET PrivilegeSet;                  // 3 elements, 0x14 bytes (sizeof)  
              }Privileges;                                                                                 
/*0x060*/     UINT8        AuditPrivileges;                                                                
/*0x061*/     UINT8        _PADDING0_[0x3];                                                                
/*0x064*/     struct _UNICODE_STRING ObjectName;                       // 3 elements, 0x8 bytes (sizeof)   
/*0x06C*/     struct _UNICODE_STRING ObjectTypeName;                   // 3 elements, 0x8 bytes (sizeof)   
          }ACCESS_STATE, *PACCESS_STATE;                                                                   
                                                                                                           
          typedef struct _ACL           // 5 elements, 0x8 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT8        AclRevision;                                   
/*0x001*/     UINT8        Sbz1;                                          
/*0x002*/     UINT16       AclSize;                                       
/*0x004*/     UINT16       AceCount;                                      
/*0x006*/     UINT16       Sbz2;                                          
          }ACL, *PACL;                                                    
                                                                          
typedef struct _ACTIVATION_CONTEXT // 0 elements, 0x0 bytes (sizeof) 
{                                                                    
}ACTIVATION_CONTEXT, *PACTIVATION_CONTEXT;                                  
                                                                     
typedef struct _ACTIVATION_CONTEXT_DATA // 0 elements, 0x0 bytes (sizeof) 
{                                                                         
}ACTIVATION_CONTEXT_DATA, *PACTIVATION_CONTEXT_DATA;                                  
                                                                          
          typedef struct _LIST_ENTRY     // 2 elements, 0x8 bytes (sizeof) 
          {                                                                
/*0x000*/     struct _LIST_ENTRY* Flink;                                   
/*0x004*/     struct _LIST_ENTRY* Blink;                                   
          }LIST_ENTRY, *PLIST_ENTRY;                                       
                                                                           
          typedef struct _ACTIVATION_CONTEXT_STACK                     // 5 elements, 0x18 bytes (sizeof) 
          {                                                                                               
/*0x000*/     struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;                                    
/*0x004*/     struct _LIST_ENTRY FrameListCache;                       // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     ULONG32      Flags;                                                                         
/*0x010*/     ULONG32      NextCookieSequenceNumber;                                                      
/*0x014*/     ULONG32      StackId;                                                                       
          }ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK;                                          
                                                                                                          
          typedef struct _EX_PUSH_LOCK                 // 7 elements, 0x4 bytes (sizeof) 
          {                                                                              
              union                                    // 3 elements, 0x4 bytes (sizeof) 
              {                                                                          
                  struct                               // 5 elements, 0x4 bytes (sizeof) 
                  {                                                                      
/*0x000*/             ULONG32      Locked : 1;         // 0 BitPosition                  
/*0x000*/             ULONG32      Waiting : 1;        // 1 BitPosition                  
/*0x000*/             ULONG32      Waking : 1;         // 2 BitPosition                  
/*0x000*/             ULONG32      MultipleShared : 1; // 3 BitPosition                  
/*0x000*/             ULONG32      Shared : 28;        // 4 BitPosition                  
                  };                                                                     
/*0x000*/         ULONG32      Value;                                                    
/*0x000*/         VOID*        Ptr;                                                      
              };                                                                         
          }EX_PUSH_LOCK, *PEX_PUSH_LOCK;                                                 
                                                                                         
          typedef struct _ALPC_PROCESS_CONTEXT  // 3 elements, 0x10 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _EX_PUSH_LOCK Lock;        // 7 elements, 0x4 bytes (sizeof)  
/*0x004*/     struct _LIST_ENTRY ViewListHead;  // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     ULONG32      PagedPoolQuotaCache;                                    
          }ALPC_PROCESS_CONTEXT, *PALPC_PROCESS_CONTEXT;                                   
                                                                                   
typedef struct _ASSEMBLY_STORAGE_MAP // 0 elements, 0x0 bytes (sizeof) 
{                                                                      
}ASSEMBLY_STORAGE_MAP, *PASSEMBLY_STORAGE_MAP;                                  
                                                                       
          typedef struct _GENERIC_MAPPING  // 4 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     ULONG32      GenericRead;                                       
/*0x004*/     ULONG32      GenericWrite;                                      
/*0x008*/     ULONG32      GenericExecute;                                    
/*0x00C*/     ULONG32      GenericAll;                                        
          }GENERIC_MAPPING, *PGENERIC_MAPPING;                                   
                                                                              
          typedef struct _GUID       // 4 elements, 0x10 bytes (sizeof) 
          {                                                             
/*0x000*/     ULONG32      Data1;                                       
/*0x004*/     UINT16       Data2;                                       
/*0x006*/     UINT16       Data3;                                       
/*0x008*/     UINT8        Data4[8];                                    
          }GUID, *PGUID;                                                
                                                                        
          typedef struct _AUX_ACCESS_DATA                                                                  // 11 elements, 0xC0 bytes (sizeof) 
          {                                                                                                                                    
/*0x000*/     struct _PRIVILEGE_SET* PrivilegesUsed;                                                                                           
/*0x004*/     struct _GENERIC_MAPPING GenericMapping;                                                      // 4 elements, 0x10 bytes (sizeof)  
/*0x014*/     ULONG32      AccessesToAudit;                                                                                                    
/*0x018*/     ULONG32      MaximumAuditMask;                                                                                                   
/*0x01C*/     struct _GUID TransactionId;                                                                  // 4 elements, 0x10 bytes (sizeof)  
/*0x02C*/     VOID*        NewSecurityDescriptor;                                                                                              
/*0x030*/     VOID*        ExistingSecurityDescriptor;                                                                                         
/*0x034*/     VOID*        ParentSecurityDescriptor;                                                                                           
/*0x038*/     FUNCT_00A4_00A3_CleanupGroupCancelCallback_DeRefSecurityDescriptor* DeRefSecurityDescriptor;                                     
/*0x03C*/     VOID*        SDLock;                                                                                                             
/*0x040*/     struct _ACCESS_REASONS AccessReasons;                                                        // 1 elements, 0x80 bytes (sizeof)  
          }AUX_ACCESS_DATA, *PAUX_ACCESS_DATA;                                                                                                 
                                                                                                                                               
          typedef struct _CACHE_DESCRIPTOR     // 5 elements, 0xC bytes (sizeof) 
          {                                                                      
/*0x000*/     UINT8        Level;                                                
/*0x001*/     UINT8        Associativity;                                        
/*0x002*/     UINT16       LineSize;                                             
/*0x004*/     ULONG32      Size;                                                 
/*0x008*/     enum _PROCESSOR_CACHE_TYPE Type;                                   
          }CACHE_DESCRIPTOR, *PCACHE_DESCRIPTOR;                                  
                                                                                 
          typedef struct _SINGLE_LIST_ENTRY    // 1 elements, 0x4 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _SINGLE_LIST_ENTRY* Next;                                   
          }SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY;                                  
                                                                                 
          typedef union _SLIST_HEADER             // 4 elements, 0x8 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT64       Alignment;                                               
              struct                              // 3 elements, 0x8 bytes (sizeof) 
              {                                                                     
/*0x000*/         struct _SINGLE_LIST_ENTRY Next; // 1 elements, 0x4 bytes (sizeof) 
/*0x004*/         UINT16       Depth;                                               
/*0x006*/         UINT16       Sequence;                                            
              };                                                                    
          }SLIST_HEADER, *PSLIST_HEADER;                                            
                                                                                    
          typedef struct _CACHED_KSTACK_LIST // 5 elements, 0x18 bytes (sizeof) 
          {                                                                     
/*0x000*/     union _SLIST_HEADER SListHead; // 4 elements, 0x8 bytes (sizeof)  
/*0x008*/     LONG32       MinimumFree;                                         
/*0x00C*/     ULONG32      Misses;                                              
/*0x010*/     ULONG32      MissesLast;                                          
/*0x014*/     ULONG32      Pad0;                                                
          }CACHED_KSTACK_LIST, *PCACHED_KSTACK_LIST;                                   
                                                                                
          typedef struct _CLIENT_ID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     VOID*        UniqueProcess;                                   
/*0x004*/     VOID*        UniqueThread;                                    
          }CLIENT_ID, *PCLIENT_ID;                                          
                                                                            
          typedef union _LARGE_INTEGER   // 4 elements, 0x8 bytes (sizeof) 
          {                                                                
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              };                                                           
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              }u;                                                          
/*0x000*/     INT64        QuadPart;                                       
          }LARGE_INTEGER, *PLARGE_INTEGER;                                  
                                                                           
          typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                 
/*0x000*/     UINT8        Type;                                                            
/*0x001*/     UINT8        ShareDisposition;                                                
/*0x002*/     UINT16       Flags;                                                           
              union                                      // 12 elements, 0xC bytes (sizeof) 
              {                                                                             
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length;                                                  
                  }Generic;                                                                 
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length;                                                  
                  }Port;                                                                    
                  struct                                 // 4 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             UINT16       Level;                                                   
/*0x006*/             UINT16       Group;                                                   
/*0x008*/             ULONG32      Vector;                                                  
/*0x00C*/             ULONG32      Affinity;                                                
                  }Interrupt;                                                               
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
                      union                              // 2 elements, 0xC bytes (sizeof)  
                      {                                                                     
                          struct                         // 4 elements, 0xC bytes (sizeof)  
                          {                                                                 
/*0x004*/                     UINT16       Group;                                           
/*0x006*/                     UINT16       MessageCount;                                    
/*0x008*/                     ULONG32      Vector;                                          
/*0x00C*/                     ULONG32      Affinity;                                        
                          }Raw;                                                             
                          struct                         // 4 elements, 0xC bytes (sizeof)  
                          {                                                                 
/*0x004*/                     UINT16       Level;                                           
/*0x006*/                     UINT16       Group;                                           
/*0x008*/                     ULONG32      Vector;                                          
/*0x00C*/                     ULONG32      Affinity;                                        
                          }Translated;                                                      
                      };                                                                    
                  }MessageInterrupt;                                                        
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length;                                                  
                  }Memory;                                                                  
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Channel;                                                 
/*0x008*/             ULONG32      Port;                                                    
/*0x00C*/             ULONG32      Reserved1;                                               
                  }Dma;                                                                     
                  struct                                 // 1 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Data[3];                                                 
                  }DevicePrivate;                                                           
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Start;                                                   
/*0x008*/             ULONG32      Length;                                                  
/*0x00C*/             ULONG32      Reserved;                                                
                  }BusNumber;                                                               
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      DataSize;                                                
/*0x008*/             ULONG32      Reserved1;                                               
/*0x00C*/             ULONG32      Reserved2;                                               
                  }DeviceSpecificData;                                                      
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length40;                                                
                  }Memory40;                                                                
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length48;                                                
                  }Memory48;                                                                
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length64;                                                
                  }Memory64;                                                                
              }u;                                                                           
          }CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR;                                   
                                                                                            
          typedef struct _CM_PARTIAL_RESOURCE_LIST                          // 4 elements, 0x18 bytes (sizeof) 
          {                                                                                                    
/*0x000*/     UINT16       Version;                                                                            
/*0x002*/     UINT16       Revision;                                                                           
/*0x004*/     ULONG32      Count;                                                                              
/*0x008*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];                                    
          }CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST;                                               
                                                                                                               
          typedef struct _CM_FULL_RESOURCE_DESCRIPTOR               // 3 elements, 0x20 bytes (sizeof) 
          {                                                                                            
/*0x000*/     enum _INTERFACE_TYPE InterfaceType;                                                      
/*0x004*/     ULONG32      BusNumber;                                                                  
/*0x008*/     struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList; // 4 elements, 0x18 bytes (sizeof) 
          }CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR;                                   
                                                                                                       
          typedef struct _CM_RESOURCE_LIST                 // 2 elements, 0x24 bytes (sizeof) 
          {                                                                                   
/*0x000*/     ULONG32      Count;                                                             
/*0x004*/     struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];                                    
          }CM_RESOURCE_LIST, *PCM_RESOURCE_LIST;                                              
                                                                                              
          typedef struct _COMPRESSED_DATA_INFO         // 7 elements, 0xC bytes (sizeof) 
          {                                                                              
/*0x000*/     UINT16       CompressionFormatAndEngine;                                   
/*0x002*/     UINT8        CompressionUnitShift;                                         
/*0x003*/     UINT8        ChunkShift;                                                   
/*0x004*/     UINT8        ClusterShift;                                                 
/*0x005*/     UINT8        Reserved;                                                     
/*0x006*/     UINT16       NumberOfChunks;                                               
/*0x008*/     ULONG32      CompressedChunkSizes[1];                                      
          }COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO;                                  
                                                                                         
          typedef struct _FLOATING_SAVE_AREA // 9 elements, 0x70 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      ControlWord;                                         
/*0x004*/     ULONG32      StatusWord;                                          
/*0x008*/     ULONG32      TagWord;                                             
/*0x00C*/     ULONG32      ErrorOffset;                                         
/*0x010*/     ULONG32      ErrorSelector;                                       
/*0x014*/     ULONG32      DataOffset;                                          
/*0x018*/     ULONG32      DataSelector;                                        
/*0x01C*/     UINT8        RegisterArea[80];                                    
/*0x06C*/     ULONG32      Cr0NpxState;                                         
          }FLOATING_SAVE_AREA, *PFLOATING_SAVE_AREA;                                   
                                                                                
          typedef struct _CONTEXT                   // 25 elements, 0x2CC bytes (sizeof) 
          {                                                                              
/*0x000*/     ULONG32      ContextFlags;                                                 
/*0x004*/     ULONG32      Dr0;                                                          
/*0x008*/     ULONG32      Dr1;                                                          
/*0x00C*/     ULONG32      Dr2;                                                          
/*0x010*/     ULONG32      Dr3;                                                          
/*0x014*/     ULONG32      Dr6;                                                          
/*0x018*/     ULONG32      Dr7;                                                          
/*0x01C*/     struct _FLOATING_SAVE_AREA FloatSave; // 9 elements, 0x70 bytes (sizeof)   
/*0x08C*/     ULONG32      SegGs;                                                        
/*0x090*/     ULONG32      SegFs;                                                        
/*0x094*/     ULONG32      SegEs;                                                        
/*0x098*/     ULONG32      SegDs;                                                        
/*0x09C*/     ULONG32      Edi;                                                          
/*0x0A0*/     ULONG32      Esi;                                                          
/*0x0A4*/     ULONG32      Ebx;                                                          
/*0x0A8*/     ULONG32      Edx;                                                          
/*0x0AC*/     ULONG32      Ecx;                                                          
/*0x0B0*/     ULONG32      Eax;                                                          
/*0x0B4*/     ULONG32      Ebp;                                                          
/*0x0B8*/     ULONG32      Eip;                                                          
/*0x0BC*/     ULONG32      SegCs;                                                        
/*0x0C0*/     ULONG32      EFlags;                                                       
/*0x0C4*/     ULONG32      Esp;                                                          
/*0x0C8*/     ULONG32      SegSs;                                                        
/*0x0CC*/     UINT8        ExtendedRegisters[512];                                       
          }CONTEXT, *PCONTEXT;                                                           
                                                                                         
          typedef struct _COUNTER_READING       // 4 elements, 0x18 bytes (sizeof) 
          {                                                                        
/*0x000*/     enum _HARDWARE_COUNTER_TYPE Type;                                    
/*0x004*/     ULONG32      Index;                                                  
/*0x008*/     UINT64       Start;                                                  
/*0x010*/     UINT64       Total;                                                  
          }COUNTER_READING, *PCOUNTER_READING;                                     
                                                                                   
          typedef struct _CURDIR              // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _UNICODE_STRING DosPath; // 3 elements, 0x8 bytes (sizeof) 
/*0x008*/     VOID*        Handle;                                              
          }CURDIR, *PCURDIR;                                                    
                                                                                
          typedef struct _DESCRIPTOR // 3 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     UINT16       Pad;                                        
/*0x002*/     UINT16       Limit;                                      
/*0x004*/     ULONG32      Base;                                       
          }DESCRIPTOR, *PDESCRIPTOR;                                   
                                                                       
          typedef struct _DEVICE_CAPABILITIES          // 30 elements, 0x40 bytes (sizeof) 
          {                                                                                
/*0x000*/     UINT16       Size;                                                           
/*0x002*/     UINT16       Version;                                                        
              struct                                   // 20 elements, 0x4 bytes (sizeof)  
              {                                                                            
/*0x004*/         ULONG32      DeviceD1 : 1;           // 0 BitPosition                    
/*0x004*/         ULONG32      DeviceD2 : 1;           // 1 BitPosition                    
/*0x004*/         ULONG32      LockSupported : 1;      // 2 BitPosition                    
/*0x004*/         ULONG32      EjectSupported : 1;     // 3 BitPosition                    
/*0x004*/         ULONG32      Removable : 1;          // 4 BitPosition                    
/*0x004*/         ULONG32      DockDevice : 1;         // 5 BitPosition                    
/*0x004*/         ULONG32      UniqueID : 1;           // 6 BitPosition                    
/*0x004*/         ULONG32      SilentInstall : 1;      // 7 BitPosition                    
/*0x004*/         ULONG32      RawDeviceOK : 1;        // 8 BitPosition                    
/*0x004*/         ULONG32      SurpriseRemovalOK : 1;  // 9 BitPosition                    
/*0x004*/         ULONG32      WakeFromD0 : 1;         // 10 BitPosition                   
/*0x004*/         ULONG32      WakeFromD1 : 1;         // 11 BitPosition                   
/*0x004*/         ULONG32      WakeFromD2 : 1;         // 12 BitPosition                   
/*0x004*/         ULONG32      WakeFromD3 : 1;         // 13 BitPosition                   
/*0x004*/         ULONG32      HardwareDisabled : 1;   // 14 BitPosition                   
/*0x004*/         ULONG32      NonDynamic : 1;         // 15 BitPosition                   
/*0x004*/         ULONG32      WarmEjectSupported : 1; // 16 BitPosition                   
/*0x004*/         ULONG32      NoDisplayInUI : 1;      // 17 BitPosition                   
/*0x004*/         ULONG32      Reserved1 : 1;          // 18 BitPosition                   
/*0x004*/         ULONG32      Reserved : 13;          // 19 BitPosition                   
              };                                                                           
/*0x008*/     ULONG32      Address;                                                        
/*0x00C*/     ULONG32      UINumber;                                                       
/*0x010*/     enum _DEVICE_POWER_STATE DeviceState[7];                                     
/*0x02C*/     enum _SYSTEM_POWER_STATE SystemWake;                                         
/*0x030*/     enum _DEVICE_POWER_STATE DeviceWake;                                         
/*0x034*/     ULONG32      D1Latency;                                                      
/*0x038*/     ULONG32      D2Latency;                                                      
/*0x03C*/     ULONG32      D3Latency;                                                      
          }DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES;                                     
                                                                                           
          typedef struct _KDEVICE_QUEUE_ENTRY     // 3 elements, 0x10 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _LIST_ENTRY DeviceListEntry; // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     ULONG32      SortKey;                                                  
/*0x00C*/     UINT8        Inserted;                                                 
/*0x00D*/     UINT8        _PADDING0_[0x3];                                          
          }KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY;                                   
                                                                                     
          typedef struct _WAIT_CONTEXT_BLOCK                // 7 elements, 0x28 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _KDEVICE_QUEUE_ENTRY WaitQueueEntry;   // 3 elements, 0x10 bytes (sizeof) 
/*0x010*/     FUNCT_0E0C_0E0B_DeviceRoutine* DeviceRoutine;                                    
/*0x014*/     VOID*        DeviceContext;                                                      
/*0x018*/     ULONG32      NumberOfMapRegisters;                                               
/*0x01C*/     VOID*        DeviceObject;                                                       
/*0x020*/     VOID*        CurrentIrp;                                                         
/*0x024*/     struct _KDPC* BufferChainingDpc;                                                 
          }WAIT_CONTEXT_BLOCK, *PWAIT_CONTEXT_BLOCK;                                           
                                                                                               
          typedef struct _KDEVICE_QUEUE          // 5 elements, 0x14 bytes (sizeof) 
          {                                                                         
/*0x000*/     INT16        Type;                                                    
/*0x002*/     INT16        Size;                                                    
/*0x004*/     struct _LIST_ENTRY DeviceListHead; // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     ULONG32      Lock;                                                    
/*0x010*/     UINT8        Busy;                                                    
/*0x011*/     UINT8        _PADDING0_[0x3];                                         
          }KDEVICE_QUEUE, *PKDEVICE_QUEUE;                                          
                                                                                    
          typedef struct _KDPC                                  // 9 elements, 0x20 bytes (sizeof) 
          {                                                                                        
/*0x000*/     UINT8        Type;                                                                   
/*0x001*/     UINT8        Importance;                                                             
/*0x002*/     UINT16       Number;                                                                 
/*0x004*/     struct _LIST_ENTRY DpcListEntry;                  // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     FUNCT_00A4_0530_DeferredRoutine* DeferredRoutine;                                    
/*0x010*/     VOID*        DeferredContext;                                                        
/*0x014*/     VOID*        SystemArgument1;                                                        
/*0x018*/     VOID*        SystemArgument2;                                                        
/*0x01C*/     VOID*        DpcData;                                                                
          }KDPC, *PKDPC;                                                                           
                                                                                                   
          typedef struct _DISPATCHER_HEADER                           // 30 elements, 0x10 bytes (sizeof) 
          {                                                                                               
              union                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                           
                  struct                                              // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                       
/*0x000*/             UINT8        Type;                                                                  
                      union                                           // 4 elements, 0x1 bytes (sizeof)   
                      {                                                                                   
/*0x001*/                 UINT8        TimerControlFlags;                                                 
                          struct                                      // 4 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x001*/                     UINT8        Absolute : 1;              // 0 BitPosition                    
/*0x001*/                     UINT8        Coalescable : 1;           // 1 BitPosition                    
/*0x001*/                     UINT8        KeepShifting : 1;          // 2 BitPosition                    
/*0x001*/                     UINT8        EncodedTolerableDelay : 5; // 3 BitPosition                    
                          };                                                                              
/*0x001*/                 UINT8        Abandoned;                                                         
/*0x001*/                 UINT8        Signalling;                                                        
                      };                                                                                  
                      union                                           // 4 elements, 0x1 bytes (sizeof)   
                      {                                                                                   
/*0x002*/                 UINT8        ThreadControlFlags;                                                
                          struct                                      // 4 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x002*/                     UINT8        CpuThrottled : 1;          // 0 BitPosition                    
/*0x002*/                     UINT8        CycleProfiling : 1;        // 1 BitPosition                    
/*0x002*/                     UINT8        CounterProfiling : 1;      // 2 BitPosition                    
/*0x002*/                     UINT8        Reserved : 5;              // 3 BitPosition                    
                          };                                                                              
/*0x002*/                 UINT8        Hand;                                                              
/*0x002*/                 UINT8        Size;                                                              
                      };                                                                                  
                      union                                           // 5 elements, 0x1 bytes (sizeof)   
                      {                                                                                   
/*0x003*/                 UINT8        TimerMiscFlags;                                                    
                          struct                                      // 4 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x003*/                     UINT8        Index : 1;                 // 0 BitPosition                    
/*0x003*/                     UINT8        Processor : 5;             // 1 BitPosition                    
/*0x003*/                     UINT8        Inserted : 1;              // 6 BitPosition                    
/*0x003*/                     UINT8        Expired : 1;               // 7 BitPosition                    
                          };                                                                              
/*0x003*/                 UINT8        DebugActive;                                                       
                          struct                                      // 5 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x003*/                     UINT8        ActiveDR7 : 1;             // 0 BitPosition                    
/*0x003*/                     UINT8        Instrumented : 1;          // 1 BitPosition                    
/*0x003*/                     UINT8        Reserved2 : 4;             // 2 BitPosition                    
/*0x003*/                     UINT8        UmsScheduled : 1;          // 6 BitPosition                    
/*0x003*/                     UINT8        UmsPrimary : 1;            // 7 BitPosition                    
                          };                                                                              
/*0x003*/                 UINT8        DpcActive;                                                         
                      };                                                                                  
                  };                                                                                      
/*0x000*/         LONG32       Lock;                                                                      
              };                                                                                          
/*0x004*/     LONG32       SignalState;                                                                   
/*0x008*/     struct _LIST_ENTRY WaitListHead;                        // 2 elements, 0x8 bytes (sizeof)   
          }DISPATCHER_HEADER, *PDISPATCHER_HEADER;                                                        
                                                                                                          
          typedef struct _KEVENT                // 1 elements, 0x10 bytes (sizeof)  
          {                                                                         
/*0x000*/     struct _DISPATCHER_HEADER Header; // 30 elements, 0x10 bytes (sizeof) 
          }KEVENT, *PKEVENT;                                                        
                                                                                    
          typedef struct _DEVICE_OBJECT                        // 25 elements, 0xB8 bytes (sizeof) 
          {                                                                                        
/*0x000*/     INT16        Type;                                                                   
/*0x002*/     UINT16       Size;                                                                   
/*0x004*/     LONG32       ReferenceCount;                                                         
/*0x008*/     struct _DRIVER_OBJECT* DriverObject;                                                 
/*0x00C*/     struct _DEVICE_OBJECT* NextDevice;                                                   
/*0x010*/     struct _DEVICE_OBJECT* AttachedDevice;                                               
/*0x014*/     struct _IRP* CurrentIrp;                                                             
/*0x018*/     struct _IO_TIMER* Timer;                                                             
/*0x01C*/     ULONG32      Flags;                                                                  
/*0x020*/     ULONG32      Characteristics;                                                        
/*0x024*/     struct _VPB* Vpb;                                                                    
/*0x028*/     VOID*        DeviceExtension;                                                        
/*0x02C*/     ULONG32      DeviceType;                                                             
/*0x030*/     CHAR         StackSize;                                                              
/*0x031*/     UINT8        _PADDING0_[0x3];                                                        
              union                                            // 2 elements, 0x28 bytes (sizeof)  
              {                                                                                    
/*0x034*/         struct _LIST_ENTRY ListEntry;                // 2 elements, 0x8 bytes (sizeof)   
/*0x034*/         struct _WAIT_CONTEXT_BLOCK Wcb;              // 7 elements, 0x28 bytes (sizeof)  
              }Queue;                                                                              
/*0x05C*/     ULONG32      AlignmentRequirement;                                                   
/*0x060*/     struct _KDEVICE_QUEUE DeviceQueue;               // 5 elements, 0x14 bytes (sizeof)  
/*0x074*/     struct _KDPC Dpc;                                // 9 elements, 0x20 bytes (sizeof)  
/*0x094*/     ULONG32      ActiveThreadCount;                                                      
/*0x098*/     VOID*        SecurityDescriptor;                                                     
/*0x09C*/     struct _KEVENT DeviceLock;                       // 1 elements, 0x10 bytes (sizeof)  
/*0x0AC*/     UINT16       SectorSize;                                                             
/*0x0AE*/     UINT16       Spare1;                                                                 
/*0x0B0*/     struct _DEVOBJ_EXTENSION* DeviceObjectExtension;                                     
/*0x0B4*/     VOID*        Reserved;                                                               
          }DEVICE_OBJECT, *PDEVICE_OBJECT;                                                         
                                                                                                   
typedef struct _DEVICE_OBJECT_POWER_EXTENSION // 0 elements, 0x0 bytes (sizeof) 
{                                                                               
}DEVICE_OBJECT_POWER_EXTENSION, *PDEVICE_OBJECT_POWER_EXTENSION;                                  
                                                                                
          typedef struct _DEVOBJ_EXTENSION                 // 14 elements, 0x3C bytes (sizeof) 
          {                                                                                    
/*0x000*/     INT16        Type;                                                               
/*0x002*/     UINT16       Size;                                                               
/*0x004*/     struct _DEVICE_OBJECT* DeviceObject;                                             
/*0x008*/     ULONG32      PowerFlags;                                                         
/*0x00C*/     struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;                                     
/*0x010*/     ULONG32      ExtensionFlags;                                                     
/*0x014*/     VOID*        DeviceNode;                                                         
/*0x018*/     struct _DEVICE_OBJECT* AttachedTo;                                               
/*0x01C*/     LONG32       StartIoCount;                                                       
/*0x020*/     LONG32       StartIoKey;                                                         
/*0x024*/     ULONG32      StartIoFlags;                                                       
/*0x028*/     struct _VPB* Vpb;                                                                
/*0x02C*/     struct _LIST_ENTRY DependentList;            // 2 elements, 0x8 bytes (sizeof)   
/*0x034*/     struct _LIST_ENTRY ProviderList;             // 2 elements, 0x8 bytes (sizeof)   
          }DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION;                                               
                                                                                               
          typedef struct _DPH_BLOCK_INFORMATION           // 9 elements, 0x20 bytes (sizeof) 
          {                                                                                  
/*0x000*/     ULONG32      StartStamp;                                                       
/*0x004*/     VOID*        Heap;                                                             
/*0x008*/     ULONG32      RequestedSize;                                                    
/*0x00C*/     ULONG32      ActualSize;                                                       
              union                                       // 3 elements, 0x8 bytes (sizeof)  
              {                                                                              
/*0x010*/         struct _LIST_ENTRY FreeQueue;           // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/         struct _SINGLE_LIST_ENTRY FreePushList; // 1 elements, 0x4 bytes (sizeof)  
/*0x010*/         UINT16       TraceIndex;                                                   
              };                                                                             
/*0x018*/     VOID*        StackTrace;                                                       
/*0x01C*/     ULONG32      EndStamp;                                                         
          }DPH_BLOCK_INFORMATION, *PDPH_BLOCK_INFORMATION;                                   
                                                                                             
          typedef struct _RTL_BALANCED_LINKS          // 5 elements, 0x10 bytes (sizeof) 
          {                                                                              
/*0x000*/     struct _RTL_BALANCED_LINKS* Parent;                                        
/*0x004*/     struct _RTL_BALANCED_LINKS* LeftChild;                                     
/*0x008*/     struct _RTL_BALANCED_LINKS* RightChild;                                    
/*0x00C*/     CHAR         Balance;                                                      
/*0x00D*/     UINT8        Reserved[3];                                                  
          }RTL_BALANCED_LINKS, *PRTL_BALANCED_LINKS;                                     
                                                                                         
          typedef struct _DPH_HEAP_BLOCK                 // 14 elements, 0x40 bytes (sizeof) 
          {                                                                                  
              union                                      // 3 elements, 0x10 bytes (sizeof)  
              {                                                                              
/*0x000*/         struct _DPH_HEAP_BLOCK* pNextAlloc;                                        
/*0x000*/         struct _LIST_ENTRY AvailableEntry;     // 2 elements, 0x8 bytes (sizeof)   
/*0x000*/         struct _RTL_BALANCED_LINKS TableLinks; // 5 elements, 0x10 bytes (sizeof)  
              };                                                                             
/*0x010*/     UINT8*       pUserAllocation;                                                  
/*0x014*/     UINT8*       pVirtualBlock;                                                    
/*0x018*/     ULONG32      nVirtualBlockSize;                                                
/*0x01C*/     ULONG32      nVirtualAccessSize;                                               
/*0x020*/     ULONG32      nUserRequestedSize;                                               
/*0x024*/     ULONG32      nUserActualSize;                                                  
/*0x028*/     VOID*        UserValue;                                                        
/*0x02C*/     ULONG32      UserFlags;                                                        
/*0x030*/     struct _RTL_TRACE_BLOCK* StackTrace;                                           
/*0x034*/     struct _LIST_ENTRY AdjacencyEntry;         // 2 elements, 0x8 bytes (sizeof)   
/*0x03C*/     UINT8*       pVirtualRegion;                                                   
          }DPH_HEAP_BLOCK, *PDPH_HEAP_BLOCK;                                                 
                                                                                             
          typedef struct _RTL_AVL_TABLE                         // 11 elements, 0x38 bytes (sizeof) 
          {                                                                                         
/*0x000*/     struct _RTL_BALANCED_LINKS BalancedRoot;          // 5 elements, 0x10 bytes (sizeof)  
/*0x010*/     VOID*        OrderedPointer;                                                          
/*0x014*/     ULONG32      WhichOrderedElement;                                                     
/*0x018*/     ULONG32      NumberGenericTableElements;                                              
/*0x01C*/     ULONG32      DepthOfTree;                                                             
/*0x020*/     struct _RTL_BALANCED_LINKS* RestartKey;                                               
/*0x024*/     ULONG32      DeleteCount;                                                             
/*0x028*/     FUNCT_1315_1314_CompareRoutine* CompareRoutine;                                       
/*0x02C*/     FUNCT_00A7_131E_AllocateRoutine* AllocateRoutine;                                     
/*0x030*/     FUNCT_00A4_1322_FreeRoutine* FreeRoutine;                                             
/*0x034*/     VOID*        TableContext;                                                            
          }RTL_AVL_TABLE, *PRTL_AVL_TABLE;                                                          
                                                                                                    
          typedef struct _DPH_HEAP_ROOT                        // 33 elements, 0xC0 bytes (sizeof) 
          {                                                                                        
/*0x000*/     ULONG32      Signature;                                                              
/*0x004*/     ULONG32      HeapFlags;                                                              
/*0x008*/     struct _RTL_CRITICAL_SECTION* HeapCritSect;                                          
/*0x00C*/     ULONG32      nRemoteLockAcquired;                                                    
/*0x010*/     struct _DPH_HEAP_BLOCK* pVirtualStorageListHead;                                     
/*0x014*/     struct _DPH_HEAP_BLOCK* pVirtualStorageListTail;                                     
/*0x018*/     ULONG32      nVirtualStorageRanges;                                                  
/*0x01C*/     ULONG32      nVirtualStorageBytes;                                                   
/*0x020*/     struct _RTL_AVL_TABLE BusyNodesTable;            // 11 elements, 0x38 bytes (sizeof) 
/*0x058*/     struct _DPH_HEAP_BLOCK* NodeToAllocate;                                              
/*0x05C*/     ULONG32      nBusyAllocations;                                                       
/*0x060*/     ULONG32      nBusyAllocationBytesCommitted;                                          
/*0x064*/     struct _DPH_HEAP_BLOCK* pFreeAllocationListHead;                                     
/*0x068*/     struct _DPH_HEAP_BLOCK* pFreeAllocationListTail;                                     
/*0x06C*/     ULONG32      nFreeAllocations;                                                       
/*0x070*/     ULONG32      nFreeAllocationBytesCommitted;                                          
/*0x074*/     struct _LIST_ENTRY AvailableAllocationHead;      // 2 elements, 0x8 bytes (sizeof)   
/*0x07C*/     ULONG32      nAvailableAllocations;                                                  
/*0x080*/     ULONG32      nAvailableAllocationBytesCommitted;                                     
/*0x084*/     struct _DPH_HEAP_BLOCK* pUnusedNodeListHead;                                         
/*0x088*/     struct _DPH_HEAP_BLOCK* pUnusedNodeListTail;                                         
/*0x08C*/     ULONG32      nUnusedNodes;                                                           
/*0x090*/     ULONG32      nBusyAllocationBytesAccessible;                                         
/*0x094*/     struct _DPH_HEAP_BLOCK* pNodePoolListHead;                                           
/*0x098*/     struct _DPH_HEAP_BLOCK* pNodePoolListTail;                                           
/*0x09C*/     ULONG32      nNodePools;                                                             
/*0x0A0*/     ULONG32      nNodePoolBytes;                                                         
/*0x0A4*/     struct _LIST_ENTRY NextHeap;                     // 2 elements, 0x8 bytes (sizeof)   
/*0x0AC*/     ULONG32      ExtraFlags;                                                             
/*0x0B0*/     ULONG32      Seed;                                                                   
/*0x0B4*/     VOID*        NormalHeap;                                                             
/*0x0B8*/     struct _RTL_TRACE_BLOCK* CreateStackTrace;                                           
/*0x0BC*/     VOID*        FirstThread;                                                            
          }DPH_HEAP_ROOT, *PDPH_HEAP_ROOT;                                                         
                                                                                                   
          typedef struct _DRIVER_EXTENSION                        // 6 elements, 0x1C bytes (sizeof) 
          {                                                                                          
/*0x000*/     struct _DRIVER_OBJECT* DriverObject;                                                   
/*0x004*/     FUNCT_000F_086F_AddDevice* AddDevice;                                                  
/*0x008*/     ULONG32      Count;                                                                    
/*0x00C*/     struct _UNICODE_STRING ServiceKeyName;              // 3 elements, 0x8 bytes (sizeof)  
/*0x014*/     struct _IO_CLIENT_EXTENSION* ClientDriverExtension;                                    
/*0x018*/     struct _FS_FILTER_CALLBACKS* FsFilterCallbacks;                                        
          }DRIVER_EXTENSION, *PDRIVER_EXTENSION;                                                     
                                                                                                     
          typedef struct _DRIVER_OBJECT                                   // 15 elements, 0xA8 bytes (sizeof) 
          {                                                                                                   
/*0x000*/     INT16        Type;                                                                              
/*0x002*/     INT16        Size;                                                                              
/*0x004*/     struct _DEVICE_OBJECT* DeviceObject;                                                            
/*0x008*/     ULONG32      Flags;                                                                             
/*0x00C*/     VOID*        DriverStart;                                                                       
/*0x010*/     ULONG32      DriverSize;                                                                        
/*0x014*/     VOID*        DriverSection;                                                                     
/*0x018*/     struct _DRIVER_EXTENSION* DriverExtension;                                                      
/*0x01C*/     struct _UNICODE_STRING DriverName;                          // 3 elements, 0x8 bytes (sizeof)   
/*0x024*/     struct _UNICODE_STRING* HardwareDatabase;                                                       
/*0x028*/     struct _FAST_IO_DISPATCH* FastIoDispatch;                                                       
/*0x02C*/     FUNCT_000F_0DEA_DriverInit* DriverInit;                                                         
/*0x030*/     FUNCT_00A4_0B5A_DriverStartIo_CancelRoutine* DriverStartIo;                                     
/*0x034*/     FUNCT_00A4_0DEE_DriverUnload* DriverUnload;                                                     
/*0x038*/     FUNCT_000F_0DF2_MajorFunction* MajorFunction[28];                                               
          }DRIVER_OBJECT, *PDRIVER_OBJECT;                                                                    
                                                                                                              
typedef struct _ECP_LIST // 0 elements, 0x0 bytes (sizeof) 
{                                                          
}ECP_LIST, *PECP_LIST;                                     
                                                           
          typedef struct _OWNER_ENTRY                     // 5 elements, 0x8 bytes (sizeof) 
          {                                                                                 
/*0x000*/     ULONG32      OwnerThread;                                                     
              union                                       // 2 elements, 0x4 bytes (sizeof) 
              {                                                                             
                  struct                                  // 3 elements, 0x4 bytes (sizeof) 
                  {                                                                         
/*0x004*/             ULONG32      IoPriorityBoosted : 1; // 0 BitPosition                  
/*0x004*/             ULONG32      OwnerReferenced : 1;   // 1 BitPosition                  
/*0x004*/             ULONG32      OwnerCount : 30;       // 2 BitPosition                  
                  };                                                                        
/*0x004*/         ULONG32      TableSize;                                                   
              };                                                                            
          }OWNER_ENTRY, *POWNER_ENTRY;                                                      
                                                                                            
          typedef struct _ERESOURCE                   // 14 elements, 0x38 bytes (sizeof) 
          {                                                                               
/*0x000*/     struct _LIST_ENTRY SystemResourcesList; // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     struct _OWNER_ENTRY* OwnerTable;                                            
/*0x00C*/     INT16        ActiveCount;                                                   
/*0x00E*/     UINT16       Flag;                                                          
/*0x010*/     struct _KSEMAPHORE* SharedWaiters;                                          
/*0x014*/     struct _KEVENT* ExclusiveWaiters;                                           
/*0x018*/     struct _OWNER_ENTRY OwnerEntry;         // 5 elements, 0x8 bytes (sizeof)   
/*0x020*/     ULONG32      ActiveEntries;                                                 
/*0x024*/     ULONG32      ContentionCount;                                               
/*0x028*/     ULONG32      NumberOfSharedWaiters;                                         
/*0x02C*/     ULONG32      NumberOfExclusiveWaiters;                                      
              union                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                           
/*0x030*/         VOID*        Address;                                                   
/*0x030*/         ULONG32      CreatorBackTraceIndex;                                     
              };                                                                          
/*0x034*/     ULONG32      SpinLock;                                                      
          }ERESOURCE, *PERESOURCE;                                                        
                                                                                          
          typedef struct _KAFFINITY_EX // 4 elements, 0xC bytes (sizeof) 
          {                                                              
/*0x000*/     UINT16       Count;                                        
/*0x002*/     UINT16       Size;                                         
/*0x004*/     ULONG32      Reserved;                                     
/*0x008*/     ULONG32      Bitmap[1];                                    
          }KAFFINITY_EX, *PKAFFINITY_EX;                                  
                                                                         
          typedef struct _EJOB                                // 42 elements, 0x138 bytes (sizeof) 
          {                                                                                        
/*0x000*/     struct _KEVENT Event;                           // 1 elements, 0x10 bytes (sizeof)   
/*0x010*/     struct _LIST_ENTRY JobLinks;                    // 2 elements, 0x8 bytes (sizeof)    
/*0x018*/     struct _LIST_ENTRY ProcessListHead;             // 2 elements, 0x8 bytes (sizeof)    
/*0x020*/     struct _ERESOURCE JobLock;                      // 14 elements, 0x38 bytes (sizeof)  
/*0x058*/     union _LARGE_INTEGER TotalUserTime;             // 4 elements, 0x8 bytes (sizeof)    
/*0x060*/     union _LARGE_INTEGER TotalKernelTime;           // 4 elements, 0x8 bytes (sizeof)    
/*0x068*/     union _LARGE_INTEGER ThisPeriodTotalUserTime;   // 4 elements, 0x8 bytes (sizeof)    
/*0x070*/     union _LARGE_INTEGER ThisPeriodTotalKernelTime; // 4 elements, 0x8 bytes (sizeof)    
/*0x078*/     ULONG32      TotalPageFaultCount;                                                    
/*0x07C*/     ULONG32      TotalProcesses;                                                         
/*0x080*/     ULONG32      ActiveProcesses;                                                        
/*0x084*/     ULONG32      TotalTerminatedProcesses;                                               
/*0x088*/     union _LARGE_INTEGER PerProcessUserTimeLimit;   // 4 elements, 0x8 bytes (sizeof)    
/*0x090*/     union _LARGE_INTEGER PerJobUserTimeLimit;       // 4 elements, 0x8 bytes (sizeof)    
/*0x098*/     ULONG32      MinimumWorkingSetSize;                                                  
/*0x09C*/     ULONG32      MaximumWorkingSetSize;                                                  
/*0x0A0*/     ULONG32      LimitFlags;                                                             
/*0x0A4*/     ULONG32      ActiveProcessLimit;                                                     
/*0x0A8*/     struct _KAFFINITY_EX Affinity;                  // 4 elements, 0xC bytes (sizeof)    
/*0x0B4*/     UINT8        PriorityClass;                                                          
/*0x0B5*/     UINT8        _PADDING0_[0x3];                                                        
/*0x0B8*/     struct _JOB_ACCESS_STATE* AccessState;                                               
/*0x0BC*/     ULONG32      UIRestrictionsClass;                                                    
/*0x0C0*/     ULONG32      EndOfJobTimeAction;                                                     
/*0x0C4*/     VOID*        CompletionPort;                                                         
/*0x0C8*/     VOID*        CompletionKey;                                                          
/*0x0CC*/     ULONG32      SessionId;                                                              
/*0x0D0*/     ULONG32      SchedulingClass;                                                        
/*0x0D4*/     UINT8        _PADDING1_[0x4];                                                        
/*0x0D8*/     UINT64       ReadOperationCount;                                                     
/*0x0E0*/     UINT64       WriteOperationCount;                                                    
/*0x0E8*/     UINT64       OtherOperationCount;                                                    
/*0x0F0*/     UINT64       ReadTransferCount;                                                      
/*0x0F8*/     UINT64       WriteTransferCount;                                                     
/*0x100*/     UINT64       OtherTransferCount;                                                     
/*0x108*/     ULONG32      ProcessMemoryLimit;                                                     
/*0x10C*/     ULONG32      JobMemoryLimit;                                                         
/*0x110*/     ULONG32      PeakProcessMemoryUsed;                                                  
/*0x114*/     ULONG32      PeakJobMemoryUsed;                                                      
/*0x118*/     UINT64       CurrentJobMemoryUsed;                                                   
/*0x120*/     struct _EX_PUSH_LOCK MemoryLimitsLock;          // 7 elements, 0x4 bytes (sizeof)    
/*0x124*/     struct _LIST_ENTRY JobSetLinks;                 // 2 elements, 0x8 bytes (sizeof)    
/*0x12C*/     ULONG32      MemberLevel;                                                            
/*0x130*/     ULONG32      JobFlags;                                                               
/*0x134*/     UINT8        _PADDING2_[0x4];                                                        
          }EJOB, *PEJOB;                                                                           
                                                                                                   
          typedef struct _KGDTENTRY                 // 3 elements, 0x8 bytes (sizeof)  
          {                                                                            
/*0x000*/     UINT16       LimitLow;                                                   
/*0x002*/     UINT16       BaseLow;                                                    
              union                                 // 2 elements, 0x4 bytes (sizeof)  
              {                                                                        
                  struct                            // 4 elements, 0x4 bytes (sizeof)  
                  {                                                                    
/*0x004*/             UINT8        BaseMid;                                            
/*0x005*/             UINT8        Flags1;                                             
/*0x006*/             UINT8        Flags2;                                             
/*0x007*/             UINT8        BaseHi;                                             
                  }Bytes;                                                              
                  struct                            // 10 elements, 0x4 bytes (sizeof) 
                  {                                                                    
/*0x004*/             ULONG32      BaseMid : 8;     // 0 BitPosition                   
/*0x004*/             ULONG32      Type : 5;        // 8 BitPosition                   
/*0x004*/             ULONG32      Dpl : 2;         // 13 BitPosition                  
/*0x004*/             ULONG32      Pres : 1;        // 15 BitPosition                  
/*0x004*/             ULONG32      LimitHi : 4;     // 16 BitPosition                  
/*0x004*/             ULONG32      Sys : 1;         // 20 BitPosition                  
/*0x004*/             ULONG32      Reserved_0 : 1;  // 21 BitPosition                  
/*0x004*/             ULONG32      Default_Big : 1; // 22 BitPosition                  
/*0x004*/             ULONG32      Granularity : 1; // 23 BitPosition                  
/*0x004*/             ULONG32      BaseHi : 8;      // 24 BitPosition                  
                  }Bits;                                                               
              }HighWord;                                                               
          }KGDTENTRY, *PKGDTENTRY;                                                     
                                                                                       
          typedef struct _KIDTENTRY        // 4 elements, 0x8 bytes (sizeof) 
          {                                                                  
/*0x000*/     UINT16       Offset;                                           
/*0x002*/     UINT16       Selector;                                         
/*0x004*/     UINT16       Access;                                           
/*0x006*/     UINT16       ExtendedOffset;                                   
          }KIDTENTRY, *PKIDTENTRY;                                           
                                                                             
          typedef union _KEXECUTE_OPTIONS                           // 9 elements, 0x1 bytes (sizeof) 
          {                                                                                           
              struct                                                // 8 elements, 0x1 bytes (sizeof) 
              {                                                                                       
/*0x000*/         UINT8        ExecuteDisable : 1;                  // 0 BitPosition                  
/*0x000*/         UINT8        ExecuteEnable : 1;                   // 1 BitPosition                  
/*0x000*/         UINT8        DisableThunkEmulation : 1;           // 2 BitPosition                  
/*0x000*/         UINT8        Permanent : 1;                       // 3 BitPosition                  
/*0x000*/         UINT8        ExecuteDispatchEnable : 1;           // 4 BitPosition                  
/*0x000*/         UINT8        ImageDispatchEnable : 1;             // 5 BitPosition                  
/*0x000*/         UINT8        DisableExceptionChainValidation : 1; // 6 BitPosition                  
/*0x000*/         UINT8        Spare : 1;                           // 7 BitPosition                  
              };                                                                                      
/*0x000*/     UINT8        ExecuteOptions;                                                            
          }KEXECUTE_OPTIONS, *PKEXECUTE_OPTIONS;                                                      
                                                                                                      
          typedef union _KSTACK_COUNT           // 3 elements, 0x4 bytes (sizeof) 
          {                                                                       
/*0x000*/     LONG32       Value;                                                 
              struct                            // 2 elements, 0x4 bytes (sizeof) 
              {                                                                   
/*0x000*/         ULONG32      State : 3;       // 0 BitPosition                  
/*0x000*/         ULONG32      StackCount : 29; // 3 BitPosition                  
              };                                                                  
          }KSTACK_COUNT, *PKSTACK_COUNT;                                          
                                                                                  
          typedef struct _KPROCESS                       // 34 elements, 0x98 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _DISPATCHER_HEADER Header;          // 30 elements, 0x10 bytes (sizeof) 
/*0x010*/     struct _LIST_ENTRY ProfileListHead;        // 2 elements, 0x8 bytes (sizeof)   
/*0x018*/     ULONG32      DirectoryTableBase;                                               
/*0x01C*/     struct _KGDTENTRY LdtDescriptor;           // 3 elements, 0x8 bytes (sizeof)   
/*0x024*/     struct _KIDTENTRY Int21Descriptor;         // 4 elements, 0x8 bytes (sizeof)   
/*0x02C*/     struct _LIST_ENTRY ThreadListHead;         // 2 elements, 0x8 bytes (sizeof)   
/*0x034*/     ULONG32      ProcessLock;                                                      
/*0x038*/     struct _KAFFINITY_EX Affinity;             // 4 elements, 0xC bytes (sizeof)   
/*0x044*/     struct _LIST_ENTRY ReadyListHead;          // 2 elements, 0x8 bytes (sizeof)   
/*0x04C*/     struct _SINGLE_LIST_ENTRY SwapListEntry;   // 1 elements, 0x4 bytes (sizeof)   
/*0x050*/     struct _KAFFINITY_EX ActiveProcessors;     // 4 elements, 0xC bytes (sizeof)   
              union                                      // 2 elements, 0x4 bytes (sizeof)   
              {                                                                              
                  struct                                 // 5 elements, 0x4 bytes (sizeof)   
                  {                                                                          
/*0x05C*/             LONG32       AutoAlignment : 1;    // 0 BitPosition                    
/*0x05C*/             LONG32       DisableBoost : 1;     // 1 BitPosition                    
/*0x05C*/             LONG32       DisableQuantum : 1;   // 2 BitPosition                    
/*0x05C*/             ULONG32      ActiveGroupsMask : 1; // 3 BitPosition                    
/*0x05C*/             LONG32       ReservedFlags : 28;   // 4 BitPosition                    
                  };                                                                         
/*0x05C*/         LONG32       ProcessFlags;                                                 
              };                                                                             
/*0x060*/     CHAR         BasePriority;                                                     
/*0x061*/     CHAR         QuantumReset;                                                     
/*0x062*/     UINT8        Visited;                                                          
/*0x063*/     UINT8        Unused3;                                                          
/*0x064*/     ULONG32      ThreadSeed[1];                                                    
/*0x068*/     UINT16       IdealNode[1];                                                     
/*0x06A*/     UINT16       IdealGlobalNode;                                                  
/*0x06C*/     union _KEXECUTE_OPTIONS Flags;             // 9 elements, 0x1 bytes (sizeof)   
/*0x06D*/     UINT8        Unused1;                                                          
/*0x06E*/     UINT16       IopmOffset;                                                       
/*0x070*/     ULONG32      Unused4;                                                          
/*0x074*/     union _KSTACK_COUNT StackCount;            // 3 elements, 0x4 bytes (sizeof)   
/*0x078*/     struct _LIST_ENTRY ProcessListEntry;       // 2 elements, 0x8 bytes (sizeof)   
/*0x080*/     UINT64       CycleTime;                                                        
/*0x088*/     ULONG32      KernelTime;                                                       
/*0x08C*/     ULONG32      UserTime;                                                         
/*0x090*/     VOID*        VdmTrapcHandler;                                                  
/*0x094*/     UINT8        _PADDING0_[0x4];                                                  
          }KPROCESS, *PKPROCESS;                                                             
                                                                                             
          typedef struct _EX_RUNDOWN_REF // 2 elements, 0x4 bytes (sizeof) 
          {                                                                
              union                      // 2 elements, 0x4 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      Count;                                      
/*0x000*/         VOID*        Ptr;                                        
              };                                                           
          }EX_RUNDOWN_REF, *PEX_RUNDOWN_REF;                                  
                                                                           
          typedef struct _EX_FAST_REF      // 3 elements, 0x4 bytes (sizeof) 
          {                                                                  
              union                        // 3 elements, 0x4 bytes (sizeof) 
              {                                                              
/*0x000*/         VOID*        Object;                                       
/*0x000*/         ULONG32      RefCnt : 3; // 0 BitPosition                  
/*0x000*/         ULONG32      Value;                                        
              };                                                             
          }EX_FAST_REF, *PEX_FAST_REF;                                       
                                                                             
          typedef struct _HARDWARE_PTE_X86       // 13 elements, 0x4 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      Valid : 1;            // 0 BitPosition                   
/*0x000*/     ULONG32      Write : 1;            // 1 BitPosition                   
/*0x000*/     ULONG32      Owner : 1;            // 2 BitPosition                   
/*0x000*/     ULONG32      WriteThrough : 1;     // 3 BitPosition                   
/*0x000*/     ULONG32      CacheDisable : 1;     // 4 BitPosition                   
/*0x000*/     ULONG32      Accessed : 1;         // 5 BitPosition                   
/*0x000*/     ULONG32      Dirty : 1;            // 6 BitPosition                   
/*0x000*/     ULONG32      LargePage : 1;        // 7 BitPosition                   
/*0x000*/     ULONG32      Global : 1;           // 8 BitPosition                   
/*0x000*/     ULONG32      CopyOnWrite : 1;      // 9 BitPosition                   
/*0x000*/     ULONG32      Prototype : 1;        // 10 BitPosition                  
/*0x000*/     ULONG32      reserved : 1;         // 11 BitPosition                  
/*0x000*/     ULONG32      PageFrameNumber : 20; // 12 BitPosition                  
          }HARDWARE_PTE_X86, *PHARDWARE_PTE_X86;                                    
                                                                                    
          typedef struct _SE_AUDIT_PROCESS_CREATION_INFO      // 1 elements, 0x4 bytes (sizeof) 
          {                                                                                     
/*0x000*/     struct _OBJECT_NAME_INFORMATION* ImageFileName;                                   
          }SE_AUDIT_PROCESS_CREATION_INFO, *PSE_AUDIT_PROCESS_CREATION_INFO;                                  
                                                                                                
          typedef struct _MMSUPPORT_FLAGS                 // 15 elements, 0x4 bytes (sizeof) 
          {                                                                                  
              struct                                      // 6 elements, 0x1 bytes (sizeof)  
              {                                                                              
/*0x000*/         UINT8        WorkingSetType : 3;        // 0 BitPosition                   
/*0x000*/         UINT8        ModwriterAttached : 1;     // 3 BitPosition                   
/*0x000*/         UINT8        TrimHard : 1;              // 4 BitPosition                   
/*0x000*/         UINT8        MaximumWorkingSetHard : 1; // 5 BitPosition                   
/*0x000*/         UINT8        ForceTrim : 1;             // 6 BitPosition                   
/*0x000*/         UINT8        MinimumWorkingSetHard : 1; // 7 BitPosition                   
              };                                                                             
              struct                                      // 4 elements, 0x1 bytes (sizeof)  
              {                                                                              
/*0x001*/         UINT8        SessionMaster : 1;         // 0 BitPosition                   
/*0x001*/         UINT8        TrimmerState : 2;          // 1 BitPosition                   
/*0x001*/         UINT8        Reserved : 1;              // 3 BitPosition                   
/*0x001*/         UINT8        PageStealers : 4;          // 4 BitPosition                   
              };                                                                             
/*0x002*/     UINT8        MemoryPriority : 8;            // 0 BitPosition                   
              struct                                      // 4 elements, 0x1 bytes (sizeof)  
              {                                                                              
/*0x003*/         UINT8        WsleDeleted : 1;           // 0 BitPosition                   
/*0x003*/         UINT8        VmExiting : 1;             // 1 BitPosition                   
/*0x003*/         UINT8        ExpansionFailed : 1;       // 2 BitPosition                   
/*0x003*/         UINT8        Available : 5;             // 3 BitPosition                   
              };                                                                             
          }MMSUPPORT_FLAGS, *PMMSUPPORT_FLAGS;                                               
                                                                                             
          typedef struct _MMSUPPORT                        // 21 elements, 0x6C bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _EX_PUSH_LOCK WorkingSetMutex;        // 7 elements, 0x4 bytes (sizeof)   
/*0x004*/     struct _KGATE* ExitGate;                                                         
/*0x008*/     VOID*        AccessLog;                                                          
/*0x00C*/     struct _LIST_ENTRY WorkingSetExpansionLinks; // 2 elements, 0x8 bytes (sizeof)   
/*0x014*/     ULONG32      AgeDistribution[7];                                                 
/*0x030*/     ULONG32      MinimumWorkingSetSize;                                              
/*0x034*/     ULONG32      WorkingSetSize;                                                     
/*0x038*/     ULONG32      WorkingSetPrivateSize;                                              
/*0x03C*/     ULONG32      MaximumWorkingSetSize;                                              
/*0x040*/     ULONG32      ChargedWslePages;                                                   
/*0x044*/     ULONG32      ActualWslePages;                                                    
/*0x048*/     ULONG32      WorkingSetSizeOverhead;                                             
/*0x04C*/     ULONG32      PeakWorkingSetSize;                                                 
/*0x050*/     ULONG32      HardFaultCount;                                                     
/*0x054*/     struct _MMWSL* VmWorkingSetList;                                                 
/*0x058*/     UINT16       NextPageColor;                                                      
/*0x05A*/     UINT16       LastTrimStamp;                                                      
/*0x05C*/     ULONG32      PageFaultCount;                                                     
/*0x060*/     ULONG32      RepurposeCount;                                                     
/*0x064*/     ULONG32      Spare[1];                                                           
/*0x068*/     struct _MMSUPPORT_FLAGS Flags;               // 15 elements, 0x4 bytes (sizeof)  
          }MMSUPPORT, *PMMSUPPORT;                                                             
                                                                                               
          typedef struct _MMADDRESS_NODE          // 5 elements, 0x14 bytes (sizeof) 
          {                                                                          
              union                               // 2 elements, 0x4 bytes (sizeof)  
              {                                                                      
/*0x000*/         LONG32       Balance : 2;       // 0 BitPosition                   
/*0x000*/         struct _MMADDRESS_NODE* Parent;                                    
              }u1;                                                                   
/*0x004*/     struct _MMADDRESS_NODE* LeftChild;                                     
/*0x008*/     struct _MMADDRESS_NODE* RightChild;                                    
/*0x00C*/     ULONG32      StartingVpn;                                              
/*0x010*/     ULONG32      EndingVpn;                                                
          }MMADDRESS_NODE, *PMMADDRESS_NODE;                                         
                                                                                     
          typedef struct _MM_AVL_TABLE                          // 6 elements, 0x20 bytes (sizeof) 
          {                                                                                        
/*0x000*/     struct _MMADDRESS_NODE BalancedRoot;              // 5 elements, 0x14 bytes (sizeof) 
              struct                                            // 3 elements, 0x4 bytes (sizeof)  
              {                                                                                    
/*0x014*/         ULONG32      DepthOfTree : 5;                 // 0 BitPosition                   
/*0x014*/         ULONG32      Unused : 3;                      // 5 BitPosition                   
/*0x014*/         ULONG32      NumberGenericTableElements : 24; // 8 BitPosition                   
              };                                                                                   
/*0x018*/     VOID*        NodeHint;                                                               
/*0x01C*/     VOID*        NodeFreeHint;                                                           
          }MM_AVL_TABLE, *PMM_AVL_TABLE;                                                           
                                                                                                   
          typedef struct _EPROCESS                                               // 134 elements, 0x2C0 bytes (sizeof) 
          {                                                                                                            
/*0x000*/     struct _KPROCESS Pcb;                                              // 34 elements, 0x98 bytes (sizeof)   
/*0x098*/     struct _EX_PUSH_LOCK ProcessLock;                                  // 7 elements, 0x4 bytes (sizeof)     
/*0x09C*/     UINT8        _PADDING0_[0x4];                                                                            
/*0x0A0*/     union _LARGE_INTEGER CreateTime;                                   // 4 elements, 0x8 bytes (sizeof)     
/*0x0A8*/     union _LARGE_INTEGER ExitTime;                                     // 4 elements, 0x8 bytes (sizeof)     
/*0x0B0*/     struct _EX_RUNDOWN_REF RundownProtect;                             // 2 elements, 0x4 bytes (sizeof)     
/*0x0B4*/     VOID*        UniqueProcessId;                                                                            
/*0x0B8*/     struct _LIST_ENTRY ActiveProcessLinks;                             // 2 elements, 0x8 bytes (sizeof)     
/*0x0C0*/     ULONG32      ProcessQuotaUsage[2];                                                                       
/*0x0C8*/     ULONG32      ProcessQuotaPeak[2];                                                                        
/*0x0D0*/     ULONG32      CommitCharge;                                                                               
/*0x0D4*/     struct _EPROCESS_QUOTA_BLOCK* QuotaBlock;                                                                
/*0x0D8*/     struct _PS_CPU_QUOTA_BLOCK* CpuQuotaBlock;                                                               
/*0x0DC*/     ULONG32      PeakVirtualSize;                                                                            
/*0x0E0*/     ULONG32      VirtualSize;                                                                                
/*0x0E4*/     struct _LIST_ENTRY SessionProcessLinks;                            // 2 elements, 0x8 bytes (sizeof)     
/*0x0EC*/     VOID*        DebugPort;                                                                                  
              union                                                              // 3 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x0F0*/         VOID*        ExceptionPortData;                                                                      
/*0x0F0*/         ULONG32      ExceptionPortValue;                                                                     
/*0x0F0*/         ULONG32      ExceptionPortState : 3;                           // 0 BitPosition                      
              };                                                                                                       
/*0x0F4*/     struct _HANDLE_TABLE* ObjectTable;                                                                       
/*0x0F8*/     struct _EX_FAST_REF Token;                                         // 3 elements, 0x4 bytes (sizeof)     
/*0x0FC*/     ULONG32      WorkingSetPage;                                                                             
/*0x100*/     struct _EX_PUSH_LOCK AddressCreationLock;                          // 7 elements, 0x4 bytes (sizeof)     
/*0x104*/     struct _ETHREAD* RotateInProgress;                                                                       
/*0x108*/     struct _ETHREAD* ForkInProgress;                                                                         
/*0x10C*/     ULONG32      HardwareTrigger;                                                                            
/*0x110*/     struct _MM_AVL_TABLE* PhysicalVadRoot;                                                                   
/*0x114*/     VOID*        CloneRoot;                                                                                  
/*0x118*/     ULONG32      NumberOfPrivatePages;                                                                       
/*0x11C*/     ULONG32      NumberOfLockedPages;                                                                        
/*0x120*/     VOID*        Win32Process;                                                                               
/*0x124*/     struct _EJOB* Job;                                                                                       
/*0x128*/     VOID*        SectionObject;                                                                              
/*0x12C*/     VOID*        SectionBaseAddress;                                                                         
/*0x130*/     ULONG32      Cookie;                                                                                     
/*0x134*/     ULONG32      Spare8;                                                                                     
/*0x138*/     struct _PAGEFAULT_HISTORY* WorkingSetWatch;                                                              
/*0x13C*/     VOID*        Win32WindowStation;                                                                         
/*0x140*/     VOID*        InheritedFromUniqueProcessId;                                                               
/*0x144*/     VOID*        LdtInformation;                                                                             
/*0x148*/     VOID*        VdmObjects;                                                                                 
/*0x14C*/     ULONG32      ConsoleHostProcess;                                                                         
/*0x150*/     VOID*        DeviceMap;                                                                                  
/*0x154*/     VOID*        EtwDataSource;                                                                              
/*0x158*/     VOID*        FreeTebHint;                                                                                
/*0x15C*/     UINT8        _PADDING1_[0x4];                                                                            
              union                                                              // 2 elements, 0x8 bytes (sizeof)     
              {                                                                                                        
/*0x160*/         struct _HARDWARE_PTE_X86 PageDirectoryPte;                     // 13 elements, 0x4 bytes (sizeof)    
/*0x160*/         UINT64       Filler;                                                                                 
              };                                                                                                       
/*0x168*/     VOID*        Session;                                                                                    
/*0x16C*/     UINT8        ImageFileName[15];                                                                          
/*0x17B*/     UINT8        PriorityClass;                                                                              
/*0x17C*/     struct _LIST_ENTRY JobLinks;                                       // 2 elements, 0x8 bytes (sizeof)     
/*0x184*/     VOID*        LockedPagesList;                                                                            
/*0x188*/     struct _LIST_ENTRY ThreadListHead;                                 // 2 elements, 0x8 bytes (sizeof)     
/*0x190*/     VOID*        SecurityPort;                                                                               
/*0x194*/     VOID*        PaeTop;                                                                                     
/*0x198*/     ULONG32      ActiveThreads;                                                                              
/*0x19C*/     ULONG32      ImagePathHash;                                                                              
/*0x1A0*/     ULONG32      DefaultHardErrorProcessing;                                                                 
/*0x1A4*/     LONG32       LastThreadExitStatus;                                                                       
/*0x1A8*/     struct _PEB* Peb;                                                                                        
/*0x1AC*/     struct _EX_FAST_REF PrefetchTrace;                                 // 3 elements, 0x4 bytes (sizeof)     
/*0x1B0*/     union _LARGE_INTEGER ReadOperationCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x1B8*/     union _LARGE_INTEGER WriteOperationCount;                          // 4 elements, 0x8 bytes (sizeof)     
/*0x1C0*/     union _LARGE_INTEGER OtherOperationCount;                          // 4 elements, 0x8 bytes (sizeof)     
/*0x1C8*/     union _LARGE_INTEGER ReadTransferCount;                            // 4 elements, 0x8 bytes (sizeof)     
/*0x1D0*/     union _LARGE_INTEGER WriteTransferCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x1D8*/     union _LARGE_INTEGER OtherTransferCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x1E0*/     ULONG32      CommitChargeLimit;                                                                          
/*0x1E4*/     ULONG32      CommitChargePeak;                                                                           
/*0x1E8*/     VOID*        AweInfo;                                                                                    
/*0x1EC*/     struct _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo; // 1 elements, 0x4 bytes (sizeof)     
/*0x1F0*/     struct _MMSUPPORT Vm;                                              // 21 elements, 0x6C bytes (sizeof)   
/*0x25C*/     struct _LIST_ENTRY MmProcessLinks;                                 // 2 elements, 0x8 bytes (sizeof)     
/*0x264*/     VOID*        HighestUserAddress;                                                                         
/*0x268*/     ULONG32      ModifiedPageCount;                                                                          
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x26C*/         ULONG32      Flags2;                                                                                 
                  struct                                                         // 20 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x26C*/             ULONG32      JobNotReallyActive : 1;                       // 0 BitPosition                      
/*0x26C*/             ULONG32      AccountingFolded : 1;                         // 1 BitPosition                      
/*0x26C*/             ULONG32      NewProcessReported : 1;                       // 2 BitPosition                      
/*0x26C*/             ULONG32      ExitProcessReported : 1;                      // 3 BitPosition                      
/*0x26C*/             ULONG32      ReportCommitChanges : 1;                      // 4 BitPosition                      
/*0x26C*/             ULONG32      LastReportMemory : 1;                         // 5 BitPosition                      
/*0x26C*/             ULONG32      ReportPhysicalPageChanges : 1;                // 6 BitPosition                      
/*0x26C*/             ULONG32      HandleTableRundown : 1;                       // 7 BitPosition                      
/*0x26C*/             ULONG32      NeedsHandleRundown : 1;                       // 8 BitPosition                      
/*0x26C*/             ULONG32      RefTraceEnabled : 1;                          // 9 BitPosition                      
/*0x26C*/             ULONG32      NumaAware : 1;                                // 10 BitPosition                     
/*0x26C*/             ULONG32      ProtectedProcess : 1;                         // 11 BitPosition                     
/*0x26C*/             ULONG32      DefaultPagePriority : 3;                      // 12 BitPosition                     
/*0x26C*/             ULONG32      PrimaryTokenFrozen : 1;                       // 15 BitPosition                     
/*0x26C*/             ULONG32      ProcessVerifierTarget : 1;                    // 16 BitPosition                     
/*0x26C*/             ULONG32      StackRandomizationDisabled : 1;               // 17 BitPosition                     
/*0x26C*/             ULONG32      AffinityPermanent : 1;                        // 18 BitPosition                     
/*0x26C*/             ULONG32      AffinityUpdateEnable : 1;                     // 19 BitPosition                     
/*0x26C*/             ULONG32      PropagateNode : 1;                            // 20 BitPosition                     
/*0x26C*/             ULONG32      ExplicitAffinity : 1;                         // 21 BitPosition                     
                  };                                                                                                   
              };                                                                                                       
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x270*/         ULONG32      Flags;                                                                                  
                  struct                                                         // 29 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x270*/             ULONG32      CreateReported : 1;                           // 0 BitPosition                      
/*0x270*/             ULONG32      NoDebugInherit : 1;                           // 1 BitPosition                      
/*0x270*/             ULONG32      ProcessExiting : 1;                           // 2 BitPosition                      
/*0x270*/             ULONG32      ProcessDelete : 1;                            // 3 BitPosition                      
/*0x270*/             ULONG32      Wow64SplitPages : 1;                          // 4 BitPosition                      
/*0x270*/             ULONG32      VmDeleted : 1;                                // 5 BitPosition                      
/*0x270*/             ULONG32      OutswapEnabled : 1;                           // 6 BitPosition                      
/*0x270*/             ULONG32      Outswapped : 1;                               // 7 BitPosition                      
/*0x270*/             ULONG32      ForkFailed : 1;                               // 8 BitPosition                      
/*0x270*/             ULONG32      Wow64VaSpace4Gb : 1;                          // 9 BitPosition                      
/*0x270*/             ULONG32      AddressSpaceInitialized : 2;                  // 10 BitPosition                     
/*0x270*/             ULONG32      SetTimerResolution : 1;                       // 12 BitPosition                     
/*0x270*/             ULONG32      BreakOnTermination : 1;                       // 13 BitPosition                     
/*0x270*/             ULONG32      DeprioritizeViews : 1;                        // 14 BitPosition                     
/*0x270*/             ULONG32      WriteWatch : 1;                               // 15 BitPosition                     
/*0x270*/             ULONG32      ProcessInSession : 1;                         // 16 BitPosition                     
/*0x270*/             ULONG32      OverrideAddressSpace : 1;                     // 17 BitPosition                     
/*0x270*/             ULONG32      HasAddressSpace : 1;                          // 18 BitPosition                     
/*0x270*/             ULONG32      LaunchPrefetched : 1;                         // 19 BitPosition                     
/*0x270*/             ULONG32      InjectInpageErrors : 1;                       // 20 BitPosition                     
/*0x270*/             ULONG32      VmTopDown : 1;                                // 21 BitPosition                     
/*0x270*/             ULONG32      ImageNotifyDone : 1;                          // 22 BitPosition                     
/*0x270*/             ULONG32      PdeUpdateNeeded : 1;                          // 23 BitPosition                     
/*0x270*/             ULONG32      VdmAllowed : 1;                               // 24 BitPosition                     
/*0x270*/             ULONG32      CrossSessionCreate : 1;                       // 25 BitPosition                     
/*0x270*/             ULONG32      ProcessInserted : 1;                          // 26 BitPosition                     
/*0x270*/             ULONG32      DefaultIoPriority : 3;                        // 27 BitPosition                     
/*0x270*/             ULONG32      ProcessSelfDelete : 1;                        // 30 BitPosition                     
/*0x270*/             ULONG32      SetTimerResolutionLink : 1;                   // 31 BitPosition                     
                  };                                                                                                   
              };                                                                                                       
/*0x274*/     LONG32       ExitStatus;                                                                                 
/*0x278*/     struct _MM_AVL_TABLE VadRoot;                                      // 6 elements, 0x20 bytes (sizeof)    
/*0x298*/     struct _ALPC_PROCESS_CONTEXT AlpcContext;                          // 3 elements, 0x10 bytes (sizeof)    
/*0x2A8*/     struct _LIST_ENTRY TimerResolutionLink;                            // 2 elements, 0x8 bytes (sizeof)     
/*0x2B0*/     ULONG32      RequestedTimerResolution;                                                                   
/*0x2B4*/     ULONG32      ActiveThreadsHighWatermark;                                                                 
/*0x2B8*/     ULONG32      SmallestTimerResolution;                                                                    
/*0x2BC*/     struct _PO_DIAG_STACK_RECORD* TimerResolutionStackRecord;                                                
          }EPROCESS, *PEPROCESS;                                                                                       
                                                                                                                       
typedef struct _EPROCESS_QUOTA_BLOCK // 0 elements, 0x0 bytes (sizeof) 
{                                                                      
}EPROCESS_QUOTA_BLOCK, *PEPROCESS_QUOTA_BLOCK;                                  
                                                                       
          typedef union _KWAIT_STATUS_REGISTER // 8 elements, 0x1 bytes (sizeof) 
          {                                                                      
/*0x000*/     UINT8        Flags;                                                
              struct                           // 7 elements, 0x1 bytes (sizeof) 
              {                                                                  
/*0x000*/         UINT8        State : 2;      // 0 BitPosition                  
/*0x000*/         UINT8        Affinity : 1;   // 2 BitPosition                  
/*0x000*/         UINT8        Priority : 1;   // 3 BitPosition                  
/*0x000*/         UINT8        Apc : 1;        // 4 BitPosition                  
/*0x000*/         UINT8        UserApc : 1;    // 5 BitPosition                  
/*0x000*/         UINT8        Alert : 1;      // 6 BitPosition                  
/*0x000*/         UINT8        Unused : 1;     // 7 BitPosition                  
              };                                                                 
          }KWAIT_STATUS_REGISTER, *PKWAIT_STATUS_REGISTER;                                  
                                                                                 
          typedef struct _KAPC_STATE             // 5 elements, 0x18 bytes (sizeof) 
          {                                                                         
/*0x000*/     struct _LIST_ENTRY ApcListHead[2];                                    
/*0x010*/     struct _KPROCESS* Process;                                            
/*0x014*/     UINT8        KernelApcInProgress;                                     
/*0x015*/     UINT8        KernelApcPending;                                        
/*0x016*/     UINT8        UserApcPending;                                          
/*0x017*/     UINT8        _PADDING0_[0x1];                                         
          }KAPC_STATE, *PKAPC_STATE;                                                
                                                                                    
          typedef union _ULARGE_INTEGER  // 4 elements, 0x8 bytes (sizeof) 
          {                                                                
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         ULONG32      HighPart;                                   
              };                                                           
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         ULONG32      HighPart;                                   
              }u;                                                          
/*0x000*/     UINT64       QuadPart;                                       
          }ULARGE_INTEGER, *PULARGE_INTEGER;                                  
                                                                           
          typedef struct _KTIMER                 // 5 elements, 0x28 bytes (sizeof)  
          {                                                                          
/*0x000*/     struct _DISPATCHER_HEADER Header;  // 30 elements, 0x10 bytes (sizeof) 
/*0x010*/     union _ULARGE_INTEGER DueTime;     // 4 elements, 0x8 bytes (sizeof)   
/*0x018*/     struct _LIST_ENTRY TimerListEntry; // 2 elements, 0x8 bytes (sizeof)   
/*0x020*/     struct _KDPC* Dpc;                                                     
/*0x024*/     ULONG32      Period;                                                   
          }KTIMER, *PKTIMER;                                                         
                                                                                     
          typedef struct _KWAIT_BLOCK             // 7 elements, 0x18 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _LIST_ENTRY WaitListEntry;   // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _KTHREAD* Thread;                                               
/*0x00C*/     VOID*        Object;                                                   
/*0x010*/     struct _KWAIT_BLOCK* NextWaitBlock;                                    
/*0x014*/     UINT16       WaitKey;                                                  
/*0x016*/     UINT8        WaitType;                                                 
/*0x017*/     UINT8        BlockState;                                               
          }KWAIT_BLOCK, *PKWAIT_BLOCK;                                               
                                                                                     
          typedef struct _GROUP_AFFINITY // 3 elements, 0xC bytes (sizeof) 
          {                                                                
/*0x000*/     ULONG32      Mask;                                           
/*0x004*/     UINT16       Group;                                          
/*0x006*/     UINT16       Reserved[3];                                    
          }GROUP_AFFINITY, *PGROUP_AFFINITY;                                  
                                                                           
          typedef struct _KAPC                                // 16 elements, 0x30 bytes (sizeof) 
          {                                                                                       
/*0x000*/     UINT8        Type;                                                                  
/*0x001*/     UINT8        SpareByte0;                                                            
/*0x002*/     UINT8        Size;                                                                  
/*0x003*/     UINT8        SpareByte1;                                                            
/*0x004*/     ULONG32      SpareLong0;                                                            
/*0x008*/     struct _KTHREAD* Thread;                                                            
/*0x00C*/     struct _LIST_ENTRY ApcListEntry;                // 2 elements, 0x8 bytes (sizeof)   
/*0x014*/     FUNCT_00A4_0576_KernelRoutine* KernelRoutine;                                       
/*0x018*/     FUNCT_00A4_0584_RundownRoutine* RundownRoutine;                                     
/*0x01C*/     FUNCT_00A4_057F_NormalRoutine* NormalRoutine;                                       
/*0x020*/     VOID*        NormalContext;                                                         
/*0x024*/     VOID*        SystemArgument1;                                                       
/*0x028*/     VOID*        SystemArgument2;                                                       
/*0x02C*/     CHAR         ApcStateIndex;                                                         
/*0x02D*/     CHAR         ApcMode;                                                               
/*0x02E*/     UINT8        Inserted;                                                              
/*0x02F*/     UINT8        _PADDING0_[0x1];                                                       
          }KAPC, *PKAPC;                                                                          
                                                                                                  
          typedef struct _KSEMAPHORE            // 2 elements, 0x14 bytes (sizeof)  
          {                                                                         
/*0x000*/     struct _DISPATCHER_HEADER Header; // 30 elements, 0x10 bytes (sizeof) 
/*0x010*/     LONG32       Limit;                                                   
          }KSEMAPHORE, *PKSEMAPHORE;                                                
                                                                                    
          typedef struct _KTHREAD                                 // 117 elements, 0x200 bytes (sizeof) 
          {                                                                                             
/*0x000*/     struct _DISPATCHER_HEADER Header;                   // 30 elements, 0x10 bytes (sizeof)   
/*0x010*/     UINT64       CycleTime;                                                                   
/*0x018*/     ULONG32      HighCycleTime;                                                               
/*0x01C*/     UINT8        _PADDING0_[0x4];                                                             
/*0x020*/     UINT64       QuantumTarget;                                                               
/*0x028*/     VOID*        InitialStack;                                                                
/*0x02C*/     VOID*        StackLimit;                                                                  
/*0x030*/     VOID*        KernelStack;                                                                 
/*0x034*/     ULONG32      ThreadLock;                                                                  
/*0x038*/     union _KWAIT_STATUS_REGISTER WaitRegister;          // 8 elements, 0x1 bytes (sizeof)     
/*0x039*/     UINT8        Running;                                                                     
/*0x03A*/     UINT8        Alerted[2];                                                                  
              union                                               // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                         
                  struct                                          // 15 elements, 0x4 bytes (sizeof)    
                  {                                                                                     
/*0x03C*/             ULONG32      KernelStackResident : 1;       // 0 BitPosition                      
/*0x03C*/             ULONG32      ReadyTransition : 1;           // 1 BitPosition                      
/*0x03C*/             ULONG32      ProcessReadyQueue : 1;         // 2 BitPosition                      
/*0x03C*/             ULONG32      WaitNext : 1;                  // 3 BitPosition                      
/*0x03C*/             ULONG32      SystemAffinityActive : 1;      // 4 BitPosition                      
/*0x03C*/             ULONG32      Alertable : 1;                 // 5 BitPosition                      
/*0x03C*/             ULONG32      GdiFlushActive : 1;            // 6 BitPosition                      
/*0x03C*/             ULONG32      UserStackWalkActive : 1;       // 7 BitPosition                      
/*0x03C*/             ULONG32      ApcInterruptRequest : 1;       // 8 BitPosition                      
/*0x03C*/             ULONG32      ForceDeferSchedule : 1;        // 9 BitPosition                      
/*0x03C*/             ULONG32      QuantumEndMigrate : 1;         // 10 BitPosition                     
/*0x03C*/             ULONG32      UmsDirectedSwitchEnable : 1;   // 11 BitPosition                     
/*0x03C*/             ULONG32      TimerActive : 1;               // 12 BitPosition                     
/*0x03C*/             ULONG32      SystemThread : 1;              // 13 BitPosition                     
/*0x03C*/             ULONG32      Reserved : 18;                 // 14 BitPosition                     
                  };                                                                                    
/*0x03C*/         LONG32       MiscFlags;                                                               
              };                                                                                        
              union                                               // 2 elements, 0x18 bytes (sizeof)    
              {                                                                                         
/*0x040*/         struct _KAPC_STATE ApcState;                    // 5 elements, 0x18 bytes (sizeof)    
                  struct                                          // 2 elements, 0x18 bytes (sizeof)    
                  {                                                                                     
/*0x040*/             UINT8        ApcStateFill[23];                                                    
/*0x057*/             CHAR         Priority;                                                            
                  };                                                                                    
              };                                                                                        
/*0x058*/     ULONG32      NextProcessor;                                                               
/*0x05C*/     ULONG32      DeferredProcessor;                                                           
/*0x060*/     ULONG32      ApcQueueLock;                                                                
/*0x064*/     ULONG32      ContextSwitches;                                                             
/*0x068*/     UINT8        State;                                                                       
/*0x069*/     CHAR         NpxState;                                                                    
/*0x06A*/     UINT8        WaitIrql;                                                                    
/*0x06B*/     CHAR         WaitMode;                                                                    
/*0x06C*/     LONG32       WaitStatus;                                                                  
/*0x070*/     struct _KWAIT_BLOCK* WaitBlockList;                                                       
              union                                               // 2 elements, 0x8 bytes (sizeof)     
              {                                                                                         
/*0x074*/         struct _LIST_ENTRY WaitListEntry;               // 2 elements, 0x8 bytes (sizeof)     
/*0x074*/         struct _SINGLE_LIST_ENTRY SwapListEntry;        // 1 elements, 0x4 bytes (sizeof)     
              };                                                                                        
/*0x07C*/     struct _KQUEUE* Queue;                                                                    
/*0x080*/     ULONG32      WaitTime;                                                                    
              union                                               // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                         
                  struct                                          // 2 elements, 0x4 bytes (sizeof)     
                  {                                                                                     
/*0x084*/             INT16        KernelApcDisable;                                                    
/*0x086*/             INT16        SpecialApcDisable;                                                   
                  };                                                                                    
/*0x084*/         ULONG32      CombinedApcDisable;                                                      
              };                                                                                        
/*0x088*/     VOID*        Teb;                                                                         
/*0x08C*/     UINT8        _PADDING1_[0x4];                                                             
/*0x090*/     struct _KTIMER Timer;                               // 5 elements, 0x28 bytes (sizeof)    
              union                                               // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                         
                  struct                                          // 12 elements, 0x4 bytes (sizeof)    
                  {                                                                                     
/*0x0B8*/             ULONG32      AutoAlignment : 1;             // 0 BitPosition                      
/*0x0B8*/             ULONG32      DisableBoost : 1;              // 1 BitPosition                      
/*0x0B8*/             ULONG32      EtwStackTraceApc1Inserted : 1; // 2 BitPosition                      
/*0x0B8*/             ULONG32      EtwStackTraceApc2Inserted : 1; // 3 BitPosition                      
/*0x0B8*/             ULONG32      CalloutActive : 1;             // 4 BitPosition                      
/*0x0B8*/             ULONG32      ApcQueueable : 1;              // 5 BitPosition                      
/*0x0B8*/             ULONG32      EnableStackSwap : 1;           // 6 BitPosition                      
/*0x0B8*/             ULONG32      GuiThread : 1;                 // 7 BitPosition                      
/*0x0B8*/             ULONG32      UmsPerformingSyscall : 1;      // 8 BitPosition                      
/*0x0B8*/             ULONG32      VdmSafe : 1;                   // 9 BitPosition                      
/*0x0B8*/             ULONG32      UmsDispatched : 1;             // 10 BitPosition                     
/*0x0B8*/             ULONG32      ReservedFlags : 21;            // 11 BitPosition                     
                  };                                                                                    
/*0x0B8*/         LONG32       ThreadFlags;                                                             
              };                                                                                        
/*0x0BC*/     VOID*        ServiceTable;                                                                
/*0x0C0*/     struct _KWAIT_BLOCK WaitBlock[4];                                                         
/*0x120*/     struct _LIST_ENTRY QueueListEntry;                  // 2 elements, 0x8 bytes (sizeof)     
/*0x128*/     struct _KTRAP_FRAME* TrapFrame;                                                           
/*0x12C*/     VOID*        FirstArgument;                                                               
              union                                               // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                         
/*0x130*/         VOID*        CallbackStack;                                                           
/*0x130*/         ULONG32      CallbackDepth;                                                           
              };                                                                                        
/*0x134*/     UINT8        ApcStateIndex;                                                               
/*0x135*/     CHAR         BasePriority;                                                                
              union                                               // 2 elements, 0x1 bytes (sizeof)     
              {                                                                                         
/*0x136*/         CHAR         PriorityDecrement;                                                       
                  struct                                          // 2 elements, 0x1 bytes (sizeof)     
                  {                                                                                     
/*0x136*/             UINT8        ForegroundBoost : 4;           // 0 BitPosition                      
/*0x136*/             UINT8        UnusualBoost : 4;              // 4 BitPosition                      
                  };                                                                                    
              };                                                                                        
/*0x137*/     UINT8        Preempted;                                                                   
/*0x138*/     UINT8        AdjustReason;                                                                
/*0x139*/     CHAR         AdjustIncrement;                                                             
/*0x13A*/     CHAR         PreviousMode;                                                                
/*0x13B*/     CHAR         Saturation;                                                                  
/*0x13C*/     ULONG32      SystemCallNumber;                                                            
/*0x140*/     ULONG32      FreezeCount;                                                                 
/*0x144*/     struct _GROUP_AFFINITY UserAffinity;                // 3 elements, 0xC bytes (sizeof)     
/*0x150*/     struct _KPROCESS* Process;                                                                
/*0x154*/     struct _GROUP_AFFINITY Affinity;                    // 3 elements, 0xC bytes (sizeof)     
/*0x160*/     ULONG32      IdealProcessor;                                                              
/*0x164*/     ULONG32      UserIdealProcessor;                                                          
/*0x168*/     struct _KAPC_STATE* ApcStatePointer[2];                                                   
              union                                               // 2 elements, 0x18 bytes (sizeof)    
              {                                                                                         
/*0x170*/         struct _KAPC_STATE SavedApcState;               // 5 elements, 0x18 bytes (sizeof)    
                  struct                                          // 2 elements, 0x18 bytes (sizeof)    
                  {                                                                                     
/*0x170*/             UINT8        SavedApcStateFill[23];                                               
/*0x187*/             UINT8        WaitReason;                                                          
                  };                                                                                    
              };                                                                                        
/*0x188*/     CHAR         SuspendCount;                                                                
/*0x189*/     CHAR         Spare1;                                                                      
/*0x18A*/     UINT8        OtherPlatformFill;                                                           
/*0x18B*/     UINT8        _PADDING2_[0x1];                                                             
/*0x18C*/     VOID*        Win32Thread;                                                                 
/*0x190*/     VOID*        StackBase;                                                                   
              union                                               // 7 elements, 0x30 bytes (sizeof)    
              {                                                                                         
/*0x194*/         struct _KAPC SuspendApc;                        // 16 elements, 0x30 bytes (sizeof)   
                  struct                                          // 2 elements, 0x30 bytes (sizeof)    
                  {                                                                                     
/*0x194*/             UINT8        SuspendApcFill0[1];                                                  
/*0x195*/             UINT8        ResourceIndex;                                                       
/*0x196*/             UINT8        _PADDING3_[0x2E];                                                    
                  };                                                                                    
                  struct                                          // 2 elements, 0x30 bytes (sizeof)    
                  {                                                                                     
/*0x194*/             UINT8        SuspendApcFill1[3];                                                  
/*0x197*/             UINT8        QuantumReset;                                                        
/*0x198*/             UINT8        _PADDING4_[0x2C];                                                    
                  };                                                                                    
                  struct                                          // 2 elements, 0x30 bytes (sizeof)    
                  {                                                                                     
/*0x194*/             UINT8        SuspendApcFill2[4];                                                  
/*0x198*/             ULONG32      KernelTime;                                                          
/*0x19C*/             UINT8        _PADDING5_[0x28];                                                    
                  };                                                                                    
                  struct                                          // 2 elements, 0x30 bytes (sizeof)    
                  {                                                                                     
/*0x194*/             UINT8        SuspendApcFill3[36];                                                 
/*0x1B8*/             struct _KPRCB* WaitPrcb;                                                          
/*0x1BC*/             UINT8        _PADDING6_[0x8];                                                     
                  };                                                                                    
                  struct                                          // 2 elements, 0x30 bytes (sizeof)    
                  {                                                                                     
/*0x194*/             UINT8        SuspendApcFill4[40];                                                 
/*0x1BC*/             VOID*        LegoData;                                                            
/*0x1C0*/             UINT8        _PADDING7_[0x4];                                                     
                  };                                                                                    
                  struct                                          // 2 elements, 0x30 bytes (sizeof)    
                  {                                                                                     
/*0x194*/             UINT8        SuspendApcFill5[47];                                                 
/*0x1C3*/             UINT8        LargeStack;                                                          
                  };                                                                                    
              };                                                                                        
/*0x1C4*/     ULONG32      UserTime;                                                                    
              union                                               // 2 elements, 0x14 bytes (sizeof)    
              {                                                                                         
/*0x1C8*/         struct _KSEMAPHORE SuspendSemaphore;            // 2 elements, 0x14 bytes (sizeof)    
/*0x1C8*/         UINT8        SuspendSemaphorefill[20];                                                
              };                                                                                        
/*0x1DC*/     ULONG32      SListFaultCount;                                                             
/*0x1E0*/     struct _LIST_ENTRY ThreadListEntry;                 // 2 elements, 0x8 bytes (sizeof)     
/*0x1E8*/     struct _LIST_ENTRY MutantListHead;                  // 2 elements, 0x8 bytes (sizeof)     
/*0x1F0*/     VOID*        SListFaultAddress;                                                           
/*0x1F4*/     struct _KTHREAD_COUNTERS* ThreadCounters;                                                 
/*0x1F8*/     struct _XSTATE_SAVE* XStateSave;                                                          
/*0x1FC*/     UINT8        _PADDING8_[0x4];                                                             
          }KTHREAD, *PKTHREAD;                                                                          
                                                                                                        
          typedef union _PS_CLIENT_SECURITY_CONTEXT    // 4 elements, 0x4 bytes (sizeof) 
          {                                                                              
/*0x000*/     ULONG32      ImpersonationData;                                            
/*0x000*/     VOID*        ImpersonationToken;                                           
              struct                                   // 2 elements, 0x4 bytes (sizeof) 
              {                                                                          
/*0x000*/         ULONG32      ImpersonationLevel : 2; // 0 BitPosition                  
/*0x000*/         ULONG32      EffectiveOnly : 1;      // 2 BitPosition                  
              };                                                                         
          }PS_CLIENT_SECURITY_CONTEXT, *PPS_CLIENT_SECURITY_CONTEXT;                                  
                                                                                         
          typedef struct _ETHREAD                                              // 88 elements, 0x2B8 bytes (sizeof)  
          {                                                                                                          
/*0x000*/     struct _KTHREAD Tcb;                                             // 117 elements, 0x200 bytes (sizeof) 
/*0x200*/     union _LARGE_INTEGER CreateTime;                                 // 4 elements, 0x8 bytes (sizeof)     
              union                                                            // 2 elements, 0x8 bytes (sizeof)     
              {                                                                                                      
/*0x208*/         union _LARGE_INTEGER ExitTime;                               // 4 elements, 0x8 bytes (sizeof)     
/*0x208*/         struct _LIST_ENTRY KeyedWaitChain;                           // 2 elements, 0x8 bytes (sizeof)     
              };                                                                                                     
/*0x210*/     LONG32       ExitStatus;                                                                               
              union                                                            // 2 elements, 0x8 bytes (sizeof)     
              {                                                                                                      
/*0x214*/         struct _LIST_ENTRY PostBlockList;                            // 2 elements, 0x8 bytes (sizeof)     
                  struct                                                       // 2 elements, 0x8 bytes (sizeof)     
                  {                                                                                                  
/*0x214*/             VOID*        ForwardLinkShadow;                                                                
/*0x218*/             VOID*        StartAddress;                                                                     
                  };                                                                                                 
              };                                                                                                     
              union                                                            // 3 elements, 0x4 bytes (sizeof)     
              {                                                                                                      
/*0x21C*/         struct _TERMINATION_PORT* TerminationPort;                                                         
/*0x21C*/         struct _ETHREAD* ReaperLink;                                                                       
/*0x21C*/         VOID*        KeyedWaitValue;                                                                       
              };                                                                                                     
/*0x220*/     ULONG32      ActiveTimerListLock;                                                                      
/*0x224*/     struct _LIST_ENTRY ActiveTimerListHead;                          // 2 elements, 0x8 bytes (sizeof)     
/*0x22C*/     struct _CLIENT_ID Cid;                                           // 2 elements, 0x8 bytes (sizeof)     
              union                                                            // 2 elements, 0x14 bytes (sizeof)    
              {                                                                                                      
/*0x234*/         struct _KSEMAPHORE KeyedWaitSemaphore;                       // 2 elements, 0x14 bytes (sizeof)    
/*0x234*/         struct _KSEMAPHORE AlpcWaitSemaphore;                        // 2 elements, 0x14 bytes (sizeof)    
              };                                                                                                     
/*0x248*/     union _PS_CLIENT_SECURITY_CONTEXT ClientSecurity;                // 4 elements, 0x4 bytes (sizeof)     
/*0x24C*/     struct _LIST_ENTRY IrpList;                                      // 2 elements, 0x8 bytes (sizeof)     
/*0x254*/     ULONG32      TopLevelIrp;                                                                              
/*0x258*/     struct _DEVICE_OBJECT* DeviceToVerify;                                                                 
/*0x25C*/     union _PSP_CPU_QUOTA_APC* CpuQuotaApc;                                                                 
/*0x260*/     VOID*        Win32StartAddress;                                                                        
/*0x264*/     VOID*        LegacyPowerObject;                                                                        
/*0x268*/     struct _LIST_ENTRY ThreadListEntry;                              // 2 elements, 0x8 bytes (sizeof)     
/*0x270*/     struct _EX_RUNDOWN_REF RundownProtect;                           // 2 elements, 0x4 bytes (sizeof)     
/*0x274*/     struct _EX_PUSH_LOCK ThreadLock;                                 // 7 elements, 0x4 bytes (sizeof)     
/*0x278*/     ULONG32      ReadClusterSize;                                                                          
/*0x27C*/     LONG32       MmLockOrdering;                                                                           
              union                                                            // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                      
/*0x280*/         ULONG32      CrossThreadFlags;                                                                     
                  struct                                                       // 14 elements, 0x4 bytes (sizeof)    
                  {                                                                                                  
/*0x280*/             ULONG32      Terminated : 1;                             // 0 BitPosition                      
/*0x280*/             ULONG32      ThreadInserted : 1;                         // 1 BitPosition                      
/*0x280*/             ULONG32      HideFromDebugger : 1;                       // 2 BitPosition                      
/*0x280*/             ULONG32      ActiveImpersonationInfo : 1;                // 3 BitPosition                      
/*0x280*/             ULONG32      Reserved : 1;                               // 4 BitPosition                      
/*0x280*/             ULONG32      HardErrorsAreDisabled : 1;                  // 5 BitPosition                      
/*0x280*/             ULONG32      BreakOnTermination : 1;                     // 6 BitPosition                      
/*0x280*/             ULONG32      SkipCreationMsg : 1;                        // 7 BitPosition                      
/*0x280*/             ULONG32      SkipTerminationMsg : 1;                     // 8 BitPosition                      
/*0x280*/             ULONG32      CopyTokenOnOpen : 1;                        // 9 BitPosition                      
/*0x280*/             ULONG32      ThreadIoPriority : 3;                       // 10 BitPosition                     
/*0x280*/             ULONG32      ThreadPagePriority : 3;                     // 13 BitPosition                     
/*0x280*/             ULONG32      RundownFail : 1;                            // 16 BitPosition                     
/*0x280*/             ULONG32      NeedsWorkingSetAging : 1;                   // 17 BitPosition                     
                  };                                                                                                 
              };                                                                                                     
              union                                                            // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                      
/*0x284*/         ULONG32      SameThreadPassiveFlags;                                                               
                  struct                                                       // 7 elements, 0x4 bytes (sizeof)     
                  {                                                                                                  
/*0x284*/             ULONG32      ActiveExWorker : 1;                         // 0 BitPosition                      
/*0x284*/             ULONG32      ExWorkerCanWaitUser : 1;                    // 1 BitPosition                      
/*0x284*/             ULONG32      MemoryMaker : 1;                            // 2 BitPosition                      
/*0x284*/             ULONG32      ClonedThread : 1;                           // 3 BitPosition                      
/*0x284*/             ULONG32      KeyedEventInUse : 1;                        // 4 BitPosition                      
/*0x284*/             ULONG32      RateApcState : 2;                           // 5 BitPosition                      
/*0x284*/             ULONG32      SelfTerminate : 1;                          // 7 BitPosition                      
                  };                                                                                                 
              };                                                                                                     
              union                                                            // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                      
/*0x288*/         ULONG32      SameThreadApcFlags;                                                                   
                  struct                                                       // 4 elements, 0x4 bytes (sizeof)     
                  {                                                                                                  
                      struct                                                   // 8 elements, 0x1 bytes (sizeof)     
                      {                                                                                              
/*0x288*/                 UINT8        Spare : 1;                              // 0 BitPosition                      
/*0x288*/                 UINT8        StartAddressInvalid : 1;                // 1 BitPosition                      
/*0x288*/                 UINT8        EtwPageFaultCalloutActive : 1;          // 2 BitPosition                      
/*0x288*/                 UINT8        OwnsProcessWorkingSetExclusive : 1;     // 3 BitPosition                      
/*0x288*/                 UINT8        OwnsProcessWorkingSetShared : 1;        // 4 BitPosition                      
/*0x288*/                 UINT8        OwnsSystemCacheWorkingSetExclusive : 1; // 5 BitPosition                      
/*0x288*/                 UINT8        OwnsSystemCacheWorkingSetShared : 1;    // 6 BitPosition                      
/*0x288*/                 UINT8        OwnsSessionWorkingSetExclusive : 1;     // 7 BitPosition                      
                      };                                                                                             
                      struct                                                   // 8 elements, 0x1 bytes (sizeof)     
                      {                                                                                              
/*0x289*/                 UINT8        OwnsSessionWorkingSetShared : 1;        // 0 BitPosition                      
/*0x289*/                 UINT8        OwnsProcessAddressSpaceExclusive : 1;   // 1 BitPosition                      
/*0x289*/                 UINT8        OwnsProcessAddressSpaceShared : 1;      // 2 BitPosition                      
/*0x289*/                 UINT8        SuppressSymbolLoad : 1;                 // 3 BitPosition                      
/*0x289*/                 UINT8        Prefetching : 1;                        // 4 BitPosition                      
/*0x289*/                 UINT8        OwnsDynamicMemoryShared : 1;            // 5 BitPosition                      
/*0x289*/                 UINT8        OwnsChangeControlAreaExclusive : 1;     // 6 BitPosition                      
/*0x289*/                 UINT8        OwnsChangeControlAreaShared : 1;        // 7 BitPosition                      
                      };                                                                                             
                      struct                                                   // 6 elements, 0x1 bytes (sizeof)     
                      {                                                                                              
/*0x28A*/                 UINT8        OwnsPagedPoolWorkingSetExclusive : 1;   // 0 BitPosition                      
/*0x28A*/                 UINT8        OwnsPagedPoolWorkingSetShared : 1;      // 1 BitPosition                      
/*0x28A*/                 UINT8        OwnsSystemPtesWorkingSetExclusive : 1;  // 2 BitPosition                      
/*0x28A*/                 UINT8        OwnsSystemPtesWorkingSetShared : 1;     // 3 BitPosition                      
/*0x28A*/                 UINT8        TrimTrigger : 2;                        // 4 BitPosition                      
/*0x28A*/                 UINT8        Spare1 : 2;                             // 6 BitPosition                      
                      };                                                                                             
/*0x28B*/             UINT8        PriorityRegionActive;                                                             
                  };                                                                                                 
              };                                                                                                     
/*0x28C*/     UINT8        CacheManagerActive;                                                                       
/*0x28D*/     UINT8        DisablePageFaultClustering;                                                               
/*0x28E*/     UINT8        ActiveFaultCount;                                                                         
/*0x28F*/     UINT8        LockOrderState;                                                                           
/*0x290*/     ULONG32      AlpcMessageId;                                                                            
              union                                                            // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                      
/*0x294*/         VOID*        AlpcMessage;                                                                          
/*0x294*/         ULONG32      AlpcReceiveAttributeSet;                                                              
              };                                                                                                     
/*0x298*/     struct _LIST_ENTRY AlpcWaitListEntry;                            // 2 elements, 0x8 bytes (sizeof)     
/*0x2A0*/     ULONG32      CacheManagerCount;                                                                        
/*0x2A4*/     ULONG32      IoBoostCount;                                                                             
/*0x2A8*/     ULONG32      IrpListLock;                                                                              
/*0x2AC*/     VOID*        ReservedForSynchTracking;                                                                 
/*0x2B0*/     struct _SINGLE_LIST_ENTRY CmCallbackListHead;                    // 1 elements, 0x4 bytes (sizeof)     
/*0x2B4*/     UINT8        _PADDING0_[0x4];                                                                          
          }ETHREAD, *PETHREAD;                                                                                       
                                                                                                                     
          typedef struct _EVENT_DATA_DESCRIPTOR // 3 elements, 0x10 bytes (sizeof) 
          {                                                                        
/*0x000*/     UINT64       Ptr;                                                    
/*0x008*/     ULONG32      Size;                                                   
/*0x00C*/     ULONG32      Reserved;                                               
          }EVENT_DATA_DESCRIPTOR, *PEVENT_DATA_DESCRIPTOR;                                   
                                                                                   
          typedef struct _EVENT_DESCRIPTOR // 7 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     UINT16       Id;                                                
/*0x002*/     UINT8        Version;                                           
/*0x003*/     UINT8        Channel;                                           
/*0x004*/     UINT8        Level;                                             
/*0x005*/     UINT8        Opcode;                                            
/*0x006*/     UINT16       Task;                                              
/*0x008*/     UINT64       Keyword;                                           
          }EVENT_DESCRIPTOR, *PEVENT_DESCRIPTOR;                                   
                                                                              
          typedef struct _EX_PUSH_LOCK_CACHE_AWARE // 1 elements, 0x80 bytes (sizeof) 
          {                                                                           
/*0x000*/     struct _EX_PUSH_LOCK* Locks[32];                                        
          }EX_PUSH_LOCK_CACHE_AWARE, *PEX_PUSH_LOCK_CACHE_AWARE;                                   
                                                                                      
          typedef struct _EX_PUSH_LOCK_WAIT_BLOCK        // 6 elements, 0x30 bytes (sizeof) 
          {                                                                                 
/*0x000*/     struct _KEVENT WakeEvent;                  // 1 elements, 0x10 bytes (sizeof) 
/*0x010*/     struct _EX_PUSH_LOCK_WAIT_BLOCK* Next;                                        
/*0x014*/     struct _EX_PUSH_LOCK_WAIT_BLOCK* Last;                                        
/*0x018*/     struct _EX_PUSH_LOCK_WAIT_BLOCK* Previous;                                    
/*0x01C*/     LONG32       ShareCount;                                                      
/*0x020*/     LONG32       Flags;                                                           
/*0x024*/     UINT8        _PADDING0_[0xC];                                                 
          }EX_PUSH_LOCK_WAIT_BLOCK, *PEX_PUSH_LOCK_WAIT_BLOCK;                                   
                                                                                            
          typedef struct _EXCEPTION_RECORD               // 6 elements, 0x50 bytes (sizeof) 
          {                                                                                 
/*0x000*/     LONG32       ExceptionCode;                                                   
/*0x004*/     ULONG32      ExceptionFlags;                                                  
/*0x008*/     struct _EXCEPTION_RECORD* ExceptionRecord;                                    
/*0x00C*/     VOID*        ExceptionAddress;                                                
/*0x010*/     ULONG32      NumberParameters;                                                
/*0x014*/     ULONG32      ExceptionInformation[15];                                        
          }EXCEPTION_RECORD, *PEXCEPTION_RECORD;                                            
                                                                                            
          typedef struct _EXCEPTION_REGISTRATION_RECORD    // 2 elements, 0x8 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _EXCEPTION_REGISTRATION_RECORD* Next;                                   
/*0x004*/     FUNCT_015F_015E_Handler* Handler;                                              
          }EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD;                                  
                                                                                             
          typedef struct _FAST_IO_DISPATCH                                                                                // 28 elements, 0x70 bytes (sizeof) 
          {                                                                                                                                                   
/*0x000*/     ULONG32      SizeOfFastIoDispatch;                                                                                                              
/*0x004*/     FUNCT_0067_0924_FastIoCheckIfPossible* FastIoCheckIfPossible;                                                                                   
/*0x008*/     FUNCT_0067_092E_FastIoRead_FastIoWrite* FastIoRead;                                                                                             
/*0x00C*/     FUNCT_0067_092E_FastIoRead_FastIoWrite* FastIoWrite;                                                                                            
/*0x010*/     FUNCT_0067_0938_FastIoQueryBasicInfo* FastIoQueryBasicInfo;                                                                                     
/*0x014*/     FUNCT_0067_0946_FastIoQueryStandardInfo* FastIoQueryStandardInfo;                                                                               
/*0x018*/     FUNCT_0067_0954_FastIoLock* FastIoLock;                                                                                                         
/*0x01C*/     FUNCT_0067_0ABC_FastIoUnlockSingle* FastIoUnlockSingle;                                                                                         
/*0x020*/     FUNCT_0067_0AC5_FastIoUnlockAll* FastIoUnlockAll;                                                                                               
/*0x024*/     FUNCT_0067_0ACB_FastIoUnlockAllByKey* FastIoUnlockAllByKey;                                                                                     
/*0x028*/     FUNCT_0067_0AD2_FastIoDeviceControl* FastIoDeviceControl;                                                                                       
/*0x02C*/     FUNCT_00A4_0ADD_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection* AcquireFileForNtCreateSection;                                     
/*0x030*/     FUNCT_00A4_0ADD_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection* ReleaseFileForNtCreateSection;                                     
/*0x034*/     FUNCT_00A4_0AE0_FastIoDetachDevice* FastIoDetachDevice;                                                                                         
/*0x038*/     FUNCT_0067_0AE4_FastIoQueryNetworkOpenInfo* FastIoQueryNetworkOpenInfo;                                                                         
/*0x03C*/     FUNCT_000F_0AF4_AcquireForModWrite* AcquireForModWrite;                                                                                         
/*0x040*/     FUNCT_0067_0AFA_MdlRead_PrepareMdlWrite* MdlRead;                                                                                               
/*0x044*/     FUNCT_0067_0B0E_MdlReadComplete_MdlReadCompleteCompressed* MdlReadComplete;                                                                     
/*0x048*/     FUNCT_0067_0AFA_MdlRead_PrepareMdlWrite* PrepareMdlWrite;                                                                                       
/*0x04C*/     FUNCT_0067_0B13_MdlWriteComplete_MdlWriteCompleteCompressed* MdlWriteComplete;                                                                  
/*0x050*/     FUNCT_0067_0B19_FastIoReadCompressed_FastIoWriteCompressed* FastIoReadCompressed;                                                               
/*0x054*/     FUNCT_0067_0B19_FastIoReadCompressed_FastIoWriteCompressed* FastIoWriteCompressed;                                                              
/*0x058*/     FUNCT_0067_0B0E_MdlReadComplete_MdlReadCompleteCompressed* MdlReadCompleteCompressed;                                                           
/*0x05C*/     FUNCT_0067_0B13_MdlWriteComplete_MdlWriteCompleteCompressed* MdlWriteCompleteCompressed;                                                        
/*0x060*/     FUNCT_0067_0B2E_FastIoQueryOpen* FastIoQueryOpen;                                                                                               
/*0x064*/     FUNCT_000F_0DE1_ReleaseForModWrite* ReleaseForModWrite;                                                                                         
/*0x068*/     FUNCT_000F_0DE6_AcquireForCcFlush_ReleaseForCcFlush* AcquireForCcFlush;                                                                         
/*0x06C*/     FUNCT_000F_0DE6_AcquireForCcFlush_ReleaseForCcFlush* ReleaseForCcFlush;                                                                         
          }FAST_IO_DISPATCH, *PFAST_IO_DISPATCH;                                                                                                              
                                                                                                                                                              
          typedef struct _FAST_MUTEX   // 5 elements, 0x20 bytes (sizeof) 
          {                                                               
/*0x000*/     LONG32       Count;                                         
/*0x004*/     struct _KTHREAD* Owner;                                     
/*0x008*/     ULONG32      Contention;                                    
/*0x00C*/     struct _KEVENT Event;    // 1 elements, 0x10 bytes (sizeof) 
/*0x01C*/     ULONG32      OldIrql;                                       
          }FAST_MUTEX, *PFAST_MUTEX;                                      
                                                                          
          typedef struct _FILE_BASIC_INFORMATION   // 5 elements, 0x28 bytes (sizeof) 
          {                                                                           
/*0x000*/     union _LARGE_INTEGER CreationTime;   // 4 elements, 0x8 bytes (sizeof)  
/*0x008*/     union _LARGE_INTEGER LastAccessTime; // 4 elements, 0x8 bytes (sizeof)  
/*0x010*/     union _LARGE_INTEGER LastWriteTime;  // 4 elements, 0x8 bytes (sizeof)  
/*0x018*/     union _LARGE_INTEGER ChangeTime;     // 4 elements, 0x8 bytes (sizeof)  
/*0x020*/     ULONG32      FileAttributes;                                            
/*0x024*/     UINT8        _PADDING0_[0x4];                                           
          }FILE_BASIC_INFORMATION, *PFILE_BASIC_INFORMATION;                                   
                                                                                      
          typedef struct _SID_IDENTIFIER_AUTHORITY // 1 elements, 0x6 bytes (sizeof) 
          {                                                                          
/*0x000*/     UINT8        Value[6];                                                 
          }SID_IDENTIFIER_AUTHORITY, *PSID_IDENTIFIER_AUTHORITY;                                  
                                                                                     
          typedef struct _SID                                       // 4 elements, 0xC bytes (sizeof) 
          {                                                                                           
/*0x000*/     UINT8        Revision;                                                                  
/*0x001*/     UINT8        SubAuthorityCount;                                                         
/*0x002*/     struct _SID_IDENTIFIER_AUTHORITY IdentifierAuthority; // 1 elements, 0x6 bytes (sizeof) 
/*0x008*/     ULONG32      SubAuthority[1];                                                           
          }SID, *PSID;                                                                                
                                                                                                      
          typedef struct _FILE_GET_QUOTA_INFORMATION // 3 elements, 0x14 bytes (sizeof) 
          {                                                                             
/*0x000*/     ULONG32      NextEntryOffset;                                             
/*0x004*/     ULONG32      SidLength;                                                   
/*0x008*/     struct _SID  Sid;                      // 4 elements, 0xC bytes (sizeof)  
          }FILE_GET_QUOTA_INFORMATION, *PFILE_GET_QUOTA_INFORMATION;                                   
                                                                                        
          typedef struct _FILE_NETWORK_OPEN_INFORMATION // 7 elements, 0x38 bytes (sizeof) 
          {                                                                                
/*0x000*/     union _LARGE_INTEGER CreationTime;        // 4 elements, 0x8 bytes (sizeof)  
/*0x008*/     union _LARGE_INTEGER LastAccessTime;      // 4 elements, 0x8 bytes (sizeof)  
/*0x010*/     union _LARGE_INTEGER LastWriteTime;       // 4 elements, 0x8 bytes (sizeof)  
/*0x018*/     union _LARGE_INTEGER ChangeTime;          // 4 elements, 0x8 bytes (sizeof)  
/*0x020*/     union _LARGE_INTEGER AllocationSize;      // 4 elements, 0x8 bytes (sizeof)  
/*0x028*/     union _LARGE_INTEGER EndOfFile;           // 4 elements, 0x8 bytes (sizeof)  
/*0x030*/     ULONG32      FileAttributes;                                                 
/*0x034*/     UINT8        _PADDING0_[0x4];                                                
          }FILE_NETWORK_OPEN_INFORMATION, *PFILE_NETWORK_OPEN_INFORMATION;                                   
                                                                                           
          typedef struct _FILE_OBJECT                                // 30 elements, 0x80 bytes (sizeof) 
          {                                                                                              
/*0x000*/     INT16        Type;                                                                         
/*0x002*/     INT16        Size;                                                                         
/*0x004*/     struct _DEVICE_OBJECT* DeviceObject;                                                       
/*0x008*/     struct _VPB* Vpb;                                                                          
/*0x00C*/     VOID*        FsContext;                                                                    
/*0x010*/     VOID*        FsContext2;                                                                   
/*0x014*/     struct _SECTION_OBJECT_POINTERS* SectionObjectPointer;                                     
/*0x018*/     VOID*        PrivateCacheMap;                                                              
/*0x01C*/     LONG32       FinalStatus;                                                                  
/*0x020*/     struct _FILE_OBJECT* RelatedFileObject;                                                    
/*0x024*/     UINT8        LockOperation;                                                                
/*0x025*/     UINT8        DeletePending;                                                                
/*0x026*/     UINT8        ReadAccess;                                                                   
/*0x027*/     UINT8        WriteAccess;                                                                  
/*0x028*/     UINT8        DeleteAccess;                                                                 
/*0x029*/     UINT8        SharedRead;                                                                   
/*0x02A*/     UINT8        SharedWrite;                                                                  
/*0x02B*/     UINT8        SharedDelete;                                                                 
/*0x02C*/     ULONG32      Flags;                                                                        
/*0x030*/     struct _UNICODE_STRING FileName;                       // 3 elements, 0x8 bytes (sizeof)   
/*0x038*/     union _LARGE_INTEGER CurrentByteOffset;                // 4 elements, 0x8 bytes (sizeof)   
/*0x040*/     ULONG32      Waiters;                                                                      
/*0x044*/     ULONG32      Busy;                                                                         
/*0x048*/     VOID*        LastLock;                                                                     
/*0x04C*/     struct _KEVENT Lock;                                   // 1 elements, 0x10 bytes (sizeof)  
/*0x05C*/     struct _KEVENT Event;                                  // 1 elements, 0x10 bytes (sizeof)  
/*0x06C*/     struct _IO_COMPLETION_CONTEXT* CompletionContext;                                          
/*0x070*/     ULONG32      IrpListLock;                                                                  
/*0x074*/     struct _LIST_ENTRY IrpList;                            // 2 elements, 0x8 bytes (sizeof)   
/*0x07C*/     VOID*        FileObjectExtension;                                                          
          }FILE_OBJECT, *PFILE_OBJECT;                                                                   
                                                                                                         
          typedef struct _FILE_STANDARD_INFORMATION // 5 elements, 0x18 bytes (sizeof) 
          {                                                                            
/*0x000*/     union _LARGE_INTEGER AllocationSize;  // 4 elements, 0x8 bytes (sizeof)  
/*0x008*/     union _LARGE_INTEGER EndOfFile;       // 4 elements, 0x8 bytes (sizeof)  
/*0x010*/     ULONG32      NumberOfLinks;                                              
/*0x014*/     UINT8        DeletePending;                                              
/*0x015*/     UINT8        Directory;                                                  
/*0x016*/     UINT8        _PADDING0_[0x2];                                            
          }FILE_STANDARD_INFORMATION, *PFILE_STANDARD_INFORMATION;                                   
                                                                                       
          typedef struct _flags                      // 5 elements, 0x1 bytes (sizeof) 
          {                                                                            
/*0x000*/     UINT8        Removable : 1;            // 0 BitPosition                  
/*0x000*/     UINT8        GroupAssigned : 1;        // 1 BitPosition                  
/*0x000*/     UINT8        GroupCommitted : 1;       // 2 BitPosition                  
/*0x000*/     UINT8        GroupAssignmentFixed : 1; // 3 BitPosition                  
/*0x000*/     UINT8        Fill : 4;                 // 4 BitPosition                  
          }flags, *Pflags;                                                             
                                                                                       
typedef struct _FLS_CALLBACK_INFO // 0 elements, 0x0 bytes (sizeof) 
{                                                                   
}FLS_CALLBACK_INFO, *PFLS_CALLBACK_INFO;                                  
                                                                    
          typedef union _FS_FILTER_PARAMETERS                                   // 5 elements, 0x14 bytes (sizeof) 
          {                                                                                                        
              struct                                                            // 2 elements, 0x8 bytes (sizeof)  
              {                                                                                                    
/*0x000*/         union _LARGE_INTEGER* EndingOffset;                                                              
/*0x004*/         struct _ERESOURCE** ResourceToRelease;                                                           
              }AcquireForModifiedPageWriter;                                                                       
              struct                                                            // 1 elements, 0x4 bytes (sizeof)  
              {                                                                                                    
/*0x000*/         struct _ERESOURCE* ResourceToRelease;                                                            
              }ReleaseForModifiedPageWriter;                                                                       
              struct                                                            // 2 elements, 0x8 bytes (sizeof)  
              {                                                                                                    
/*0x000*/         enum _FS_FILTER_SECTION_SYNC_TYPE SyncType;                                                      
/*0x004*/         ULONG32      PageProtection;                                                                     
              }AcquireForSectionSynchronization;                                                                   
              struct                                                            // 2 elements, 0x8 bytes (sizeof)  
              {                                                                                                    
/*0x000*/         enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE NotificationType;                                    
/*0x004*/         UINT8        SafeToRecurse;                                                                      
/*0x005*/         UINT8        _PADDING0_[0x3];                                                                    
              }NotifyStreamFileObject;                                                                             
              struct                                                            // 5 elements, 0x14 bytes (sizeof) 
              {                                                                                                    
/*0x000*/         VOID*        Argument1;                                                                          
/*0x004*/         VOID*        Argument2;                                                                          
/*0x008*/         VOID*        Argument3;                                                                          
/*0x00C*/         VOID*        Argument4;                                                                          
/*0x010*/         VOID*        Argument5;                                                                          
              }Others;                                                                                             
          }FS_FILTER_PARAMETERS, *PFS_FILTER_PARAMETERS;                                                           
                                                                                                                   
          typedef struct _FS_FILTER_CALLBACK_DATA      // 6 elements, 0x24 bytes (sizeof) 
          {                                                                               
/*0x000*/     ULONG32      SizeOfFsFilterCallbackData;                                    
/*0x004*/     UINT8        Operation;                                                     
/*0x005*/     UINT8        Reserved;                                                      
/*0x006*/     UINT8        _PADDING0_[0x2];                                               
/*0x008*/     struct _DEVICE_OBJECT* DeviceObject;                                        
/*0x00C*/     struct _FILE_OBJECT* FileObject;                                            
/*0x010*/     union _FS_FILTER_PARAMETERS Parameters;  // 5 elements, 0x14 bytes (sizeof) 
          }FS_FILTER_CALLBACK_DATA, *PFS_FILTER_CALLBACK_DATA;                                   
                                                                                          
          typedef struct _FS_FILTER_CALLBACKS                                                                                                                                                                                                                // 14 elements, 0x38 bytes (sizeof) 
          {                                                                                                                                                                                                                                                                                      
/*0x000*/     ULONG32      SizeOfFsFilterCallbacks;                                                                                                                                                                                                                                              
/*0x004*/     ULONG32      Reserved;                                                                                                                                                                                                                                                             
/*0x008*/     FUNCT_000F_0887_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter* PreAcquireForSectionSynchronization;                                            
/*0x00C*/     FUNCT_00A4_0900_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter* PostAcquireForSectionSynchronization;                                     
/*0x010*/     FUNCT_000F_0887_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter* PreReleaseForSectionSynchronization;                                            
/*0x014*/     FUNCT_00A4_0900_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter* PostReleaseForSectionSynchronization;                                     
/*0x018*/     FUNCT_000F_0887_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter* PreAcquireForCcFlush;                                                           
/*0x01C*/     FUNCT_00A4_0900_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter* PostAcquireForCcFlush;                                                    
/*0x020*/     FUNCT_000F_0887_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter* PreReleaseForCcFlush;                                                           
/*0x024*/     FUNCT_00A4_0900_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter* PostReleaseForCcFlush;                                                    
/*0x028*/     FUNCT_000F_0887_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter* PreAcquireForModifiedPageWriter;                                                
/*0x02C*/     FUNCT_00A4_0900_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter* PostAcquireForModifiedPageWriter;                                         
/*0x030*/     FUNCT_000F_0887_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter* PreReleaseForModifiedPageWriter;                                                
/*0x034*/     FUNCT_00A4_0900_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter* PostReleaseForModifiedPageWriter;                                         
          }FS_FILTER_CALLBACKS, *PFS_FILTER_CALLBACKS;                                                                                                                                                                                                                                           
                                                                                                                                                                                                                                                                                                 
          typedef struct _GDI_TEB_BATCH // 3 elements, 0x4E0 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      Offset;                                          
/*0x004*/     ULONG32      HDC;                                             
/*0x008*/     ULONG32      Buffer[310];                                     
          }GDI_TEB_BATCH, *PGDI_TEB_BATCH;                                    
                                                                            
          typedef struct _GENERAL_LOOKASIDE                                                           // 22 elements, 0x80 bytes (sizeof) 
          {                                                                                                                               
              union                                                                                   // 2 elements, 0x8 bytes (sizeof)   
              {                                                                                                                           
/*0x000*/         union _SLIST_HEADER ListHead;                                                       // 4 elements, 0x8 bytes (sizeof)   
/*0x000*/         struct _SINGLE_LIST_ENTRY SingleListHead;                                           // 1 elements, 0x4 bytes (sizeof)   
              };                                                                                                                          
/*0x008*/     UINT16       Depth;                                                                                                         
/*0x00A*/     UINT16       MaximumDepth;                                                                                                  
/*0x00C*/     ULONG32      TotalAllocates;                                                                                                
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x010*/         ULONG32      AllocateMisses;                                                                                            
/*0x010*/         ULONG32      AllocateHits;                                                                                              
              };                                                                                                                          
/*0x014*/     ULONG32      TotalFrees;                                                                                                    
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x018*/         ULONG32      FreeMisses;                                                                                                
/*0x018*/         ULONG32      FreeHits;                                                                                                  
              };                                                                                                                          
/*0x01C*/     enum _POOL_TYPE Type;                                                                                                       
/*0x020*/     ULONG32      Tag;                                                                                                           
/*0x024*/     ULONG32      Size;                                                                                                          
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x028*/         FUNCT_00A7_0652_AllocateEx* AllocateEx;                                                                                 
/*0x028*/         FUNCT_00A7_065C_Allocate* Allocate;                                                                                     
              };                                                                                                                          
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x02C*/         FUNCT_00A4_0661_FreeEx* FreeEx;                                                                                         
/*0x02C*/         FUNCT_00A4_0665_Free_InterfaceReference_InterfaceDereference_DeleteProcedure* Free;                                     
              };                                                                                                                          
/*0x030*/     struct _LIST_ENTRY ListEntry;                                                           // 2 elements, 0x8 bytes (sizeof)   
/*0x038*/     ULONG32      LastTotalAllocates;                                                                                            
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x03C*/         ULONG32      LastAllocateMisses;                                                                                        
/*0x03C*/         ULONG32      LastAllocateHits;                                                                                          
              };                                                                                                                          
/*0x040*/     ULONG32      Future[2];                                                                                                     
/*0x048*/     UINT8        _PADDING0_[0x38];                                                                                              
          }GENERAL_LOOKASIDE, *PGENERAL_LOOKASIDE;                                                                                        
                                                                                                                                          
          typedef struct _GENERAL_LOOKASIDE_POOL                                                      // 22 elements, 0x48 bytes (sizeof) 
          {                                                                                                                               
              union                                                                                   // 2 elements, 0x8 bytes (sizeof)   
              {                                                                                                                           
/*0x000*/         union _SLIST_HEADER ListHead;                                                       // 4 elements, 0x8 bytes (sizeof)   
/*0x000*/         struct _SINGLE_LIST_ENTRY SingleListHead;                                           // 1 elements, 0x4 bytes (sizeof)   
              };                                                                                                                          
/*0x008*/     UINT16       Depth;                                                                                                         
/*0x00A*/     UINT16       MaximumDepth;                                                                                                  
/*0x00C*/     ULONG32      TotalAllocates;                                                                                                
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x010*/         ULONG32      AllocateMisses;                                                                                            
/*0x010*/         ULONG32      AllocateHits;                                                                                              
              };                                                                                                                          
/*0x014*/     ULONG32      TotalFrees;                                                                                                    
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x018*/         ULONG32      FreeMisses;                                                                                                
/*0x018*/         ULONG32      FreeHits;                                                                                                  
              };                                                                                                                          
/*0x01C*/     enum _POOL_TYPE Type;                                                                                                       
/*0x020*/     ULONG32      Tag;                                                                                                           
/*0x024*/     ULONG32      Size;                                                                                                          
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x028*/         FUNCT_00A7_0652_AllocateEx* AllocateEx;                                                                                 
/*0x028*/         FUNCT_00A7_065C_Allocate* Allocate;                                                                                     
              };                                                                                                                          
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x02C*/         FUNCT_00A4_0661_FreeEx* FreeEx;                                                                                         
/*0x02C*/         FUNCT_00A4_0665_Free_InterfaceReference_InterfaceDereference_DeleteProcedure* Free;                                     
              };                                                                                                                          
/*0x030*/     struct _LIST_ENTRY ListEntry;                                                           // 2 elements, 0x8 bytes (sizeof)   
/*0x038*/     ULONG32      LastTotalAllocates;                                                                                            
              union                                                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                                           
/*0x03C*/         ULONG32      LastAllocateMisses;                                                                                        
/*0x03C*/         ULONG32      LastAllocateHits;                                                                                          
              };                                                                                                                          
/*0x040*/     ULONG32      Future[2];                                                                                                     
          }GENERAL_LOOKASIDE_POOL, *PGENERAL_LOOKASIDE_POOL;                                                                              
                                                                                                                                          
          typedef struct _HANDLE_TABLE                         // 15 elements, 0x3C bytes (sizeof) 
          {                                                                                        
/*0x000*/     ULONG32      TableCode;                                                              
/*0x004*/     struct _EPROCESS* QuotaProcess;                                                      
/*0x008*/     VOID*        UniqueProcessId;                                                        
/*0x00C*/     struct _EX_PUSH_LOCK HandleLock;                 // 7 elements, 0x4 bytes (sizeof)   
/*0x010*/     struct _LIST_ENTRY HandleTableList;              // 2 elements, 0x8 bytes (sizeof)   
/*0x018*/     struct _EX_PUSH_LOCK HandleContentionEvent;      // 7 elements, 0x4 bytes (sizeof)   
/*0x01C*/     struct _HANDLE_TRACE_DEBUG_INFO* DebugInfo;                                          
/*0x020*/     LONG32       ExtraInfoPages;                                                         
              union                                            // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                    
/*0x024*/         ULONG32      Flags;                                                              
/*0x024*/         UINT8        StrictFIFO : 1;                 // 0 BitPosition                    
              };                                                                                   
/*0x028*/     ULONG32      FirstFreeHandle;                                                        
/*0x02C*/     struct _HANDLE_TABLE_ENTRY* LastFreeHandleEntry;                                     
/*0x030*/     ULONG32      HandleCount;                                                            
/*0x034*/     ULONG32      NextHandleNeedingPool;                                                  
/*0x038*/     ULONG32      HandleCountHighWatermark;                                               
          }HANDLE_TABLE, *PHANDLE_TABLE;                                                           
                                                                                                   
          typedef struct _HANDLE_TABLE_ENTRY                  // 8 elements, 0x8 bytes (sizeof) 
          {                                                                                     
              union                                           // 4 elements, 0x4 bytes (sizeof) 
              {                                                                                 
/*0x000*/         VOID*        Object;                                                          
/*0x000*/         ULONG32      ObAttributes;                                                    
/*0x000*/         struct _HANDLE_TABLE_ENTRY_INFO* InfoTable;                                   
/*0x000*/         ULONG32      Value;                                                           
              };                                                                                
              union                                           // 3 elements, 0x4 bytes (sizeof) 
              {                                                                                 
/*0x004*/         ULONG32      GrantedAccess;                                                   
                  struct                                      // 2 elements, 0x4 bytes (sizeof) 
                  {                                                                             
/*0x004*/             UINT16       GrantedAccessIndex;                                          
/*0x006*/             UINT16       CreatorBackTraceIndex;                                       
                  };                                                                            
/*0x004*/         ULONG32      NextFreeTableEntry;                                              
              };                                                                                
          }HANDLE_TABLE_ENTRY, *PHANDLE_TABLE_ENTRY;                                            
                                                                                                
          typedef struct _HANDLE_TABLE_ENTRY_INFO // 1 elements, 0x4 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      AuditMask;                                               
          }HANDLE_TABLE_ENTRY_INFO, *PHANDLE_TABLE_ENTRY_INFO;                                  
                                                                                    
          typedef struct _HANDLE_TRACE_DB_ENTRY // 4 elements, 0x50 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _CLIENT_ID ClientId;       // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     VOID*        Handle;                                                 
/*0x00C*/     ULONG32      Type;                                                   
/*0x010*/     VOID*        StackTrace[16];                                         
          }HANDLE_TRACE_DB_ENTRY, *PHANDLE_TRACE_DB_ENTRY;                                   
                                                                                   
          typedef struct _HANDLE_TRACE_DEBUG_INFO       // 6 elements, 0x80 bytes (sizeof) 
          {                                                                                
/*0x000*/     LONG32       RefCount;                                                       
/*0x004*/     ULONG32      TableSize;                                                      
/*0x008*/     ULONG32      BitMaskFlags;                                                   
/*0x00C*/     struct _FAST_MUTEX CloseCompactionLock;   // 5 elements, 0x20 bytes (sizeof) 
/*0x02C*/     ULONG32      CurrentStackIndex;                                              
/*0x030*/     struct _HANDLE_TRACE_DB_ENTRY TraceDb[1];                                    
          }HANDLE_TRACE_DEBUG_INFO, *PHANDLE_TRACE_DEBUG_INFO;                                   
                                                                                           
          typedef struct _HEAP_ENTRY                       // 19 elements, 0x8 bytes (sizeof) 
          {                                                                                   
              union                                        // 6 elements, 0x8 bytes (sizeof)  
              {                                                                               
                  struct                                   // 3 elements, 0x8 bytes (sizeof)  
                  {                                                                           
/*0x000*/             UINT16       Size;                                                      
/*0x002*/             UINT8        Flags;                                                     
/*0x003*/             UINT8        SmallTagIndex;                                             
/*0x004*/             UINT8        _PADDING0_[0x4];                                           
                  };                                                                          
                  struct                                   // 4 elements, 0x8 bytes (sizeof)  
                  {                                                                           
/*0x000*/             VOID*        SubSegmentCode;                                            
/*0x004*/             UINT16       PreviousSize;                                              
                      union                                // 2 elements, 0x1 bytes (sizeof)  
                      {                                                                       
/*0x006*/                 UINT8        SegmentOffset;                                         
/*0x006*/                 UINT8        LFHFlags;                                              
                      };                                                                      
/*0x007*/             UINT8        UnusedBytes;                                               
                  };                                                                          
                  struct                                   // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                           
/*0x000*/             UINT16       FunctionIndex;                                             
/*0x002*/             UINT16       ContextValue;                                              
/*0x004*/             UINT8        _PADDING1_[0x4];                                           
                  };                                                                          
                  struct                                   // 4 elements, 0x8 bytes (sizeof)  
                  {                                                                           
/*0x000*/             ULONG32      InterceptorValue;                                          
/*0x004*/             UINT16       UnusedBytesLength;                                         
/*0x006*/             UINT8        EntryOffset;                                               
/*0x007*/             UINT8        ExtendedBlockSignature;                                    
                  };                                                                          
                  struct                                   // 4 elements, 0x8 bytes (sizeof)  
                  {                                                                           
/*0x000*/             ULONG32      Code1;                                                     
/*0x004*/             UINT16       Code2;                                                     
/*0x006*/             UINT8        Code3;                                                     
/*0x007*/             UINT8        Code4;                                                     
                  };                                                                          
/*0x000*/         UINT64       AgregateCode;                                                  
              };                                                                              
          }HEAP_ENTRY, *PHEAP_ENTRY;                                                          
                                                                                              
          typedef struct _HEAP_COUNTERS              // 21 elements, 0x54 bytes (sizeof) 
          {                                                                              
/*0x000*/     ULONG32      TotalMemoryReserved;                                          
/*0x004*/     ULONG32      TotalMemoryCommitted;                                         
/*0x008*/     ULONG32      TotalMemoryLargeUCR;                                          
/*0x00C*/     ULONG32      TotalSizeInVirtualBlocks;                                     
/*0x010*/     ULONG32      TotalSegments;                                                
/*0x014*/     ULONG32      TotalUCRs;                                                    
/*0x018*/     ULONG32      CommittOps;                                                   
/*0x01C*/     ULONG32      DeCommitOps;                                                  
/*0x020*/     ULONG32      LockAcquires;                                                 
/*0x024*/     ULONG32      LockCollisions;                                               
/*0x028*/     ULONG32      CommitRate;                                                   
/*0x02C*/     ULONG32      DecommittRate;                                                
/*0x030*/     ULONG32      CommitFailures;                                               
/*0x034*/     ULONG32      InBlockCommitFailures;                                        
/*0x038*/     ULONG32      CompactHeapCalls;                                             
/*0x03C*/     ULONG32      CompactedUCRs;                                                
/*0x040*/     ULONG32      AllocAndFreeOps;                                              
/*0x044*/     ULONG32      InBlockDeccommits;                                            
/*0x048*/     ULONG32      InBlockDeccomitSize;                                          
/*0x04C*/     ULONG32      HighWatermarkSize;                                            
/*0x050*/     ULONG32      LastPolledSize;                                               
          }HEAP_COUNTERS, *PHEAP_COUNTERS;                                               
                                                                                         
          typedef struct _HEAP_TUNING_PARAMETERS   // 2 elements, 0x8 bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      CommittThresholdShift;                                    
/*0x004*/     ULONG32      MaxPreCommittThreshold;                                   
          }HEAP_TUNING_PARAMETERS, *PHEAP_TUNING_PARAMETERS;                                  
                                                                                     
          typedef struct _HEAP                                 // 53 elements, 0x138 bytes (sizeof) 
          {                                                                                         
/*0x000*/     struct _HEAP_ENTRY Entry;                        // 19 elements, 0x8 bytes (sizeof)   
/*0x008*/     ULONG32      SegmentSignature;                                                        
/*0x00C*/     ULONG32      SegmentFlags;                                                            
/*0x010*/     struct _LIST_ENTRY SegmentListEntry;             // 2 elements, 0x8 bytes (sizeof)    
/*0x018*/     struct _HEAP* Heap;                                                                   
/*0x01C*/     VOID*        BaseAddress;                                                             
/*0x020*/     ULONG32      NumberOfPages;                                                           
/*0x024*/     struct _HEAP_ENTRY* FirstEntry;                                                       
/*0x028*/     struct _HEAP_ENTRY* LastValidEntry;                                                   
/*0x02C*/     ULONG32      NumberOfUnCommittedPages;                                                
/*0x030*/     ULONG32      NumberOfUnCommittedRanges;                                               
/*0x034*/     UINT16       SegmentAllocatorBackTraceIndex;                                          
/*0x036*/     UINT16       Reserved;                                                                
/*0x038*/     struct _LIST_ENTRY UCRSegmentList;               // 2 elements, 0x8 bytes (sizeof)    
/*0x040*/     ULONG32      Flags;                                                                   
/*0x044*/     ULONG32      ForceFlags;                                                              
/*0x048*/     ULONG32      CompatibilityFlags;                                                      
/*0x04C*/     ULONG32      EncodeFlagMask;                                                          
/*0x050*/     struct _HEAP_ENTRY Encoding;                     // 19 elements, 0x8 bytes (sizeof)   
/*0x058*/     ULONG32      PointerKey;                                                              
/*0x05C*/     ULONG32      Interceptor;                                                             
/*0x060*/     ULONG32      VirtualMemoryThreshold;                                                  
/*0x064*/     ULONG32      Signature;                                                               
/*0x068*/     ULONG32      SegmentReserve;                                                          
/*0x06C*/     ULONG32      SegmentCommit;                                                           
/*0x070*/     ULONG32      DeCommitFreeBlockThreshold;                                              
/*0x074*/     ULONG32      DeCommitTotalFreeThreshold;                                              
/*0x078*/     ULONG32      TotalFreeSize;                                                           
/*0x07C*/     ULONG32      MaximumAllocationSize;                                                   
/*0x080*/     UINT16       ProcessHeapsListIndex;                                                   
/*0x082*/     UINT16       HeaderValidateLength;                                                    
/*0x084*/     VOID*        HeaderValidateCopy;                                                      
/*0x088*/     UINT16       NextAvailableTagIndex;                                                   
/*0x08A*/     UINT16       MaximumTagIndex;                                                         
/*0x08C*/     struct _HEAP_TAG_ENTRY* TagEntries;                                                   
/*0x090*/     struct _LIST_ENTRY UCRList;                      // 2 elements, 0x8 bytes (sizeof)    
/*0x098*/     ULONG32      AlignRound;                                                              
/*0x09C*/     ULONG32      AlignMask;                                                               
/*0x0A0*/     struct _LIST_ENTRY VirtualAllocdBlocks;          // 2 elements, 0x8 bytes (sizeof)    
/*0x0A8*/     struct _LIST_ENTRY SegmentList;                  // 2 elements, 0x8 bytes (sizeof)    
/*0x0B0*/     UINT16       AllocatorBackTraceIndex;                                                 
/*0x0B2*/     UINT8        _PADDING0_[0x2];                                                         
/*0x0B4*/     ULONG32      NonDedicatedListLength;                                                  
/*0x0B8*/     VOID*        BlocksIndex;                                                             
/*0x0BC*/     VOID*        UCRIndex;                                                                
/*0x0C0*/     struct _HEAP_PSEUDO_TAG_ENTRY* PseudoTagEntries;                                      
/*0x0C4*/     struct _LIST_ENTRY FreeLists;                    // 2 elements, 0x8 bytes (sizeof)    
/*0x0CC*/     struct _HEAP_LOCK* LockVariable;                                                      
/*0x0D0*/     FUNCT_000F_1024_CommitRoutine* CommitRoutine;                                         
/*0x0D4*/     VOID*        FrontEndHeap;                                                            
/*0x0D8*/     UINT16       FrontHeapLockCount;                                                      
/*0x0DA*/     UINT8        FrontEndHeapType;                                                        
/*0x0DB*/     UINT8        _PADDING1_[0x1];                                                         
/*0x0DC*/     struct _HEAP_COUNTERS Counters;                  // 21 elements, 0x54 bytes (sizeof)  
/*0x130*/     struct _HEAP_TUNING_PARAMETERS TuningParameters; // 2 elements, 0x8 bytes (sizeof)    
          }HEAP, *PHEAP;                                                                            
                                                                                                    
          typedef struct _HEAP_BUCKET           // 4 elements, 0x4 bytes (sizeof) 
          {                                                                       
/*0x000*/     UINT16       BlockUnits;                                            
/*0x002*/     UINT8        SizeIndex;                                             
              struct                            // 2 elements, 0x1 bytes (sizeof) 
              {                                                                   
/*0x003*/         UINT8        UseAffinity : 1; // 0 BitPosition                  
/*0x003*/         UINT8        DebugFlags : 2;  // 1 BitPosition                  
              };                                                                  
          }HEAP_BUCKET, *PHEAP_BUCKET;                                            
                                                                                  
          typedef union _HEAP_BUCKET_COUNTERS    // 3 elements, 0x8 bytes (sizeof) 
          {                                                                        
              struct                             // 2 elements, 0x8 bytes (sizeof) 
              {                                                                    
/*0x000*/         ULONG32      TotalBlocks;                                        
/*0x004*/         ULONG32      SubSegmentCounts;                                   
              };                                                                   
/*0x000*/     INT64        Aggregate64;                                            
          }HEAP_BUCKET_COUNTERS, *PHEAP_BUCKET_COUNTERS;                                  
                                                                                   
          typedef union _HEAP_BUCKET_RUN_INFO // 3 elements, 0x8 bytes (sizeof) 
          {                                                                     
              struct                          // 2 elements, 0x8 bytes (sizeof) 
              {                                                                 
/*0x000*/         ULONG32      Bucket;                                          
/*0x004*/         ULONG32      RunLength;                                       
              };                                                                
/*0x000*/     INT64        Aggregate64;                                         
          }HEAP_BUCKET_RUN_INFO, *PHEAP_BUCKET_RUN_INFO;                                  
                                                                                
          typedef struct _HEAP_DEBUGGING_INFORMATION                                  // 7 elements, 0x1C bytes (sizeof) 
          {                                                                                                              
/*0x000*/     VOID*        InterceptorFunction;                                                                          
/*0x004*/     UINT16       InterceptorValue;                                                                             
/*0x006*/     UINT8        _PADDING0_[0x2];                                                                              
/*0x008*/     ULONG32      ExtendedOptions;                                                                              
/*0x00C*/     ULONG32      StackTraceDepth;                                                                              
/*0x010*/     ULONG32      MinTotalBlockSize;                                                                            
/*0x014*/     ULONG32      MaxTotalBlockSize;                                                                            
/*0x018*/     FUNCT_000F_1218_HeapLeakEnumerationRoutine* HeapLeakEnumerationRoutine;                                    
          }HEAP_DEBUGGING_INFORMATION, *PHEAP_DEBUGGING_INFORMATION;                                                     
                                                                                                                         
          typedef struct _HEAP_ENTRY_EXTRA                  // 4 elements, 0x8 bytes (sizeof) 
          {                                                                                   
              union                                         // 2 elements, 0x8 bytes (sizeof) 
              {                                                                               
                  struct                                    // 3 elements, 0x8 bytes (sizeof) 
                  {                                                                           
/*0x000*/             UINT16       AllocatorBackTraceIndex;                                   
/*0x002*/             UINT16       TagIndex;                                                  
/*0x004*/             ULONG32      Settable;                                                  
                  };                                                                          
/*0x000*/         UINT64       ZeroInit;                                                      
              };                                                                              
          }HEAP_ENTRY_EXTRA, *PHEAP_ENTRY_EXTRA;                                              
                                                                                              
          typedef struct _HEAP_FAILURE_INFORMATION     // 13 elements, 0xB8 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      Version;                                                        
/*0x004*/     ULONG32      StructureSize;                                                  
/*0x008*/     enum _HEAP_FAILURE_TYPE FailureType;                                         
/*0x00C*/     VOID*        HeapAddress;                                                    
/*0x010*/     VOID*        Address;                                                        
/*0x014*/     VOID*        Param1;                                                         
/*0x018*/     VOID*        Param2;                                                         
/*0x01C*/     VOID*        Param3;                                                         
/*0x020*/     struct _HEAP_ENTRY* PreviousBlock;                                           
/*0x024*/     struct _HEAP_ENTRY* NextBlock;                                               
/*0x028*/     struct _HEAP_ENTRY ExpectedEncodedEntry; // 19 elements, 0x8 bytes (sizeof)  
/*0x030*/     struct _HEAP_ENTRY ExpectedDecodedEntry; // 19 elements, 0x8 bytes (sizeof)  
/*0x038*/     VOID*        StackTrace[32];                                                 
          }HEAP_FAILURE_INFORMATION, *PHEAP_FAILURE_INFORMATION;                                    
                                                                                           
          typedef struct _HEAP_FREE_ENTRY                  // 20 elements, 0x10 bytes (sizeof) 
          {                                                                                    
              union                                        // 6 elements, 0x8 bytes (sizeof)   
              {                                                                                
                  struct                                   // 3 elements, 0x8 bytes (sizeof)   
                  {                                                                            
/*0x000*/             UINT16       Size;                                                       
/*0x002*/             UINT8        Flags;                                                      
/*0x003*/             UINT8        SmallTagIndex;                                              
/*0x004*/             UINT8        _PADDING0_[0x4];                                            
                  };                                                                           
                  struct                                   // 4 elements, 0x8 bytes (sizeof)   
                  {                                                                            
/*0x000*/             VOID*        SubSegmentCode;                                             
/*0x004*/             UINT16       PreviousSize;                                               
                      union                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                        
/*0x006*/                 UINT8        SegmentOffset;                                          
/*0x006*/                 UINT8        LFHFlags;                                               
                      };                                                                       
/*0x007*/             UINT8        UnusedBytes;                                                
                  };                                                                           
                  struct                                   // 2 elements, 0x8 bytes (sizeof)   
                  {                                                                            
/*0x000*/             UINT16       FunctionIndex;                                              
/*0x002*/             UINT16       ContextValue;                                               
/*0x004*/             UINT8        _PADDING1_[0x4];                                            
                  };                                                                           
                  struct                                   // 4 elements, 0x8 bytes (sizeof)   
                  {                                                                            
/*0x000*/             ULONG32      InterceptorValue;                                           
/*0x004*/             UINT16       UnusedBytesLength;                                          
/*0x006*/             UINT8        EntryOffset;                                                
/*0x007*/             UINT8        ExtendedBlockSignature;                                     
                  };                                                                           
                  struct                                   // 4 elements, 0x8 bytes (sizeof)   
                  {                                                                            
/*0x000*/             ULONG32      Code1;                                                      
/*0x004*/             UINT16       Code2;                                                      
/*0x006*/             UINT8        Code3;                                                      
/*0x007*/             UINT8        Code4;                                                      
                  };                                                                           
/*0x000*/         UINT64       AgregateCode;                                                   
              };                                                                               
/*0x008*/     struct _LIST_ENTRY FreeList;                 // 2 elements, 0x8 bytes (sizeof)   
          }HEAP_FREE_ENTRY, *PHEAP_FREE_ENTRY;                                                 
                                                                                               
          typedef struct _HEAP_LIST_LOOKUP              // 9 elements, 0x24 bytes (sizeof) 
          {                                                                                
/*0x000*/     struct _HEAP_LIST_LOOKUP* ExtendedLookup;                                    
/*0x004*/     ULONG32      ArraySize;                                                      
/*0x008*/     ULONG32      ExtraItem;                                                      
/*0x00C*/     ULONG32      ItemCount;                                                      
/*0x010*/     ULONG32      OutOfRangeItems;                                                
/*0x014*/     ULONG32      BaseIndex;                                                      
/*0x018*/     struct _LIST_ENTRY* ListHead;                                                
/*0x01C*/     ULONG32*     ListsInUseUlong;                                                
/*0x020*/     struct _LIST_ENTRY** ListHints;                                              
          }HEAP_LIST_LOOKUP, *PHEAP_LIST_LOOKUP;                                           
                                                                                           
          typedef struct _HEAP_LOCAL_SEGMENT_INFO        // 9 elements, 0x68 bytes (sizeof) 
          {                                                                                 
/*0x000*/     struct _HEAP_SUBSEGMENT* Hint;                                                
/*0x004*/     struct _HEAP_SUBSEGMENT* ActiveSubsegment;                                    
/*0x008*/     struct _HEAP_SUBSEGMENT* CachedItems[16];                                     
/*0x048*/     union _SLIST_HEADER SListHeader;           // 4 elements, 0x8 bytes (sizeof)  
/*0x050*/     union _HEAP_BUCKET_COUNTERS Counters;      // 3 elements, 0x8 bytes (sizeof)  
/*0x058*/     struct _HEAP_LOCAL_DATA* LocalData;                                           
/*0x05C*/     ULONG32      LastOpSequence;                                                  
/*0x060*/     UINT16       BucketIndex;                                                     
/*0x062*/     UINT16       LastUsed;                                                        
/*0x064*/     UINT8        _PADDING0_[0x4];                                                 
          }HEAP_LOCAL_SEGMENT_INFO, *PHEAP_LOCAL_SEGMENT_INFO;                                   
                                                                                            
          typedef struct _HEAP_LOCAL_DATA                       // 5 elements, 0x3418 bytes (sizeof) 
          {                                                                                          
/*0x000*/     union _SLIST_HEADER DeletedSubSegments;           // 4 elements, 0x8 bytes (sizeof)    
/*0x008*/     struct _LFH_BLOCK_ZONE* CrtZone;                                                       
/*0x00C*/     struct _LFH_HEAP* LowFragHeap;                                                         
/*0x010*/     ULONG32      Sequence;                                                                 
/*0x014*/     UINT8        _PADDING0_[0x4];                                                          
/*0x018*/     struct _HEAP_LOCAL_SEGMENT_INFO SegmentInfo[128];                                      
          }HEAP_LOCAL_DATA, *PHEAP_LOCAL_DATA;                                                       
                                                                                                     
          typedef struct _RTL_CRITICAL_SECTION               // 6 elements, 0x18 bytes (sizeof) 
          {                                                                                     
/*0x000*/     struct _RTL_CRITICAL_SECTION_DEBUG* DebugInfo;                                    
/*0x004*/     LONG32       LockCount;                                                           
/*0x008*/     LONG32       RecursionCount;                                                      
/*0x00C*/     VOID*        OwningThread;                                                        
/*0x010*/     VOID*        LockSemaphore;                                                       
/*0x014*/     ULONG32      SpinCount;                                                           
          }RTL_CRITICAL_SECTION, *PRTL_CRITICAL_SECTION;                                        
                                                                                                
          typedef struct _HEAP_LOCK                             // 1 elements, 0x18 bytes (sizeof) 
          {                                                                                        
              union                                             // 1 elements, 0x18 bytes (sizeof) 
              {                                                                                    
/*0x000*/         struct _RTL_CRITICAL_SECTION CriticalSection; // 6 elements, 0x18 bytes (sizeof) 
              }Lock;                                                                               
          }HEAP_LOCK, *PHEAP_LOCK;                                                                 
                                                                                                   
          typedef struct _HEAP_PSEUDO_TAG_ENTRY // 3 elements, 0xC bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      Allocs;                                                
/*0x004*/     ULONG32      Frees;                                                 
/*0x008*/     ULONG32      Size;                                                  
          }HEAP_PSEUDO_TAG_ENTRY, *PHEAP_PSEUDO_TAG_ENTRY;                                  
                                                                                  
          typedef struct _HEAP_SEGMENT                     // 14 elements, 0x40 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _HEAP_ENTRY Entry;                    // 19 elements, 0x8 bytes (sizeof)  
/*0x008*/     ULONG32      SegmentSignature;                                                   
/*0x00C*/     ULONG32      SegmentFlags;                                                       
/*0x010*/     struct _LIST_ENTRY SegmentListEntry;         // 2 elements, 0x8 bytes (sizeof)   
/*0x018*/     struct _HEAP* Heap;                                                              
/*0x01C*/     VOID*        BaseAddress;                                                        
/*0x020*/     ULONG32      NumberOfPages;                                                      
/*0x024*/     struct _HEAP_ENTRY* FirstEntry;                                                  
/*0x028*/     struct _HEAP_ENTRY* LastValidEntry;                                              
/*0x02C*/     ULONG32      NumberOfUnCommittedPages;                                           
/*0x030*/     ULONG32      NumberOfUnCommittedRanges;                                          
/*0x034*/     UINT16       SegmentAllocatorBackTraceIndex;                                     
/*0x036*/     UINT16       Reserved;                                                           
/*0x038*/     struct _LIST_ENTRY UCRSegmentList;           // 2 elements, 0x8 bytes (sizeof)   
          }HEAP_SEGMENT, *PHEAP_SEGMENT;                                                       
                                                                                               
          typedef struct _INTERLOCK_SEQ             // 5 elements, 0x8 bytes (sizeof) 
          {                                                                           
              union                                 // 3 elements, 0x8 bytes (sizeof) 
              {                                                                       
                  struct                            // 2 elements, 0x8 bytes (sizeof) 
                  {                                                                   
/*0x000*/             UINT16       Depth;                                             
/*0x002*/             UINT16       FreeEntryOffset;                                   
/*0x004*/             UINT8        _PADDING0_[0x4];                                   
                  };                                                                  
                  struct                            // 2 elements, 0x8 bytes (sizeof) 
                  {                                                                   
/*0x000*/             ULONG32      OffsetAndDepth;                                    
/*0x004*/             ULONG32      Sequence;                                          
                  };                                                                  
/*0x000*/         INT64        Exchg;                                                 
              };                                                                      
          }INTERLOCK_SEQ, *PINTERLOCK_SEQ;                                            
                                                                                      
          typedef struct _HEAP_SUBSEGMENT                 // 11 elements, 0x20 bytes (sizeof) 
          {                                                                                   
/*0x000*/     struct _HEAP_LOCAL_SEGMENT_INFO* LocalInfo;                                     
/*0x004*/     struct _HEAP_USERDATA_HEADER* UserBlocks;                                       
/*0x008*/     struct _INTERLOCK_SEQ AggregateExchg;       // 5 elements, 0x8 bytes (sizeof)   
              union                                       // 2 elements, 0x8 bytes (sizeof)   
              {                                                                               
                  struct                                  // 5 elements, 0x8 bytes (sizeof)   
                  {                                                                           
/*0x010*/             UINT16       BlockSize;                                                 
/*0x012*/             UINT16       Flags;                                                     
/*0x014*/             UINT16       BlockCount;                                                
/*0x016*/             UINT8        SizeIndex;                                                 
/*0x017*/             UINT8        AffinityIndex;                                             
                  };                                                                          
/*0x010*/         ULONG32      Alignment[2];                                                  
              };                                                                              
/*0x018*/     struct _SINGLE_LIST_ENTRY SFreeListEntry;   // 1 elements, 0x4 bytes (sizeof)   
/*0x01C*/     ULONG32      Lock;                                                              
          }HEAP_SUBSEGMENT, *PHEAP_SUBSEGMENT;                                                
                                                                                              
          typedef struct _HEAP_TAG_ENTRY          // 6 elements, 0x40 bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      Allocs;                                                   
/*0x004*/     ULONG32      Frees;                                                    
/*0x008*/     ULONG32      Size;                                                     
/*0x00C*/     UINT16       TagIndex;                                                 
/*0x00E*/     UINT16       CreatorBackTraceIndex;                                    
/*0x010*/     WCHAR        TagName[24];                                              
          }HEAP_TAG_ENTRY, *PHEAP_TAG_ENTRY;                                         
                                                                                     
          typedef struct _HEAP_UCR_DESCRIPTOR  // 4 elements, 0x18 bytes (sizeof) 
          {                                                                       
/*0x000*/     struct _LIST_ENTRY ListEntry;    // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _LIST_ENTRY SegmentEntry; // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/     VOID*        Address;                                               
/*0x014*/     ULONG32      Size;                                                  
          }HEAP_UCR_DESCRIPTOR, *PHEAP_UCR_DESCRIPTOR;                                   
                                                                                  
          typedef struct _HEAP_USERDATA_HEADER              // 5 elements, 0x10 bytes (sizeof) 
          {                                                                                    
              union                                         // 2 elements, 0x4 bytes (sizeof)  
              {                                                                                
/*0x000*/         struct _SINGLE_LIST_ENTRY SFreeListEntry; // 1 elements, 0x4 bytes (sizeof)  
/*0x000*/         struct _HEAP_SUBSEGMENT* SubSegment;                                         
              };                                                                               
/*0x004*/     VOID*        Reserved;                                                           
/*0x008*/     ULONG32      SizeIndex;                                                          
/*0x00C*/     ULONG32      Signature;                                                          
          }HEAP_USERDATA_HEADER, *PHEAP_USERDATA_HEADER;                                       
                                                                                               
          typedef struct _IMAGE_DATA_DIRECTORY // 2 elements, 0x8 bytes (sizeof) 
          {                                                                      
/*0x000*/     ULONG32      VirtualAddress;                                       
/*0x004*/     ULONG32      Size;                                                 
          }IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY;                                  
                                                                                 
          typedef struct _IMAGE_DOS_HEADER // 19 elements, 0x40 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT16       e_magic;                                            
/*0x002*/     UINT16       e_cblp;                                             
/*0x004*/     UINT16       e_cp;                                               
/*0x006*/     UINT16       e_crlc;                                             
/*0x008*/     UINT16       e_cparhdr;                                          
/*0x00A*/     UINT16       e_minalloc;                                         
/*0x00C*/     UINT16       e_maxalloc;                                         
/*0x00E*/     UINT16       e_ss;                                               
/*0x010*/     UINT16       e_sp;                                               
/*0x012*/     UINT16       e_csum;                                             
/*0x014*/     UINT16       e_ip;                                               
