// #################################################################################
// Generated by Symbol Type Viewer 32Bit/64Bit - Version 1.0.0.6 beta
// http://www.syseclabs.com
// Coding by Lionel d'Hauenens
// #################################################################################
// Image         : 64bit
// ImageName     : windows\X64\10.0.15063.0\ntoskrnl.exe
// LoadedPdbName : symbols\ntkrnlmp.pdb\D788F72ABE964EFCACAAD0276DAAE6CB1\ntkrnlmp.pdb

#ifdef __cplusplus
extern "C" {
#endif

//////////////////
//   C Define   //
//////////////////

#define VOID void
#define STDCALL __stdcall
#define FASTCALL __fastcall
#define CDECL __cdecl
#define THISCALL __thiscall
#define NEAR 
#define FAR 
//---------------------------------------------------------------------

//////////////////
// C Basic Type //
//////////////////

typedef signed char INT8;
typedef signed char CHAR;
typedef signed short INT16;
typedef signed int INT32;
typedef signed int BOOL;
typedef signed __int64 INT64;
typedef signed __int64 LONG64;
typedef signed long LONG32;
typedef unsigned char UINT8;
typedef unsigned char BYTE;
typedef unsigned short UINT16;
typedef unsigned short WCHAR;
typedef unsigned int UINT32;
typedef unsigned __int64 UINT64;
typedef unsigned __int64 ULONG64;
typedef unsigned long ULONG32;
typedef float FLOAT32;
typedef double FLOAT64;
typedef struct {unsigned short W[5];} FLOAT80;
typedef struct { __int64 LowPart;__int64 HighPart;} FLOAT128;
typedef double DATE;
typedef signed long HRESULT;
typedef union { struct {unsigned long Lo; long Hi;}; __int64 int64;} CURRENCY;
typedef wchar_t OLECHAR;
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Enum types

typedef enum _<unnamed-enum-KTMOH_CommitTransaction_Result>  // 2 elements, 0x4 bytes
{
    KTMOH_CommitTransaction_Result   = 1 /*0x1*/,
    KTMOH_RollbackTransaction_Result = 2 /*0x2*/
}<unnamed-enum-KTMOH_CommitTransaction_Result>, *P<unnamed-enum-KTMOH_CommitTransaction_Result>;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE  // 3 elements, 0x4 bytes
{
    StandardDesign  = 0 /*0x0*/,
    NEC98x86        = 1 /*0x1*/,
    EndAlternatives = 2 /*0x2*/
}ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef enum _ARBITER_ACTION  // 10 elements, 0x4 bytes
{
    ArbiterActionTestAllocation          = 0 /*0x0*/,
    ArbiterActionRetestAllocation        = 1 /*0x1*/,
    ArbiterActionCommitAllocation        = 2 /*0x2*/,
    ArbiterActionRollbackAllocation      = 3 /*0x3*/,
    ArbiterActionQueryAllocatedResources = 4 /*0x4*/,
    ArbiterActionWriteReservedResources  = 5 /*0x5*/,
    ArbiterActionQueryConflict           = 6 /*0x6*/,
    ArbiterActionQueryArbitrate          = 7 /*0x7*/,
    ArbiterActionAddReserved             = 8 /*0x8*/,
    ArbiterActionBootAllocation          = 9 /*0x9*/
}ARBITER_ACTION, *PARBITER_ACTION;

typedef enum _ARBITER_REQUEST_SOURCE  // 6 elements, 0x4 bytes
{
    ArbiterRequestUndefined      = -1 /*0xFF*/,
    ArbiterRequestLegacyReported = 0 /*0x0*/,
    ArbiterRequestHalReported    = 1 /*0x1*/,
    ArbiterRequestLegacyAssigned = 2 /*0x2*/,
    ArbiterRequestPnpDetected    = 3 /*0x3*/,
    ArbiterRequestPnpEnumerated  = 4 /*0x4*/
}ARBITER_REQUEST_SOURCE, *PARBITER_REQUEST_SOURCE;

typedef enum _ARBITER_RESULT  // 4 elements, 0x4 bytes
{
    ArbiterResultUndefined        = -1 /*0xFF*/,
    ArbiterResultSuccess          = 0 /*0x0*/,
    ArbiterResultExternalConflict = 1 /*0x1*/,
    ArbiterResultNullRequest      = 2 /*0x2*/
}ARBITER_RESULT, *PARBITER_RESULT;

typedef enum _BLOB_ID  // 11 elements, 0x4 bytes
{
    BLOB_TYPE_UNKNOWN          = 0 /*0x0*/,
    BLOB_TYPE_CONNECTION_INFO  = 1 /*0x1*/,
    BLOB_TYPE_MESSAGE          = 2 /*0x2*/,
    BLOB_TYPE_SECURITY_CONTEXT = 3 /*0x3*/,
    BLOB_TYPE_SECTION          = 4 /*0x4*/,
    BLOB_TYPE_REGION           = 5 /*0x5*/,
    BLOB_TYPE_VIEW             = 6 /*0x6*/,
    BLOB_TYPE_RESERVE          = 7 /*0x7*/,
    BLOB_TYPE_DIRECT_TRANSFER  = 8 /*0x8*/,
    BLOB_TYPE_HANDLE_DATA      = 9 /*0x9*/,
    BLOB_TYPE_MAX_ID           = 10 /*0xA*/
}BLOB_ID, *PBLOB_ID;

typedef enum _BUS_QUERY_ID_TYPE  // 6 elements, 0x4 bytes
{
    BusQueryDeviceID           = 0 /*0x0*/,
    BusQueryHardwareIDs        = 1 /*0x1*/,
    BusQueryCompatibleIDs      = 2 /*0x2*/,
    BusQueryInstanceID         = 3 /*0x3*/,
    BusQueryDeviceSerialNumber = 4 /*0x4*/,
    BusQueryContainerID        = 5 /*0x5*/
}BUS_QUERY_ID_TYPE, *PBUS_QUERY_ID_TYPE;

typedef enum _CM_DIRTY_VECTOR_OPERATION  // 3 elements, 0x4 bytes
{
    DirtyVectorModified   = 0 /*0x0*/,
    DirtyDataCaptureStart = 1 /*0x1*/,
    DirtyDataCaptureEnd   = 2 /*0x2*/
}CM_DIRTY_VECTOR_OPERATION, *PCM_DIRTY_VECTOR_OPERATION;

typedef enum _CM_LOAD_FAILURE_TYPE  // 24 elements, 0x4 bytes
{
    _None                               = 0 /*0x0*/,
    _CmInitializeHive                   = 1 /*0x1*/,
    _HvInitializeHive                   = 2 /*0x2*/,
    _HvpBuildMap                        = 3 /*0x3*/,
    _HvpBuildMapForLoaderHive           = 4 /*0x4*/,
    _HvpInitMap                         = 5 /*0x5*/,
    _HvLoadHive                         = 6 /*0x6*/,
    _HvpMapHiveImage                    = 7 /*0x7*/,
    _HvpRecoverData                     = 8 /*0x8*/,
    _CmpValidateHiveSecurityDescriptors = 9 /*0x9*/,
    _HvpEnlistBinInMap                  = 10 /*0xA*/,
    _CmCheckRegistry                    = 11 /*0xB*/,
    _CmRegistryIO                       = 12 /*0xC*/,
    _CmCheckRegistry2                   = 13 /*0xD*/,
    _CmpCheckKey                        = 14 /*0xE*/,
    _CmpCheckValueList                  = 15 /*0xF*/,
    _HvCheckHive                        = 16 /*0x10*/,
    _HvCheckBin                         = 17 /*0x11*/,
    _HvpGetLogEntryDirtyVector          = 18 /*0x12*/,
    _HvpReadLogEntryHeader              = 19 /*0x13*/,
    _HvpReadLogEntry                    = 20 /*0x14*/,
    _CmpMountPreloadedHives             = 21 /*0x15*/,
    _CmpLoadHiveThread                  = 22 /*0x16*/,
    _CmpCheckLeaf                       = 23 /*0x17*/
}CM_LOAD_FAILURE_TYPE, *PCM_LOAD_FAILURE_TYPE;

typedef enum _CM_SHARE_DISPOSITION  // 4 elements, 0x4 bytes
{
    CmResourceShareUndetermined    = 0 /*0x0*/,
    CmResourceShareDeviceExclusive = 1 /*0x1*/,
    CmResourceShareDriverExclusive = 2 /*0x2*/,
    CmResourceShareShared          = 3 /*0x3*/
}CM_SHARE_DISPOSITION, *PCM_SHARE_DISPOSITION;

typedef enum _CMP_FAILURE_INJECTION_POINT  // 18 elements, 0x4 bytes
{
    CmpFailurePointPoolAllocation       = 0 /*0x0*/,
    CmpFailurePointViewMapping          = 1 /*0x1*/,
    CmpFailurePointViewPinning          = 2 /*0x2*/,
    CmpFailurePointResourceCharging     = 3 /*0x3*/,
    CmpFailurePointFileWrite            = 4 /*0x4*/,
    CmpFailurePointFileRead             = 5 /*0x5*/,
    CmpFailurePointCacheFlush           = 6 /*0x6*/,
    CmpFailurePointFlush                = 7 /*0x7*/,
    CmpFailurePointFlushAndPurge        = 8 /*0x8*/,
    CmpFailurePointForceLargeBin        = 9 /*0x9*/,
    CmpFailurePointDontFixAlignment     = 10 /*0xA*/,
    CmpFailurePointAllocateCell         = 11 /*0xB*/,
    CmpFailurePointMarkDirty            = 12 /*0xC*/,
    CmpFailurePointAllocateKcb          = 13 /*0xD*/,
    CmpFailurePointCreateKeyBody        = 14 /*0xE*/,
    CmpFailurePointForcePoolAllocateKcb = 15 /*0xF*/,
    CmpFailurePointForceFreeKcb         = 16 /*0x10*/,
    CmpFailureInjectionPointCount       = 17 /*0x11*/
}CMP_FAILURE_INJECTION_POINT, *PCMP_FAILURE_INJECTION_POINT;

typedef enum _ConnectionResourceConsumerDesc  // 4 elements, 0x4 bytes
{
    ConnectionResourceConsumerDescIsUndefined = 0 /*0x0*/,
    ConnectionResourceConsumerDescIsDevice    = 1 /*0x1*/,
    ConnectionResourceConsumerDescIsOpregion  = 2 /*0x2*/,
    ConnectionResourceConsumerDescMax         = 3 /*0x3*/
}ConnectionResourceConsumerDesc, *PConnectionResourceConsumerDesc;

typedef enum _CREATE_FILE_TYPE  // 3 elements, 0x4 bytes
{
    CreateFileTypeNone      = 0 /*0x0*/,
    CreateFileTypeNamedPipe = 1 /*0x1*/,
    CreateFileTypeMailslot  = 2 /*0x2*/
}CREATE_FILE_TYPE, *PCREATE_FILE_TYPE;

typedef enum _DEVICE_POWER_STATE  // 6 elements, 0x4 bytes
{
    PowerDeviceUnspecified = 0 /*0x0*/,
    PowerDeviceD0          = 1 /*0x1*/,
    PowerDeviceD1          = 2 /*0x2*/,
    PowerDeviceD2          = 3 /*0x3*/,
    PowerDeviceD3          = 4 /*0x4*/,
    PowerDeviceMaximum     = 5 /*0x5*/
}DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_RELATION_TYPE  // 7 elements, 0x4 bytes
{
    BusRelations         = 0 /*0x0*/,
    EjectionRelations    = 1 /*0x1*/,
    PowerRelations       = 2 /*0x2*/,
    RemovalRelations     = 3 /*0x3*/,
    TargetDeviceRelation = 4 /*0x4*/,
    SingleBusRelations   = 5 /*0x5*/,
    TransportRelations   = 6 /*0x6*/
}DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _DEVICE_TEXT_TYPE  // 2 elements, 0x4 bytes
{
    DeviceTextDescription         = 0 /*0x0*/,
    DeviceTextLocationInformation = 1 /*0x1*/
}DEVICE_TEXT_TYPE, *PDEVICE_TEXT_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE  // 6 elements, 0x4 bytes
{
    DeviceUsageTypeUndefined   = 0 /*0x0*/,
    DeviceUsageTypePaging      = 1 /*0x1*/,
    DeviceUsageTypeHibernation = 2 /*0x2*/,
    DeviceUsageTypeDumpFile    = 3 /*0x3*/,
    DeviceUsageTypeBoot        = 4 /*0x4*/,
    DeviceUsageTypePostDisplay = 5 /*0x5*/
}DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum _DEVICE_WAKE_DEPTH  // 7 elements, 0x4 bytes
{
    DeviceWakeDepthNotWakeable = 0 /*0x0*/,
    DeviceWakeDepthD0          = 1 /*0x1*/,
    DeviceWakeDepthD1          = 2 /*0x2*/,
    DeviceWakeDepthD2          = 3 /*0x3*/,
    DeviceWakeDepthD3hot       = 4 /*0x4*/,
    DeviceWakeDepthD3cold      = 5 /*0x5*/,
    DeviceWakeDepthMaximum     = 6 /*0x6*/
}DEVICE_WAKE_DEPTH, *PDEVICE_WAKE_DEPTH;

typedef enum _DEVPROP_OPERATOR  // 42 elements, 0x4 bytes
{
    DEVPROP_OPERATOR_MODIFIER_NOT                         = 65536 /*0x10000*/,
    DEVPROP_OPERATOR_MODIFIER_IGNORE_CASE                 = 131072 /*0x20000*/,
    DEVPROP_OPERATOR_NONE                                 = 0 /*0x0*/,
    DEVPROP_OPERATOR_EXISTS                               = 1 /*0x1*/,
    DEVPROP_OPERATOR_NOT_EXISTS                           = 65537 /*0x10001*/,
    DEVPROP_OPERATOR_EQUALS                               = 2 /*0x2*/,
    DEVPROP_OPERATOR_NOT_EQUALS                           = 65538 /*0x10002*/,
    DEVPROP_OPERATOR_GREATER_THAN                         = 3 /*0x3*/,
    DEVPROP_OPERATOR_LESS_THAN                            = 4 /*0x4*/,
    DEVPROP_OPERATOR_GREATER_THAN_EQUALS                  = 5 /*0x5*/,
    DEVPROP_OPERATOR_LESS_THAN_EQUALS                     = 6 /*0x6*/,
    DEVPROP_OPERATOR_EQUALS_IGNORE_CASE                   = 131074 /*0x20002*/,
    DEVPROP_OPERATOR_NOT_EQUALS_IGNORE_CASE               = 196610 /*0x30002*/,
    DEVPROP_OPERATOR_BITWISE_AND                          = 7 /*0x7*/,
    DEVPROP_OPERATOR_BITWISE_OR                           = 8 /*0x8*/,
    DEVPROP_OPERATOR_BEGINS_WITH                          = 9 /*0x9*/,
    DEVPROP_OPERATOR_ENDS_WITH                            = 10 /*0xA*/,
    DEVPROP_OPERATOR_CONTAINS                             = 11 /*0xB*/,
    DEVPROP_OPERATOR_BEGINS_WITH_IGNORE_CASE              = 131081 /*0x20009*/,
    DEVPROP_OPERATOR_ENDS_WITH_IGNORE_CASE                = 131082 /*0x2000A*/,
    DEVPROP_OPERATOR_CONTAINS_IGNORE_CASE                 = 131083 /*0x2000B*/,
    DEVPROP_OPERATOR_LIST_CONTAINS                        = 4096 /*0x1000*/,
    DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH             = 8192 /*0x2000*/,
    DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH               = 12288 /*0x3000*/,
    DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS                = 16384 /*0x4000*/,
    DEVPROP_OPERATOR_LIST_CONTAINS_IGNORE_CASE            = 135168 /*0x21000*/,
    DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH_IGNORE_CASE = 139264 /*0x22000*/,
    DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH_IGNORE_CASE   = 143360 /*0x23000*/,
    DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS_IGNORE_CASE    = 147456 /*0x24000*/,
    DEVPROP_OPERATOR_AND_OPEN                             = 1048576 /*0x100000*/,
    DEVPROP_OPERATOR_AND_CLOSE                            = 2097152 /*0x200000*/,
    DEVPROP_OPERATOR_OR_OPEN                              = 3145728 /*0x300000*/,
    DEVPROP_OPERATOR_OR_CLOSE                             = 4194304 /*0x400000*/,
    DEVPROP_OPERATOR_NOT_OPEN                             = 5242880 /*0x500000*/,
    DEVPROP_OPERATOR_NOT_CLOSE                            = 6291456 /*0x600000*/,
    DEVPROP_OPERATOR_ARRAY_CONTAINS                       = 268435456 /*0x10000000*/,
    DEVPROP_OPERATOR_MASK_EVAL                            = 4095 /*0xFFF*/,
    DEVPROP_OPERATOR_MASK_LIST                            = 61440 /*0xF000*/,
    DEVPROP_OPERATOR_MASK_MODIFIER                        = 983040 /*0xF0000*/,
    DEVPROP_OPERATOR_MASK_NOT_LOGICAL                     = -267386881 /*0xF00FFFFF*/,
    DEVPROP_OPERATOR_MASK_LOGICAL                         = 267386880 /*0xFF00000*/,
    DEVPROP_OPERATOR_MASK_ARRAY                           = -268435456 /*0xF0000000*/
}DEVPROP_OPERATOR, *PDEVPROP_OPERATOR;

typedef enum _DMA_SPEED  // 6 elements, 0x4 bytes
{
    Compatible      = 0 /*0x0*/,
    TypeA           = 1 /*0x1*/,
    TypeB           = 2 /*0x2*/,
    TypeC           = 3 /*0x3*/,
    TypeF           = 4 /*0x4*/,
    MaximumDmaSpeed = 5 /*0x5*/
}DMA_SPEED, *PDMA_SPEED;

typedef enum _DMA_WIDTH  // 6 elements, 0x4 bytes
{
    Width8Bits      = 0 /*0x0*/,
    Width16Bits     = 1 /*0x1*/,
    Width32Bits     = 2 /*0x2*/,
    Width64Bits     = 3 /*0x3*/,
    WidthNoWrap     = 4 /*0x4*/,
    MaximumDmaWidth = 5 /*0x5*/
}DMA_WIDTH, *PDMA_WIDTH;

typedef enum _DUMP_EVENTS  // 3 elements, 0x4 bytes
{
    DUMP_EVENT_NONE             = 0 /*0x0*/,
    DUMP_EVENT_HIBER_RESUME     = 1 /*0x1*/,
    DUMP_EVENT_HIBER_RESUME_END = 2 /*0x2*/
}DUMP_EVENTS, *PDUMP_EVENTS;

typedef enum _ETW_BUFFER_STATE  // 8 elements, 0x4 bytes
{
    EtwBufferStateFree               = 0 /*0x0*/,
    EtwBufferStateGeneralLogging     = 1 /*0x1*/,
    EtwBufferStateCSwitch            = 2 /*0x2*/,
    EtwBufferStateFlush              = 3 /*0x3*/,
    EtwBufferStatePendingCompression = 4 /*0x4*/,
    EtwBufferStateCompressed         = 5 /*0x5*/,
    EtwBufferStatePlaceholder        = 6 /*0x6*/,
    EtwBufferStateMaximum            = 7 /*0x7*/
}ETW_BUFFER_STATE, *PETW_BUFFER_STATE;

typedef enum _ETW_COMPRESSION_RESUMPTION_MODE  // 3 elements, 0x4 bytes
{
    EtwCompressionModeRestart   = 0 /*0x0*/,
    EtwCompressionModeNoDisable = 1 /*0x1*/,
    EtwCompressionModeNoRestart = 2 /*0x2*/
}ETW_COMPRESSION_RESUMPTION_MODE, *PETW_COMPRESSION_RESUMPTION_MODE;

typedef enum _ETW_GUID_TYPE  // 4 elements, 0x4 bytes
{
    EtwTraceGuidType        = 0 /*0x0*/,
    EtwNotificationGuidType = 1 /*0x1*/,
    EtwGroupGuidType        = 2 /*0x2*/,
    EtwGuidTypeMax          = 3 /*0x3*/
}ETW_GUID_TYPE, *PETW_GUID_TYPE;

typedef enum _ETW_HEADER_TYPE  // 3 elements, 0x4 bytes
{
    EtwHeaderTypeNative = 0 /*0x0*/,
    EtwHeaderTypeWow    = 1 /*0x1*/,
    EtwHeaderTypeMax    = 2 /*0x2*/
}ETW_HEADER_TYPE, *PETW_HEADER_TYPE;

typedef enum _ETW_NOTIFICATION_TYPE  // 12 elements, 0x4 bytes
{
    EtwNotificationTypeNoReply               = 1 /*0x1*/,
    EtwNotificationTypeLegacyEnable          = 2 /*0x2*/,
    EtwNotificationTypeEnable                = 3 /*0x3*/,
    EtwNotificationTypePrivateLogger         = 4 /*0x4*/,
    EtwNotificationTypePerflib               = 5 /*0x5*/,
    EtwNotificationTypeAudio                 = 6 /*0x6*/,
    EtwNotificationTypeSession               = 7 /*0x7*/,
    EtwNotificationTypeReserved              = 8 /*0x8*/,
    EtwNotificationTypeCredentialUI          = 9 /*0x9*/,
    EtwNotificationTypeInProcSession         = 10 /*0xA*/,
    EtwNotificationTypeFilteredPrivateLogger = 11 /*0xB*/,
    EtwNotificationTypeMax                   = 12 /*0xC*/
}ETW_NOTIFICATION_TYPE, *PETW_NOTIFICATION_TYPE;

typedef enum _ETW_PERFECT_HASH_FUNCTION_TYPE  // 3 elements, 0x4 bytes
{
    ETW_PHF_EVENT_ID   = 0 /*0x0*/,
    ETW_PHF_STACK_WALK = 1 /*0x1*/,
    ETW_PHF_MAX_COUNT  = 2 /*0x2*/
}ETW_PERFECT_HASH_FUNCTION_TYPE, *PETW_PERFECT_HASH_FUNCTION_TYPE;

typedef enum _ETW_PERIODIC_TIMER_STATE  // 2 elements, 0x4 bytes
{
    EtwpPeriodicTimerUnset = 0 /*0x0*/,
    EtwpPeriodicTimerSet   = 1 /*0x1*/
}ETW_PERIODIC_TIMER_STATE, *PETW_PERIODIC_TIMER_STATE;

typedef enum _ETW_RT_EVENT_LOSS  // 5 elements, 0x4 bytes
{
    EtwRtEventNoLoss  = 0 /*0x0*/,
    EtwRtEventLost    = 1 /*0x1*/,
    EtwRtBufferLost   = 2 /*0x2*/,
    EtwRtBackupLost   = 3 /*0x3*/,
    EtwRtEventLossMax = 4 /*0x4*/
}ETW_RT_EVENT_LOSS, *PETW_RT_EVENT_LOSS;

typedef enum _ETW_STRING_TOKEN_TYPE  // 4 elements, 0x4 bytes
{
    ETW_STRING_TOKEN_EXE        = 0 /*0x0*/,
    ETW_STRING_TOKEN_PACKAGE_ID = 1 /*0x1*/,
    ETW_STRING_TOKEN_PKG_APP_ID = 2 /*0x2*/,
    ETW_STRING_TOKEN_MAX_COUNT  = 3 /*0x3*/
}ETW_STRING_TOKEN_TYPE, *PETW_STRING_TOKEN_TYPE;

typedef enum _EVENT_INFO_CLASS  // 5 elements, 0x4 bytes
{
    EventProviderBinaryTrackInfo      = 0 /*0x0*/,
    EventProviderSetEnableAllKeywords = 1 /*0x1*/,
    EventProviderSetTraits            = 2 /*0x2*/,
    EventProviderUseDescriptorType    = 3 /*0x3*/,
    MaxEventInfo                      = 4 /*0x4*/
}EVENT_INFO_CLASS, *PEVENT_INFO_CLASS;

typedef enum _EVENT_TYPE  // 2 elements, 0x4 bytes
{
    NotificationEvent    = 0 /*0x0*/,
    SynchronizationEvent = 1 /*0x1*/
}EVENT_TYPE, *PEVENT_TYPE;

typedef enum _EX_BALANCE_OBJECT  // 4 elements, 0x4 bytes
{
    ExTimerExpiration       = 0 /*0x0*/,
    ExThreadSetManagerEvent = 1 /*0x1*/,
    ExThreadReaperEvent     = 2 /*0x2*/,
    ExMaximumBalanceObject  = 3 /*0x3*/
}EX_BALANCE_OBJECT, *PEX_BALANCE_OBJECT;

typedef enum _EX_GEN_RANDOM_DOMAIN  // 4 elements, 0x4 bytes
{
    ExGenRandomDomainKernel      = 0 /*0x0*/,
    ExGenRandomDomainFirst       = 0 /*0x0*/,
    ExGenRandomDomainUserVisible = 1 /*0x1*/,
    ExGenRandomDomainMax         = 2 /*0x2*/
}EX_GEN_RANDOM_DOMAIN, *PEX_GEN_RANDOM_DOMAIN;

typedef enum _EX_POOL_PRIORITY  // 9 elements, 0x4 bytes
{
    LowPoolPriority                       = 0 /*0x0*/,
    LowPoolPrioritySpecialPoolOverrun     = 8 /*0x8*/,
    LowPoolPrioritySpecialPoolUnderrun    = 9 /*0x9*/,
    NormalPoolPriority                    = 16 /*0x10*/,
    NormalPoolPrioritySpecialPoolOverrun  = 24 /*0x18*/,
    NormalPoolPrioritySpecialPoolUnderrun = 25 /*0x19*/,
    HighPoolPriority                      = 32 /*0x20*/,
    HighPoolPrioritySpecialPoolOverrun    = 40 /*0x28*/,
    HighPoolPrioritySpecialPoolUnderrun   = 41 /*0x29*/
}EX_POOL_PRIORITY, *PEX_POOL_PRIORITY;

typedef enum _EXCEPTION_DISPOSITION  // 4 elements, 0x4 bytes
{
    ExceptionContinueExecution = 0 /*0x0*/,
    ExceptionContinueSearch    = 1 /*0x1*/,
    ExceptionNestedException   = 2 /*0x2*/,
    ExceptionCollidedUnwind    = 3 /*0x3*/
}EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _EXQUEUEINDEX  // 4 elements, 0x4 bytes
{
    ExPoolUntrusted = 0 /*0x0*/,
    IoPoolUntrusted = 1 /*0x1*/,
    ExPoolTrusted   = 2 /*0x2*/,
    ExPoolMax       = 8 /*0x8*/
}EXQUEUEINDEX, *PEXQUEUEINDEX;

typedef enum _FILE_INFORMATION_CLASS  // 69 elements, 0x4 bytes
{
    FileDirectoryInformation                 = 1 /*0x1*/,
    FileFullDirectoryInformation             = 2 /*0x2*/,
    FileBothDirectoryInformation             = 3 /*0x3*/,
    FileBasicInformation                     = 4 /*0x4*/,
    FileStandardInformation                  = 5 /*0x5*/,
    FileInternalInformation                  = 6 /*0x6*/,
    FileEaInformation                        = 7 /*0x7*/,
    FileAccessInformation                    = 8 /*0x8*/,
    FileNameInformation                      = 9 /*0x9*/,
    FileRenameInformation                    = 10 /*0xA*/,
    FileLinkInformation                      = 11 /*0xB*/,
    FileNamesInformation                     = 12 /*0xC*/,
    FileDispositionInformation               = 13 /*0xD*/,
    FilePositionInformation                  = 14 /*0xE*/,
    FileFullEaInformation                    = 15 /*0xF*/,
    FileModeInformation                      = 16 /*0x10*/,
    FileAlignmentInformation                 = 17 /*0x11*/,
    FileAllInformation                       = 18 /*0x12*/,
    FileAllocationInformation                = 19 /*0x13*/,
    FileEndOfFileInformation                 = 20 /*0x14*/,
    FileAlternateNameInformation             = 21 /*0x15*/,
    FileStreamInformation                    = 22 /*0x16*/,
    FilePipeInformation                      = 23 /*0x17*/,
    FilePipeLocalInformation                 = 24 /*0x18*/,
    FilePipeRemoteInformation                = 25 /*0x19*/,
    FileMailslotQueryInformation             = 26 /*0x1A*/,
    FileMailslotSetInformation               = 27 /*0x1B*/,
    FileCompressionInformation               = 28 /*0x1C*/,
    FileObjectIdInformation                  = 29 /*0x1D*/,
    FileCompletionInformation                = 30 /*0x1E*/,
    FileMoveClusterInformation               = 31 /*0x1F*/,
    FileQuotaInformation                     = 32 /*0x20*/,
    FileReparsePointInformation              = 33 /*0x21*/,
    FileNetworkOpenInformation               = 34 /*0x22*/,
    FileAttributeTagInformation              = 35 /*0x23*/,
    FileTrackingInformation                  = 36 /*0x24*/,
    FileIdBothDirectoryInformation           = 37 /*0x25*/,
    FileIdFullDirectoryInformation           = 38 /*0x26*/,
    FileValidDataLengthInformation           = 39 /*0x27*/,
    FileShortNameInformation                 = 40 /*0x28*/,
    FileIoCompletionNotificationInformation  = 41 /*0x29*/,
    FileIoStatusBlockRangeInformation        = 42 /*0x2A*/,
    FileIoPriorityHintInformation            = 43 /*0x2B*/,
    FileSfioReserveInformation               = 44 /*0x2C*/,
    FileSfioVolumeInformation                = 45 /*0x2D*/,
    FileHardLinkInformation                  = 46 /*0x2E*/,
    FileProcessIdsUsingFileInformation       = 47 /*0x2F*/,
    FileNormalizedNameInformation            = 48 /*0x30*/,
    FileNetworkPhysicalNameInformation       = 49 /*0x31*/,
    FileIdGlobalTxDirectoryInformation       = 50 /*0x32*/,
    FileIsRemoteDeviceInformation            = 51 /*0x33*/,
    FileUnusedInformation                    = 52 /*0x34*/,
    FileNumaNodeInformation                  = 53 /*0x35*/,
    FileStandardLinkInformation              = 54 /*0x36*/,
    FileRemoteProtocolInformation            = 55 /*0x37*/,
    FileRenameInformationBypassAccessCheck   = 56 /*0x38*/,
    FileLinkInformationBypassAccessCheck     = 57 /*0x39*/,
    FileVolumeNameInformation                = 58 /*0x3A*/,
    FileIdInformation                        = 59 /*0x3B*/,
    FileIdExtdDirectoryInformation           = 60 /*0x3C*/,
    FileReplaceCompletionInformation         = 61 /*0x3D*/,
    FileHardLinkFullIdInformation            = 62 /*0x3E*/,
    FileIdExtdBothDirectoryInformation       = 63 /*0x3F*/,
    FileDispositionInformationEx             = 64 /*0x40*/,
    FileRenameInformationEx                  = 65 /*0x41*/,
    FileRenameInformationExBypassAccessCheck = 66 /*0x42*/,
    FileDesiredStorageClassInformation       = 67 /*0x43*/,
    FileStatInformation                      = 68 /*0x44*/,
    FileMaximumInformation                   = 69 /*0x45*/
}FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FILE_OBJECT_EXTENSION_TYPE  // 9 elements, 0x4 bytes
{
    FoExtTypeTransactionParams = 0 /*0x0*/,
    FoExtTypeInternal          = 1 /*0x1*/,
    FoExtTypeIosbRange         = 2 /*0x2*/,
    FoExtTypeGeneric           = 3 /*0x3*/,
    FoExtTypeSfio              = 4 /*0x4*/,
    FoExtTypeSymlink           = 5 /*0x5*/,
    FoExtTypeOplockKey         = 6 /*0x6*/,
    FoExtTypeSilo              = 7 /*0x7*/,
    MaxFoExtTypes              = 8 /*0x8*/
}FILE_OBJECT_EXTENSION_TYPE, *PFILE_OBJECT_EXTENSION_TYPE;

typedef enum _FS_FILTER_SECTION_SYNC_TYPE  // 2 elements, 0x4 bytes
{
    SyncTypeOther         = 0 /*0x0*/,
    SyncTypeCreateSection = 1 /*0x1*/
}FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

typedef enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE  // 2 elements, 0x4 bytes
{
    NotifyTypeCreate  = 0 /*0x0*/,
    NotifyTypeRetired = 1 /*0x1*/
}FS_FILTER_STREAM_FO_NOTIFICATION_TYPE, *PFS_FILTER_STREAM_FO_NOTIFICATION_TYPE;

typedef enum _FSINFOCLASS  // 14 elements, 0x4 bytes
{
    FileFsVolumeInformation       = 1 /*0x1*/,
    FileFsLabelInformation        = 2 /*0x2*/,
    FileFsSizeInformation         = 3 /*0x3*/,
    FileFsDeviceInformation       = 4 /*0x4*/,
    FileFsAttributeInformation    = 5 /*0x5*/,
    FileFsControlInformation      = 6 /*0x6*/,
    FileFsFullSizeInformation     = 7 /*0x7*/,
    FileFsObjectIdInformation     = 8 /*0x8*/,
    FileFsDriverPathInformation   = 9 /*0x9*/,
    FileFsVolumeFlagsInformation  = 10 /*0xA*/,
    FileFsSectorSizeInformation   = 11 /*0xB*/,
    FileFsDataCopyInformation     = 12 /*0xC*/,
    FileFsMetadataSizeInformation = 13 /*0xD*/,
    FileFsMaximumInformation      = 14 /*0xE*/
}FSINFOCLASS, *PFSINFOCLASS;

typedef enum _FUNCTION_TABLE_TYPE  // 4 elements, 0x4 bytes
{
    RF_SORTED         = 0 /*0x0*/,
    RF_UNSORTED       = 1 /*0x1*/,
    RF_CALLBACK       = 2 /*0x2*/,
    RF_KERNEL_DYNAMIC = 3 /*0x3*/
}FUNCTION_TABLE_TYPE, *PFUNCTION_TABLE_TYPE;

typedef enum _GPIO_PIN_CONFIG_TYPE  // 4 elements, 0x4 bytes
{
    PullDefault = 0 /*0x0*/,
    PullUp      = 1 /*0x1*/,
    PullDown    = 2 /*0x2*/,
    PullNone    = 3 /*0x3*/
}GPIO_PIN_CONFIG_TYPE, *PGPIO_PIN_CONFIG_TYPE;

typedef enum _GPIO_PIN_IORESTRICTION_TYPE  // 4 elements, 0x4 bytes
{
    IoRestrictionNone            = 0 /*0x0*/,
    IoRestrictionInputOnly       = 1 /*0x1*/,
    IoRestrictionOutputOnly      = 2 /*0x2*/,
    IoRestrictionNoneAndPreserve = 3 /*0x3*/
}GPIO_PIN_IORESTRICTION_TYPE, *PGPIO_PIN_IORESTRICTION_TYPE;

typedef enum _HAL_APIC_DESTINATION_MODE  // 4 elements, 0x4 bytes
{
    ApicDestinationModePhysical         = 1 /*0x1*/,
    ApicDestinationModeLogicalFlat      = 2 /*0x2*/,
    ApicDestinationModeLogicalClustered = 3 /*0x3*/,
    ApicDestinationModeUnknown          = 4 /*0x4*/
}HAL_APIC_DESTINATION_MODE, *PHAL_APIC_DESTINATION_MODE;

typedef enum _HARDWARE_COUNTER_TYPE  // 2 elements, 0x4 bytes
{
    PMCCounter             = 0 /*0x0*/,
    MaxHardwareCounterType = 1 /*0x1*/
}HARDWARE_COUNTER_TYPE, *PHARDWARE_COUNTER_TYPE;

typedef enum _HEAP_FAILURE_TYPE  // 19 elements, 0x4 bytes
{
    heap_failure_internal                      = 0 /*0x0*/,
    heap_failure_unknown                       = 1 /*0x1*/,
    heap_failure_generic                       = 2 /*0x2*/,
    heap_failure_entry_corruption              = 3 /*0x3*/,
    heap_failure_multiple_entries_corruption   = 4 /*0x4*/,
    heap_failure_virtual_block_corruption      = 5 /*0x5*/,
    heap_failure_buffer_overrun                = 6 /*0x6*/,
    heap_failure_buffer_underrun               = 7 /*0x7*/,
    heap_failure_block_not_busy                = 8 /*0x8*/,
    heap_failure_invalid_argument              = 9 /*0x9*/,
    heap_failure_usage_after_free              = 10 /*0xA*/,
    heap_failure_cross_heap_operation          = 11 /*0xB*/,
    heap_failure_freelists_corruption          = 12 /*0xC*/,
    heap_failure_listentry_corruption          = 13 /*0xD*/,
    heap_failure_lfh_bitmap_mismatch           = 14 /*0xE*/,
    heap_failure_segment_lfh_bitmap_corruption = 15 /*0xF*/,
    heap_failure_segment_lfh_double_free       = 16 /*0x10*/,
    heap_failure_vs_subsegment_corruption      = 17 /*0x11*/,
    heap_failure_null_heap                     = 18 /*0x12*/
}HEAP_FAILURE_TYPE, *PHEAP_FAILURE_TYPE;

typedef enum _HSTORAGE_TYPE  // 3 elements, 0x4 bytes
{
    Stable         = 0 /*0x0*/,
    Volatile       = 1 /*0x1*/,
    InvalidStorage = 2 /*0x2*/
}HSTORAGE_TYPE, *PHSTORAGE_TYPE;

typedef enum _INTERFACE_TYPE  // 20 elements, 0x4 bytes
{
    InterfaceTypeUndefined = -1 /*0xFF*/,
    Internal               = 0 /*0x0*/,
    Isa                    = 1 /*0x1*/,
    Eisa                   = 2 /*0x2*/,
    MicroChannel           = 3 /*0x3*/,
    TurboChannel           = 4 /*0x4*/,
    PCIBus                 = 5 /*0x5*/,
    VMEBus                 = 6 /*0x6*/,
    NuBus                  = 7 /*0x7*/,
    PCMCIABus              = 8 /*0x8*/,
    CBus                   = 9 /*0x9*/,
    MPIBus                 = 10 /*0xA*/,
    MPSABus                = 11 /*0xB*/,
    ProcessorInternal      = 12 /*0xC*/,
    InternalPowerBus       = 13 /*0xD*/,
    PNPISABus              = 14 /*0xE*/,
    PNPBus                 = 15 /*0xF*/,
    Vmcs                   = 16 /*0x10*/,
    ACPIBus                = 17 /*0x11*/,
    MaximumInterfaceType   = 18 /*0x12*/
}INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _INTERLOCKED_RESULT  // 3 elements, 0x4 bytes
{
    ResultNegative = 1 /*0x1*/,
    ResultZero     = 0 /*0x0*/,
    ResultPositive = 2 /*0x2*/
}INTERLOCKED_RESULT, *PINTERLOCKED_RESULT;

typedef enum _INTERRUPT_CONNECTION_TYPE  // 4 elements, 0x4 bytes
{
    InterruptTypeControllerInput = 0 /*0x0*/,
    InterruptTypeXapicMessage    = 1 /*0x1*/,
    InterruptTypeHypertransport  = 2 /*0x2*/,
    InterruptTypeMessageRequest  = 3 /*0x3*/
}INTERRUPT_CONNECTION_TYPE, *PINTERRUPT_CONNECTION_TYPE;

typedef enum _IO_ALLOCATION_ACTION  // 3 elements, 0x4 bytes
{
    KeepObject                    = 1 /*0x1*/,
    DeallocateObject              = 2 /*0x2*/,
    DeallocateObjectKeepRegisters = 3 /*0x3*/
}IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _IO_PRIORITY_HINT  // 6 elements, 0x4 bytes
{
    IoPriorityVeryLow  = 0 /*0x0*/,
    IoPriorityLow      = 1 /*0x1*/,
    IoPriorityNormal   = 2 /*0x2*/,
    IoPriorityHigh     = 3 /*0x3*/,
    IoPriorityCritical = 4 /*0x4*/,
    MaxIoPriorityTypes = 5 /*0x5*/
}IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

typedef enum _IO_RATE_CONTROL_TYPE  // 26 elements, 0x4 bytes
{
    IoRateControlTypeCapMin                         = 0 /*0x0*/,
    IoRateControlTypeIopsCap                        = 0 /*0x0*/,
    IoRateControlTypeBandwidthCap                   = 1 /*0x1*/,
    IoRateControlTypeTimePercentCap                 = 2 /*0x2*/,
    IoRateControlTypeCapMax                         = 2 /*0x2*/,
    IoRateControlTypeReservationMin                 = 3 /*0x3*/,
    IoRateControlTypeIopsReservation                = 3 /*0x3*/,
    IoRateControlTypeBandwidthReservation           = 4 /*0x4*/,
    IoRateControlTypeTimePercentReservation         = 5 /*0x5*/,
    IoRateControlTypeReservationMax                 = 5 /*0x5*/,
    IoRateControlTypeCriticalReservationMin         = 6 /*0x6*/,
    IoRateControlTypeIopsCriticalReservation        = 6 /*0x6*/,
    IoRateControlTypeBandwidthCriticalReservation   = 7 /*0x7*/,
    IoRateControlTypeTimePercentCriticalReservation = 8 /*0x8*/,
    IoRateControlTypeCriticalReservationMax         = 8 /*0x8*/,
    IoRateControlTypeSoftCapMin                     = 9 /*0x9*/,
    IoRateControlTypeIopsSoftCap                    = 9 /*0x9*/,
    IoRateControlTypeBandwidthSoftCap               = 10 /*0xA*/,
    IoRateControlTypeTimePercentSoftCap             = 11 /*0xB*/,
    IoRateControlTypeSoftCapMax                     = 11 /*0xB*/,
    IoRateControlTypeLimitExcessNotifyMin           = 12 /*0xC*/,
    IoRateControlTypeIopsLimitExcessNotify          = 12 /*0xC*/,
    IoRateControlTypeBandwidthLimitExcessNotify     = 13 /*0xD*/,
    IoRateControlTypeTimePercentLimitExcessNotify   = 14 /*0xE*/,
    IoRateControlTypeLimitExcessNotifyMax           = 14 /*0xE*/,
    IoRateControlTypeMax                            = 15 /*0xF*/
}IO_RATE_CONTROL_TYPE, *PIO_RATE_CONTROL_TYPE;

typedef enum _IO_SESSION_STATE  // 9 elements, 0x4 bytes
{
    IoSessionStateCreated              = 1 /*0x1*/,
    IoSessionStateInitialized          = 2 /*0x2*/,
    IoSessionStateConnected            = 3 /*0x3*/,
    IoSessionStateDisconnected         = 4 /*0x4*/,
    IoSessionStateDisconnectedLoggedOn = 5 /*0x5*/,
    IoSessionStateLoggedOn             = 6 /*0x6*/,
    IoSessionStateLoggedOff            = 7 /*0x7*/,
    IoSessionStateTerminated           = 8 /*0x8*/,
    IoSessionStateMax                  = 9 /*0x9*/
}IO_SESSION_STATE, *PIO_SESSION_STATE;

typedef enum _IOP_PRIORITY_HINT  // 7 elements, 0x4 bytes
{
    IopIoPriorityNotSet   = 0 /*0x0*/,
    IopIoPriorityVeryLow  = 1 /*0x1*/,
    IopIoPriorityLow      = 2 /*0x2*/,
    IopIoPriorityNormal   = 3 /*0x3*/,
    IopIoPriorityHigh     = 4 /*0x4*/,
    IopIoPriorityCritical = 5 /*0x5*/,
    MaxIopIoPriorityTypes = 6 /*0x6*/
}IOP_PRIORITY_HINT, *PIOP_PRIORITY_HINT;

typedef enum _IRPLOCK  // 4 elements, 0x4 bytes
{
    IRPLOCK_CANCELABLE      = 0 /*0x0*/,
    IRPLOCK_CANCEL_STARTED  = 1 /*0x1*/,
    IRPLOCK_CANCEL_COMPLETE = 2 /*0x2*/,
    IRPLOCK_COMPLETED       = 3 /*0x3*/
}IRPLOCK, *PIRPLOCK;

typedef enum _IRQ_PRIORITY  // 4 elements, 0x4 bytes
{
    IrqPriorityUndefined = 0 /*0x0*/,
    IrqPriorityLow       = 1 /*0x1*/,
    IrqPriorityNormal    = 2 /*0x2*/,
    IrqPriorityHigh      = 3 /*0x3*/
}IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef enum _JOB_OBJECT_IO_RATE_CONTROL_FLAGS  // 3 elements, 0x4 bytes
{
    JOB_OBJECT_IO_RATE_CONTROL_ENABLE            = 1 /*0x1*/,
    JOB_OBJECT_IO_RATE_CONTROL_STANDALONE_VOLUME = 2 /*0x2*/,
    JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS       = 3 /*0x3*/
}JOB_OBJECT_IO_RATE_CONTROL_FLAGS, *PJOB_OBJECT_IO_RATE_CONTROL_FLAGS;

typedef enum _JOB_OBJECT_NET_RATE_CONTROL_FLAGS  // 4 elements, 0x4 bytes
{
    JOB_OBJECT_NET_RATE_CONTROL_ENABLE        = 1 /*0x1*/,
    JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2 /*0x2*/,
    JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG      = 4 /*0x4*/,
    JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS   = 7 /*0x7*/
}JOB_OBJECT_NET_RATE_CONTROL_FLAGS, *PJOB_OBJECT_NET_RATE_CONTROL_FLAGS;

typedef enum _JOBOBJECTINFOCLASS  // 73 elements, 0x4 bytes
{
    JobObjectBasicAccountingInformation         = 1 /*0x1*/,
    JobObjectBasicLimitInformation              = 2 /*0x2*/,
    JobObjectBasicProcessIdList                 = 3 /*0x3*/,
    JobObjectBasicUIRestrictions                = 4 /*0x4*/,
    JobObjectSecurityLimitInformation           = 5 /*0x5*/,
    JobObjectEndOfJobTimeInformation            = 6 /*0x6*/,
    JobObjectAssociateCompletionPortInformation = 7 /*0x7*/,
    JobObjectBasicAndIoAccountingInformation    = 8 /*0x8*/,
    JobObjectExtendedLimitInformation           = 9 /*0x9*/,
    JobObjectJobSetInformation                  = 10 /*0xA*/,
    JobObjectGroupInformation                   = 11 /*0xB*/,
    JobObjectNotificationLimitInformation       = 12 /*0xC*/,
    JobObjectLimitViolationInformation          = 13 /*0xD*/,
    JobObjectGroupInformationEx                 = 14 /*0xE*/,
    JobObjectCpuRateControlInformation          = 15 /*0xF*/,
    JobObjectCompletionFilter                   = 16 /*0x10*/,
    JobObjectCompletionCounter                  = 17 /*0x11*/,
    JobObjectFreezeInformation                  = 18 /*0x12*/,
    JobObjectExtendedAccountingInformation      = 19 /*0x13*/,
    JobObjectWakeInformation                    = 20 /*0x14*/,
    JobObjectBackgroundInformation              = 21 /*0x15*/,
    JobObjectSchedulingRankBiasInformation      = 22 /*0x16*/,
    JobObjectTimerVirtualizationInformation     = 23 /*0x17*/,
    JobObjectCycleTimeNotification              = 24 /*0x18*/,
    JobObjectClearEvent                         = 25 /*0x19*/,
    JobObjectInterferenceInformation            = 26 /*0x1A*/,
    JobObjectClearPeakJobMemoryUsed             = 27 /*0x1B*/,
    JobObjectMemoryUsageInformation             = 28 /*0x1C*/,
    JobObjectSharedCommit                       = 29 /*0x1D*/,
    JobObjectContainerId                        = 30 /*0x1E*/,
    JobObjectIoRateControlInformation           = 31 /*0x1F*/,
    JobObjectSiloRootDirectory                  = 37 /*0x25*/,
    JobObjectServerSiloBasicInformation         = 38 /*0x26*/,
    JobObjectServerSiloUserSharedData           = 39 /*0x27*/,
    JobObjectServerSiloInitialize               = 40 /*0x28*/,
    JobObjectServerSiloRunningState             = 41 /*0x29*/,
    JobObjectIoAttribution                      = 42 /*0x2A*/,
    JobObjectMemoryPartitionInformation         = 43 /*0x2B*/,
    JobObjectContainerTelemetryId               = 44 /*0x2C*/,
    JobObjectSiloSystemRoot                     = 45 /*0x2D*/,
    JobObjectEnergyTrackingState                = 46 /*0x2E*/,
    JobObjectThreadImpersonationInformation     = 47 /*0x2F*/,
    JobObjectReserved1Information               = 18 /*0x12*/,
    JobObjectReserved2Information               = 19 /*0x13*/,
    JobObjectReserved3Information               = 20 /*0x14*/,
    JobObjectReserved4Information               = 21 /*0x15*/,
    JobObjectReserved5Information               = 22 /*0x16*/,
    JobObjectReserved6Information               = 23 /*0x17*/,
    JobObjectReserved7Information               = 24 /*0x18*/,
    JobObjectReserved8Information               = 25 /*0x19*/,
    JobObjectReserved9Information               = 26 /*0x1A*/,
    JobObjectReserved10Information              = 27 /*0x1B*/,
    JobObjectReserved11Information              = 28 /*0x1C*/,
    JobObjectReserved12Information              = 29 /*0x1D*/,
    JobObjectReserved13Information              = 30 /*0x1E*/,
    JobObjectReserved14Information              = 31 /*0x1F*/,
    JobObjectNetRateControlInformation          = 32 /*0x20*/,
    JobObjectNotificationLimitInformation2      = 33 /*0x21*/,
    JobObjectLimitViolationInformation2         = 34 /*0x22*/,
    JobObjectCreateSilo                         = 35 /*0x23*/,
    JobObjectSiloBasicInformation               = 36 /*0x24*/,
    JobObjectReserved15Information              = 37 /*0x25*/,
    JobObjectReserved16Information              = 38 /*0x26*/,
    JobObjectReserved17Information              = 39 /*0x27*/,
    JobObjectReserved18Information              = 40 /*0x28*/,
    JobObjectReserved19Information              = 41 /*0x29*/,
    JobObjectReserved20Information              = 42 /*0x2A*/,
    JobObjectReserved21Information              = 43 /*0x2B*/,
    JobObjectReserved22Information              = 44 /*0x2C*/,
    JobObjectReserved23Information              = 45 /*0x2D*/,
    JobObjectReserved24Information              = 46 /*0x2E*/,
    JobObjectReserved25Information              = 47 /*0x2F*/,
    MaxJobObjectInfoClass                       = 48 /*0x30*/
}JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

typedef enum _KE_HETERO_SYSTEM  // 5 elements, 0x4 bytes
{
    KeHeteroSystemNone       = 0 /*0x0*/,
    KeHeteroSystemVirtualOff = 1 /*0x1*/,
    KeHeteroSystemVirtualOn  = 2 /*0x2*/,
    KeHeteroSystemNative     = 3 /*0x3*/,
    KeHeteroSystemMaximum    = 4 /*0x4*/
}KE_HETERO_SYSTEM, *PKE_HETERO_SYSTEM;

typedef enum _KENLISTMENT_STATE  // 20 elements, 0x4 bytes
{
    KEnlistmentUninitialized         = 0 /*0x0*/,
    KEnlistmentActive                = 256 /*0x100*/,
    KEnlistmentPreparing             = 257 /*0x101*/,
    KEnlistmentPrepared              = 258 /*0x102*/,
    KEnlistmentInDoubt               = 259 /*0x103*/,
    KEnlistmentCommitted             = 260 /*0x104*/,
    KEnlistmentCommittedNotify       = 261 /*0x105*/,
    KEnlistmentCommitRequested       = 262 /*0x106*/,
    KEnlistmentAborted               = 263 /*0x107*/,
    KEnlistmentDelegated             = 264 /*0x108*/,
    KEnlistmentDelegatedDisconnected = 265 /*0x109*/,
    KEnlistmentPrePreparing          = 266 /*0x10A*/,
    KEnlistmentForgotten             = 267 /*0x10B*/,
    KEnlistmentRecovering            = 268 /*0x10C*/,
    KEnlistmentAborting              = 269 /*0x10D*/,
    KEnlistmentReadOnly              = 270 /*0x10E*/,
    KEnlistmentOutcomeUnavailable    = 271 /*0x10F*/,
    KEnlistmentOffline               = 272 /*0x110*/,
    KEnlistmentPrePrepared           = 273 /*0x111*/,
    KEnlistmentInitialized           = 274 /*0x112*/
}KENLISTMENT_STATE, *PKENLISTMENT_STATE;

typedef enum _KERNEL_STACK_LIMITS  // 9 elements, 0x4 bytes
{
    BugcheckStackLimits = 0 /*0x0*/,
    DPCStackLimits      = 1 /*0x1*/,
    ExpandedStackLimits = 2 /*0x2*/,
    NormalStackLimits   = 3 /*0x3*/,
    Win32kStackLimits   = 4 /*0x4*/,
    SwapBusyStackLimits = 5 /*0x5*/,
    IsrStackLimits      = 6 /*0x6*/,
    DebuggerStackLimits = 7 /*0x7*/,
    MaximumStackLimits  = 8 /*0x8*/
}KERNEL_STACK_LIMITS, *PKERNEL_STACK_LIMITS;

typedef enum _KHETERO_CPU_POLICY  // 11 elements, 0x4 bytes
{
    KHeteroCpuPolicyAll         = 0 /*0x0*/,
    KHeteroCpuPolicyLarge       = 1 /*0x1*/,
    KHeteroCpuPolicyLargeOrIdle = 2 /*0x2*/,
    KHeteroCpuPolicySmall       = 3 /*0x3*/,
    KHeteroCpuPolicySmallOrIdle = 4 /*0x4*/,
    KHeteroCpuPolicyDynamic     = 5 /*0x5*/,
    KHeteroCpuPolicyStaticMax   = 5 /*0x5*/,
    KHeteroCpuPolicyBiasedSmall = 6 /*0x6*/,
    KHeteroCpuPolicyBiasedLarge = 7 /*0x7*/,
    KHeteroCpuPolicyDefault     = 8 /*0x8*/,
    KHeteroCpuPolicyMax         = 9 /*0x9*/
}KHETERO_CPU_POLICY, *PKHETERO_CPU_POLICY;

typedef enum _KI_CALLBACK  // 4 elements, 0x4 bytes
{
    KiCallbackNmi   = 0 /*0x0*/,
    KiCallbackBound = 1 /*0x1*/,
    KiCallbackCount = 2 /*0x2*/,
    KiFirstCallback = 0 /*0x0*/
}KI_CALLBACK, *PKI_CALLBACK;

typedef enum _KINTERRUPT_MODE  // 2 elements, 0x4 bytes
{
    LevelSensitive = 0 /*0x0*/,
    Latched        = 1 /*0x1*/
}KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _KINTERRUPT_POLARITY  // 8 elements, 0x4 bytes
{
    InterruptPolarityUnknown       = 0 /*0x0*/,
    InterruptActiveHigh            = 1 /*0x1*/,
    InterruptRisingEdge            = 1 /*0x1*/,
    InterruptActiveLow             = 2 /*0x2*/,
    InterruptFallingEdge           = 2 /*0x2*/,
    InterruptActiveBoth            = 3 /*0x3*/,
    InterruptActiveBothTriggerLow  = 3 /*0x3*/,
    InterruptActiveBothTriggerHigh = 4 /*0x4*/
}KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

typedef enum _KOBJECTS  // 28 elements, 0x4 bytes
{
    EventNotificationObject     = 0 /*0x0*/,
    EventSynchronizationObject  = 1 /*0x1*/,
    MutantObject                = 2 /*0x2*/,
    ProcessObject               = 3 /*0x3*/,
    QueueObject                 = 4 /*0x4*/,
    SemaphoreObject             = 5 /*0x5*/,
    ThreadObject                = 6 /*0x6*/,
    GateObject                  = 7 /*0x7*/,
    TimerNotificationObject     = 8 /*0x8*/,
    TimerSynchronizationObject  = 9 /*0x9*/,
    Spare2Object                = 10 /*0xA*/,
    Spare3Object                = 11 /*0xB*/,
    Spare4Object                = 12 /*0xC*/,
    Spare5Object                = 13 /*0xD*/,
    Spare6Object                = 14 /*0xE*/,
    Spare7Object                = 15 /*0xF*/,
    Spare8Object                = 16 /*0x10*/,
    ProfileCallbackObject       = 17 /*0x11*/,
    ApcObject                   = 18 /*0x12*/,
    DpcObject                   = 19 /*0x13*/,
    DeviceQueueObject           = 20 /*0x14*/,
    PriQueueObject              = 21 /*0x15*/,
    InterruptObject             = 22 /*0x16*/,
    ProfileObject               = 23 /*0x17*/,
    Timer2NotificationObject    = 24 /*0x18*/,
    Timer2SynchronizationObject = 25 /*0x19*/,
    ThreadedDpcObject           = 26 /*0x1A*/,
    MaximumKernelObject         = 27 /*0x1B*/
}KOBJECTS, *PKOBJECTS;

typedef enum _KPROCESS_PPM_POLICY  // 4 elements, 0x4 bytes
{
    ProcessPpmDefault    = 0 /*0x0*/,
    ProcessPpmThrottle   = 1 /*0x1*/,
    ProcessPpmNoThrottle = 2 /*0x2*/,
    MaxProcessPpmPolicy  = 3 /*0x3*/
}KPROCESS_PPM_POLICY, *PKPROCESS_PPM_POLICY;

typedef enum _KPROCESS_STATE  // 8 elements, 0x4 bytes
{
    ProcessInMemory      = 0 /*0x0*/,
    ProcessOutOfMemory   = 1 /*0x1*/,
    ProcessInTransition  = 2 /*0x2*/,
    ProcessOutTransition = 3 /*0x3*/,
    ProcessInSwap        = 4 /*0x4*/,
    ProcessOutSwap       = 5 /*0x5*/,
    ProcessRetryOutSwap  = 6 /*0x6*/,
    ProcessAllSwapStates = 7 /*0x7*/
}KPROCESS_STATE, *PKPROCESS_STATE;

typedef enum _KPROFILE_SOURCE  // 25 elements, 0x4 bytes
{
    ProfileTime                 = 0 /*0x0*/,
    ProfileAlignmentFixup       = 1 /*0x1*/,
    ProfileTotalIssues          = 2 /*0x2*/,
    ProfilePipelineDry          = 3 /*0x3*/,
    ProfileLoadInstructions     = 4 /*0x4*/,
    ProfilePipelineFrozen       = 5 /*0x5*/,
    ProfileBranchInstructions   = 6 /*0x6*/,
    ProfileTotalNonissues       = 7 /*0x7*/,
    ProfileDcacheMisses         = 8 /*0x8*/,
    ProfileIcacheMisses         = 9 /*0x9*/,
    ProfileCacheMisses          = 10 /*0xA*/,
    ProfileBranchMispredictions = 11 /*0xB*/,
    ProfileStoreInstructions    = 12 /*0xC*/,
    ProfileFpInstructions       = 13 /*0xD*/,
    ProfileIntegerInstructions  = 14 /*0xE*/,
    Profile2Issue               = 15 /*0xF*/,
    Profile3Issue               = 16 /*0x10*/,
    Profile4Issue               = 17 /*0x11*/,
    ProfileSpecialInstructions  = 18 /*0x12*/,
    ProfileTotalCycles          = 19 /*0x13*/,
    ProfileIcacheIssues         = 20 /*0x14*/,
    ProfileDcacheAccesses       = 21 /*0x15*/,
    ProfileMemoryBarrierCycles  = 22 /*0x16*/,
    ProfileLoadLinkedIssues     = 23 /*0x17*/,
    ProfileMaximum              = 24 /*0x18*/
}KPROFILE_SOURCE, *PKPROFILE_SOURCE;

typedef enum _KRESOURCEMANAGER_STATE  // 3 elements, 0x4 bytes
{
    KResourceManagerUninitialized = 0 /*0x0*/,
    KResourceManagerOffline       = 1 /*0x1*/,
    KResourceManagerOnline        = 2 /*0x2*/
}KRESOURCEMANAGER_STATE, *PKRESOURCEMANAGER_STATE;

typedef enum _KTHREAD_STATE  // 10 elements, 0x4 bytes
{
    Initialized             = 0 /*0x0*/,
    Ready                   = 1 /*0x1*/,
    Running                 = 2 /*0x2*/,
    Standby                 = 3 /*0x3*/,
    Terminated              = 4 /*0x4*/,
    Waiting                 = 5 /*0x5*/,
    Transition              = 6 /*0x6*/,
    DeferredReady           = 7 /*0x7*/,
    GateWaitObsolete        = 8 /*0x8*/,
    WaitingForProcessInSwap = 9 /*0x9*/
}KTHREAD_STATE, *PKTHREAD_STATE;

typedef enum _KTHREAD_TAG  // 3 elements, 0x4 bytes
{
    KThreadTagNone           = 0 /*0x0*/,
    KThreadTagMediaBuffering = 1 /*0x1*/,
    KThreadTagMax            = 2 /*0x2*/
}KTHREAD_TAG, *PKTHREAD_TAG;

typedef enum _KTIMER2_COLLECTION_INDEX  // 10 elements, 0x4 bytes
{
    KTimer2CollectionNoWake      = 0 /*0x0*/,
    KTimer2CollectionHr          = 1 /*0x1*/,
    KTimer2CollectionFinite      = 2 /*0x2*/,
    KTimer2CollectionIr          = 3 /*0x3*/,
    KTimer2CollectionNotInserted = 16 /*0x10*/,
    KTimer2CollectionInvalid     = 20 /*0x14*/,
    KTimer2CollectionOptional    = 32 /*0x20*/,
    KTimer2CollectionMin         = 0 /*0x0*/,
    KTimer2CollectionMax         = 4 /*0x4*/,
    KTimer2CollectionNode1       = 2 /*0x2*/
}KTIMER2_COLLECTION_INDEX, *PKTIMER2_COLLECTION_INDEX;

typedef enum _KTM_STATE  // 6 elements, 0x4 bytes
{
    KKtmUninitialized  = 0 /*0x0*/,
    KKtmInitialized    = 1 /*0x1*/,
    KKtmRecovering     = 2 /*0x2*/,
    KKtmOnline         = 3 /*0x3*/,
    KKtmRecoveryFailed = 4 /*0x4*/,
    KKtmOffline        = 5 /*0x5*/
}KTM_STATE, *PKTM_STATE;

typedef enum _KTRANSACTION_OUTCOME  // 5 elements, 0x4 bytes
{
    KTxOutcomeUninitialized = 0 /*0x0*/,
    KTxOutcomeUndetermined  = 1 /*0x1*/,
    KTxOutcomeCommitted     = 2 /*0x2*/,
    KTxOutcomeAborted       = 3 /*0x3*/,
    KTxOutcomeUnavailable   = 4 /*0x4*/
}KTRANSACTION_OUTCOME, *PKTRANSACTION_OUTCOME;

typedef enum _KTRANSACTION_STATE  // 12 elements, 0x4 bytes
{
    KTransactionUninitialized = 0 /*0x0*/,
    KTransactionActive        = 1 /*0x1*/,
    KTransactionPreparing     = 2 /*0x2*/,
    KTransactionPrepared      = 3 /*0x3*/,
    KTransactionInDoubt       = 4 /*0x4*/,
    KTransactionCommitted     = 5 /*0x5*/,
    KTransactionAborted       = 6 /*0x6*/,
    KTransactionDelegated     = 7 /*0x7*/,
    KTransactionPrePreparing  = 8 /*0x8*/,
    KTransactionForgotten     = 9 /*0x9*/,
    KTransactionRecovering    = 10 /*0xA*/,
    KTransactionPrePrepared   = 11 /*0xB*/
}KTRANSACTION_STATE, *PKTRANSACTION_STATE;

typedef enum _KWAIT_BLOCK_STATE  // 8 elements, 0x4 bytes
{
    WaitBlockBypassStart           = 0 /*0x0*/,
    WaitBlockBypassComplete        = 1 /*0x1*/,
    WaitBlockSuspendBypassStart    = 2 /*0x2*/,
    WaitBlockSuspendBypassComplete = 3 /*0x3*/,
    WaitBlockActive                = 4 /*0x4*/,
    WaitBlockInactive              = 5 /*0x5*/,
    WaitBlockSuspended             = 6 /*0x6*/,
    WaitBlockAllStates             = 7 /*0x7*/
}KWAIT_BLOCK_STATE, *PKWAIT_BLOCK_STATE;

typedef enum _KWAIT_REASON  // 40 elements, 0x4 bytes
{
    Executive         = 0 /*0x0*/,
    FreePage          = 1 /*0x1*/,
    PageIn            = 2 /*0x2*/,
    PoolAllocation    = 3 /*0x3*/,
    DelayExecution    = 4 /*0x4*/,
    Suspended         = 5 /*0x5*/,
    UserRequest       = 6 /*0x6*/,
    WrExecutive       = 7 /*0x7*/,
    WrFreePage        = 8 /*0x8*/,
    WrPageIn          = 9 /*0x9*/,
    WrPoolAllocation  = 10 /*0xA*/,
    WrDelayExecution  = 11 /*0xB*/,
    WrSuspended       = 12 /*0xC*/,
    WrUserRequest     = 13 /*0xD*/,
    WrSpare0          = 14 /*0xE*/,
    WrQueue           = 15 /*0xF*/,
    WrLpcReceive      = 16 /*0x10*/,
    WrLpcReply        = 17 /*0x11*/,
    WrVirtualMemory   = 18 /*0x12*/,
    WrPageOut         = 19 /*0x13*/,
    WrRendezvous      = 20 /*0x14*/,
    WrKeyedEvent      = 21 /*0x15*/,
    WrTerminated      = 22 /*0x16*/,
    WrProcessInSwap   = 23 /*0x17*/,
    WrCpuRateControl  = 24 /*0x18*/,
    WrCalloutStack    = 25 /*0x19*/,
    WrKernel          = 26 /*0x1A*/,
    WrResource        = 27 /*0x1B*/,
    WrPushLock        = 28 /*0x1C*/,
    WrMutex           = 29 /*0x1D*/,
    WrQuantumEnd      = 30 /*0x1E*/,
    WrDispatchInt     = 31 /*0x1F*/,
    WrPreempted       = 32 /*0x20*/,
    WrYieldExecution  = 33 /*0x21*/,
    WrFastMutex       = 34 /*0x22*/,
    WrGuardedMutex    = 35 /*0x23*/,
    WrRundown         = 36 /*0x24*/,
    WrAlertByThreadId = 37 /*0x25*/,
    WrDeferredPreempt = 38 /*0x26*/,
    MaximumWaitReason = 39 /*0x27*/
}KWAIT_REASON, *PKWAIT_REASON;

typedef enum _KWAIT_STATE  // 10 elements, 0x4 bytes
{
    WaitInProgress        = 0 /*0x0*/,
    WaitCommitted         = 1 /*0x1*/,
    WaitAborted           = 2 /*0x2*/,
    WaitSuspendInProgress = 3 /*0x3*/,
    WaitSuspended         = 4 /*0x4*/,
    WaitResumeInProgress  = 5 /*0x5*/,
    WaitResumeAborted     = 6 /*0x6*/,
    WaitFirstSuspendState = 3 /*0x3*/,
    WaitLastSuspendState  = 6 /*0x6*/,
    MaximumWaitState      = 7 /*0x7*/
}KWAIT_STATE, *PKWAIT_STATE;

typedef enum _LDR_DDAG_STATE  // 15 elements, 0x4 bytes
{
    LdrModulesMerged                 = -5 /*0xFB*/,
    LdrModulesInitError              = -4 /*0xFC*/,
    LdrModulesSnapError              = -3 /*0xFD*/,
    LdrModulesUnloaded               = -2 /*0xFE*/,
    LdrModulesUnloading              = -1 /*0xFF*/,
    LdrModulesPlaceHolder            = 0 /*0x0*/,
    LdrModulesMapping                = 1 /*0x1*/,
    LdrModulesMapped                 = 2 /*0x2*/,
    LdrModulesWaitingForDependencies = 3 /*0x3*/,
    LdrModulesSnapping               = 4 /*0x4*/,
    LdrModulesSnapped                = 5 /*0x5*/,
    LdrModulesCondensed              = 6 /*0x6*/,
    LdrModulesReadyToInit            = 7 /*0x7*/,
    LdrModulesInitializing           = 8 /*0x8*/,
    LdrModulesReadyToRun             = 9 /*0x9*/
}LDR_DDAG_STATE, *PLDR_DDAG_STATE;

typedef enum _LDR_DLL_LOAD_REASON  // 8 elements, 0x4 bytes
{
    LoadReasonStaticDependency           = 0 /*0x0*/,
    LoadReasonStaticForwarderDependency  = 1 /*0x1*/,
    LoadReasonDynamicForwarderDependency = 2 /*0x2*/,
    LoadReasonDelayloadDependency        = 3 /*0x3*/,
    LoadReasonDynamicLoad                = 4 /*0x4*/,
    LoadReasonAsImageLoad                = 5 /*0x5*/,
    LoadReasonAsDataLoad                 = 6 /*0x6*/,
    LoadReasonUnknown                    = -1 /*0xFF*/
}LDR_DLL_LOAD_REASON, *PLDR_DLL_LOAD_REASON;

typedef enum _LOCK_OPERATION  // 3 elements, 0x4 bytes
{
    IoReadAccess   = 0 /*0x0*/,
    IoWriteAccess  = 1 /*0x1*/,
    IoModifyAccess = 2 /*0x2*/
}LOCK_OPERATION, *PLOCK_OPERATION;

typedef enum _LSA_FOREST_TRUST_RECORD_TYPE  // 4 elements, 0x4 bytes
{
    ForestTrustTopLevelName   = 0 /*0x0*/,
    ForestTrustTopLevelNameEx = 1 /*0x1*/,
    ForestTrustDomainInfo     = 2 /*0x2*/,
    ForestTrustRecordTypeLast = 2 /*0x2*/
}LSA_FOREST_TRUST_RECORD_TYPE, *PLSA_FOREST_TRUST_RECORD_TYPE;

typedef enum _MEMORY_CACHING_TYPE  // 8 elements, 0x4 bytes
{
    MmNonCached              = 0 /*0x0*/,
    MmCached                 = 1 /*0x1*/,
    MmWriteCombined          = 2 /*0x2*/,
    MmHardwareCoherentCached = 3 /*0x3*/,
    MmNonCachedUnordered     = 4 /*0x4*/,
    MmUSWCCached             = 5 /*0x5*/,
    MmMaximumCacheType       = 6 /*0x6*/,
    MmNotMapped              = -1 /*0xFF*/
}MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG  // 1 elements, 0x4 bytes
{
    MmFrameBufferCached = 2 /*0x2*/
}MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _MI_ASSIGNED_REGION_TYPES  // 14 elements, 0x4 bytes
{
    AssignedRegionNonPagedPool        = 0 /*0x0*/,
    AssignedRegionPagedPool           = 1 /*0x1*/,
    AssignedRegionSystemCache         = 2 /*0x2*/,
    AssignedRegionSystemPtes          = 3 /*0x3*/,
    AssignedRegionUltraZero           = 4 /*0x4*/,
    AssignedRegionPfnDatabase         = 5 /*0x5*/,
    AssignedRegionCfg                 = 6 /*0x6*/,
    AssignedRegionHyperSpace          = 7 /*0x7*/,
    AssignedRegionPageTables          = 8 /*0x8*/,
    AssignedRegionSpecialPoolPaged    = 9 /*0x9*/,
    AssignedRegionSpecialPoolNonPaged = 10 /*0xA*/,
    AssignedRegionSession             = 11 /*0xB*/,
    AssignedRegionSystemImages        = 12 /*0xC*/,
    AssignedRegionMaximum             = 13 /*0xD*/
}MI_ASSIGNED_REGION_TYPES, *PMI_ASSIGNED_REGION_TYPES;

typedef enum _MI_AVAILABLE_PAGE_WAIT_TYPES  // 4 elements, 0x4 bytes
{
    AvailablePagesWaitLow      = 0 /*0x0*/,
    AvailablePagesWaitHigh     = 1 /*0x1*/,
    AvailablePagesWaitVeryHigh = 2 /*0x2*/,
    AvailablePagesWaitMaximum  = 3 /*0x3*/
}MI_AVAILABLE_PAGE_WAIT_TYPES, *PMI_AVAILABLE_PAGE_WAIT_TYPES;

typedef enum _MI_CFG_BITMAP_TYPE  // 3 elements, 0x4 bytes
{
    CfgBitMapNative = 0 /*0x0*/,
    CfgBitMapWow64  = 1 /*0x1*/,
    CfgBitMapMax    = 2 /*0x2*/
}MI_CFG_BITMAP_TYPE, *PMI_CFG_BITMAP_TYPE;

typedef enum _MI_CROSS_PARTITION_CHARGE_TYPE  // 5 elements, 0x4 bytes
{
    MiCrossPartitionSectionResAvailCharge     = 0 /*0x0*/,
    MiCrossPartitionSectionCommitCharge       = 1 /*0x1*/,
    MiCrossPartitionPageCombineResAvailCharge = 2 /*0x2*/,
    MiCrossPartitionPageCombineCommitCharge   = 3 /*0x3*/,
    MiCrossPartitionMaximumCharge             = 4 /*0x4*/
}MI_CROSS_PARTITION_CHARGE_TYPE, *PMI_CROSS_PARTITION_CHARGE_TYPE;

typedef enum _MI_DYNAMICBASE_BITMAP  // 5 elements, 0x4 bytes
{
    DynamicBaseBitMap32       = 0 /*0x0*/,
    DynamicBaseBitMap64Low    = 1 /*0x1*/,
    DynamicBaseBitMap64High   = 2 /*0x2*/,
    DynamicBaseBitMapWow64Dll = 3 /*0x3*/,
    LastDynamicBaseBitMap     = 4 /*0x4*/
}MI_DYNAMICBASE_BITMAP, *PMI_DYNAMICBASE_BITMAP;

typedef enum _MI_IO_PFN_TYPE  // 4 elements, 0x4 bytes
{
    MiIoPfnProbes      = 0 /*0x0*/,
    MiIoPfnMaps        = 1 /*0x1*/,
    MiIoPfnUnmapped    = 2 /*0x2*/,
    MiMaximumIoPfnType = 3 /*0x3*/
}MI_IO_PFN_TYPE, *PMI_IO_PFN_TYPE;

typedef enum _MI_KSTACK_TYPE  // 3 elements, 0x4 bytes
{
    MiRegularKstack    = 0 /*0x0*/,
    MiShortLivedKstack = 1 /*0x1*/,
    MiMaximumKstack    = 2 /*0x2*/
}MI_KSTACK_TYPE, *PMI_KSTACK_TYPE;

typedef enum _MI_MEMORY_EVENT_TYPES  // 12 elements, 0x4 bytes
{
    LowPagedPoolEvent         = 0 /*0x0*/,
    HighPagedPoolEvent        = 1 /*0x1*/,
    LowNonPagedPoolEvent      = 2 /*0x2*/,
    HighNonPagedPoolEvent     = 3 /*0x3*/,
    LowAvailablePagesEvent    = 4 /*0x4*/,
    HighAvailablePagesEvent   = 5 /*0x5*/,
    LowCommitEvent            = 6 /*0x6*/,
    HighCommitEvent           = 7 /*0x7*/,
    MaximumCommitEvent        = 8 /*0x8*/,
    BadMemoryDetectedEvent    = 9 /*0x9*/,
    PhysicalMemoryChangeEvent = 10 /*0xA*/,
    TotalNumberOfMemoryEvents = 11 /*0xB*/
}MI_MEMORY_EVENT_TYPES, *PMI_MEMORY_EVENT_TYPES;

typedef enum _MI_MEMORY_HIGHLOW  // 3 elements, 0x4 bytes
{
    MiMemoryHigh    = 0 /*0x0*/,
    MiMemoryLow     = 1 /*0x1*/,
    MiMemoryHighLow = 2 /*0x2*/
}MI_MEMORY_HIGHLOW, *PMI_MEMORY_HIGHLOW;

typedef enum _MI_MIRROR_BITMAP_TYPES  // 3 elements, 0x4 bytes
{
    MirrorBitmapTypeNormal      = 0 /*0x0*/,
    MirrorBitmapTypeInterlocked = 1 /*0x1*/,
    MirrorBitmapTypeMaximum     = 2 /*0x2*/
}MI_MIRROR_BITMAP_TYPES, *PMI_MIRROR_BITMAP_TYPES;

typedef enum _MI_NODE_NONPAGED_POOL_BITMAP  // 3 elements, 0x4 bytes
{
    NonPagedPoolLargePdeNx = 0 /*0x0*/,
    NonPagedPoolSmallPde   = 1 /*0x1*/,
    NonPagedPoolPerPage    = 2 /*0x2*/
}MI_NODE_NONPAGED_POOL_BITMAP, *PMI_NODE_NONPAGED_POOL_BITMAP;

typedef enum _MI_PARTITION_THREAD  // 6 elements, 0x4 bytes
{
    MiZeroPageThreadSlot             = 0 /*0x0*/,
    MiPartitionWorkingSetManagerSlot = 1 /*0x1*/,
    MiDereferenceSegmentThreadSlot   = 2 /*0x2*/,
    MiModifiedPageWriterSlot         = 3 /*0x3*/,
    MiMappedPageWriterSlot           = 4 /*0x4*/,
    MiNumberOfPartitionThreads       = 5 /*0x5*/
}MI_PARTITION_THREAD, *PMI_PARTITION_THREAD;

typedef enum _MI_PFN_CACHE_ATTRIBUTE  // 4 elements, 0x4 bytes
{
    MiNonCached     = 0 /*0x0*/,
    MiCached        = 1 /*0x1*/,
    MiWriteCombined = 2 /*0x2*/,
    MiNotMapped     = 3 /*0x3*/
}MI_PFN_CACHE_ATTRIBUTE, *PMI_PFN_CACHE_ATTRIBUTE;

typedef enum _MI_SUBVAD_LISTS  // 5 elements, 0x4 bytes
{
    MiSubVadPebTebAny      = 0 /*0x0*/,
    MiSubVadPebTebBelow2gb = 1 /*0x1*/,
    MiSubVadPebTebBelow4gb = 2 /*0x2*/,
    MiSubVadRfg            = 3 /*0x3*/,
    MiSubVadMaximum        = 4 /*0x4*/
}MI_SUBVAD_LISTS, *PMI_SUBVAD_LISTS;

typedef enum _MI_SYSTEM_VA_TYPE  // 16 elements, 0x4 bytes
{
    MiVaUnused              = 0 /*0x0*/,
    MiVaSessionSpace        = 1 /*0x1*/,
    MiVaProcessSpace        = 2 /*0x2*/,
    MiVaBootLoaded          = 3 /*0x3*/,
    MiVaPfnDatabase         = 4 /*0x4*/,
    MiVaNonPagedPool        = 5 /*0x5*/,
    MiVaPagedPool           = 6 /*0x6*/,
    MiVaSpecialPoolPaged    = 7 /*0x7*/,
    MiVaSystemCache         = 8 /*0x8*/,
    MiVaSystemPtes          = 9 /*0x9*/,
    MiVaHal                 = 10 /*0xA*/,
    MiVaSessionGlobalSpace  = 11 /*0xB*/,
    MiVaDriverImages        = 12 /*0xC*/,
    MiVaSpecialPoolNonPaged = 13 /*0xD*/,
    MiVaMaximumType         = 14 /*0xE*/,
    MiVaSystemPtesLarge     = 15 /*0xF*/
}MI_SYSTEM_VA_TYPE, *PMI_SYSTEM_VA_TYPE;

typedef enum _MI_VAD_64K_TYPES  // 3 elements, 0x4 bytes
{
    MiVad64KPrivate = 0 /*0x0*/,
    MiVad64KShared  = 1 /*0x1*/,
    MiVad64KTypes   = 2 /*0x2*/
}MI_VAD_64K_TYPES, *PMI_VAD_64K_TYPES;

typedef enum _MI_VAD_ALLOCATION_CELL_TYPE  // 3 elements, 0x4 bytes
{
    MiVadBottomUp              = 0 /*0x0*/,
    MiVadStackPebTeb           = 1 /*0x1*/,
    MiVadAllocationCellMaximum = 2 /*0x2*/
}MI_VAD_ALLOCATION_CELL_TYPE, *PMI_VAD_ALLOCATION_CELL_TYPE;

typedef enum _MI_WORKING_SET_TYPE  // 5 elements, 0x4 bytes
{
    MiWorkingSetTypeSystemCache      = 0 /*0x0*/,
    MiWorkingSetTypeSystemPtes       = 1 /*0x1*/,
    MiWorkingSetTypePartitionMaximum = 1 /*0x1*/,
    MiWorkingSetTypePagedPool        = 2 /*0x2*/,
    MiWorkingSetTypeMaximum          = 3 /*0x3*/
}MI_WORKING_SET_TYPE, *PMI_WORKING_SET_TYPE;

typedef enum _MM_PAGE_ACCESS_TYPE  // 4 elements, 0x4 bytes
{
    MmPteAccessType         = 0 /*0x0*/,
    MmCcReadAheadType       = 1 /*0x1*/,
    MmPfnRepurposeType      = 2 /*0x2*/,
    MmMaximumPageAccessType = 3 /*0x3*/
}MM_PAGE_ACCESS_TYPE, *PMM_PAGE_ACCESS_TYPE;

typedef enum _MM_POOL_PRIORITIES  // 4 elements, 0x4 bytes
{
    MmHighPriority        = 0 /*0x0*/,
    MmNormalPriority      = 1 /*0x1*/,
    MmLowPriority         = 2 /*0x2*/,
    MmMaximumPoolPriority = 3 /*0x3*/
}MM_POOL_PRIORITIES, *PMM_POOL_PRIORITIES;

typedef enum _MM_POOL_TYPES  // 4 elements, 0x4 bytes
{
    MmNonPagedPool     = 0 /*0x0*/,
    MmPagedPool        = 1 /*0x1*/,
    MmSessionPagedPool = 2 /*0x2*/,
    MmMaximumPoolType  = 3 /*0x3*/
}MM_POOL_TYPES, *PMM_POOL_TYPES;

typedef enum _MM_PREEMPTIVE_TRIMS  // 5 elements, 0x4 bytes
{
    MmPreemptForNonPaged         = 0 /*0x0*/,
    MmPreemptForPaged            = 1 /*0x1*/,
    MmPreemptForNonPagedPriority = 2 /*0x2*/,
    MmPreemptForPagedPriority    = 3 /*0x3*/,
    MmMaximumPreempt             = 4 /*0x4*/
}MM_PREEMPTIVE_TRIMS, *PMM_PREEMPTIVE_TRIMS;

typedef enum _MMLISTS  // 8 elements, 0x4 bytes
{
    ZeroedPageList          = 0 /*0x0*/,
    FreePageList            = 1 /*0x1*/,
    StandbyPageList         = 2 /*0x2*/,
    ModifiedPageList        = 3 /*0x3*/,
    ModifiedNoWritePageList = 4 /*0x4*/,
    BadPageList             = 5 /*0x5*/,
    ActiveAndValid          = 6 /*0x6*/,
    TransitionPage          = 7 /*0x7*/
}MMLISTS, *PMMLISTS;

typedef enum _MODE  // 3 elements, 0x4 bytes
{
    KernelMode  = 0 /*0x0*/,
    UserMode    = 1 /*0x1*/,
    MaximumMode = 2 /*0x2*/
}MODE, *PMODE;

typedef enum _NT_PRODUCT_TYPE  // 3 elements, 0x4 bytes
{
    NtProductWinNt    = 1 /*0x1*/,
    NtProductLanManNt = 2 /*0x2*/,
    NtProductServer   = 3 /*0x3*/
}NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _OB_OPEN_REASON  // 5 elements, 0x4 bytes
{
    ObCreateHandle    = 0 /*0x0*/,
    ObOpenHandle      = 1 /*0x1*/,
    ObDuplicateHandle = 2 /*0x2*/,
    ObInheritHandle   = 3 /*0x3*/,
    ObMaxOpenReason   = 4 /*0x4*/
}OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _OBJECT_INFORMATION_CLASS  // 8 elements, 0x4 bytes
{
    ObjectBasicInformation         = 0 /*0x0*/,
    ObjectNameInformation          = 1 /*0x1*/,
    ObjectTypeInformation          = 2 /*0x2*/,
    ObjectTypesInformation         = 3 /*0x3*/,
    ObjectHandleFlagInformation    = 4 /*0x4*/,
    ObjectSessionInformation       = 5 /*0x5*/,
    ObjectSessionObjectInformation = 6 /*0x6*/,
    MaxObjectInfoClass             = 7 /*0x7*/
}OBJECT_INFORMATION_CLASS, *POBJECT_INFORMATION_CLASS;

typedef enum _PCW_CALLBACK_TYPE  // 4 elements, 0x4 bytes
{
    PcwCallbackAddCounter         = 0 /*0x0*/,
    PcwCallbackRemoveCounter      = 1 /*0x1*/,
    PcwCallbackEnumerateInstances = 2 /*0x2*/,
    PcwCallbackCollectData        = 3 /*0x3*/
}PCW_CALLBACK_TYPE, *PPCW_CALLBACK_TYPE;

typedef enum _PDC_ACTIVITY_TYPE  // 6 elements, 0x4 bytes
{
    PdcNetwork         = 0 /*0x0*/,
    PdcSystem          = 1 /*0x1*/,
    PdcTimer           = 2 /*0x2*/,
    PdcAllNetworks     = 3 /*0x3*/,
    PdcInvalidActivity = 4 /*0x4*/,
    PdcMaxActivity     = 4 /*0x4*/
}PDC_ACTIVITY_TYPE, *PPDC_ACTIVITY_TYPE;

typedef enum _PDCCLIENTID  // 95 elements, 0x4 bytes
{
    PDC_INVALID_CLIENT                            = 0 /*0x0*/,
    PDC_PLM_CLIENT                                = 1 /*0x1*/,
    PDC_NQM_CLIENT                                = 2 /*0x2*/,
    PDC_WNS_CLIENT                                = 3 /*0x3*/,
    PDC_DAM_CLIENT                                = 4 /*0x4*/,
    PDC_WCM_CLIENT                                = 5 /*0x5*/,
    PDC_NCSI_CLIENT                               = 7 /*0x7*/,
    PDC_DHCP_CLIENT                               = 8 /*0x8*/,
    PDC_TCPIP_CLIENT                              = 9 /*0x9*/,
    PDC_WU_CLIENT                                 = 11 /*0xB*/,
    PDC_GP_CLIENT                                 = 12 /*0xC*/,
    PDC_NCA_CLIENT                                = 14 /*0xE*/,
    PDC_BI_CLIENT                                 = 15 /*0xF*/,
    PDC_MSCHED_CLIENT                             = 16 /*0x10*/,
    PDC_SUSPENDRESUME_CLIENT                      = 17 /*0x11*/,
    PDC_ACTIVATION_CLIENT                         = 18 /*0x12*/,
    PDC_ACTIVATION_TEST_CLIENT                    = 19 /*0x13*/,
    PDC_PLM_PHASE_TEST_CLIENT                     = 20 /*0x14*/,
    PDC_DAM_PHASE_TEST_CLIENT                     = 21 /*0x15*/,
    PDC_LOW_POWER_PHASE_TEST_CLIENT               = 22 /*0x16*/,
    PDC_RESILIENCY_NOTIFICATION_PHASE_TEST_CLIENT = 23 /*0x17*/,
    PDC_NQM_RESILIENCY_TEST_CLIENT                = 24 /*0x18*/,
    PDC_DAM_RESILIENCY_TEST_CLIENT                = 25 /*0x19*/,
    PDC_DAM_KM_TEST_CLIENT                        = 26 /*0x1A*/,
    PDC_DAM_UM_TEST_CLIENT                        = 27 /*0x1B*/,
    PDC_SINGLETON_TEST_CLIENT                     = 28 /*0x1C*/,
    PDC_NETWORK_SERVICE_TEST_CLIENT               = 29 /*0x1D*/,
    PDC_NETWORK_SERVICE2_TEST_CLIENT              = 30 /*0x1E*/,
    PDC_SYSTEM_SERVICE_TEST_CLIENT                = 31 /*0x1F*/,
    PDC_ACTIV_NOTIF_DAM_RESIL_TEST_CLIENT         = 32 /*0x20*/,
    PDC_ACTIV_NOTIF_NET_RESIL_TEST_CLIENT         = 33 /*0x21*/,
    PDC_SHELL_CLIENT                              = 34 /*0x22*/,
    PDC_MAINTENANCE_CLIENT                        = 35 /*0x23*/,
    PDC_SYNC_CLIENT                               = 36 /*0x24*/,
    PDC_IDM_CLIENT                                = 37 /*0x25*/,
    PDC_CORTANA_VOICE_ACTIVATION_CLIENT           = 38 /*0x26*/,
    PDC_TETHERING_CLIENT                          = 39 /*0x27*/,
    PDC_AUDIO_CLIENT                              = 40 /*0x28*/,
    PDC_LOCK_SCREEN                               = 41 /*0x29*/,
    PDC_LREC_CLIENT                               = 42 /*0x2A*/,
    PDC_WP_BW_CLIENT                              = 43 /*0x2B*/,
    PDC_WP_MEDIA_STREAMING_CLIENT                 = 44 /*0x2C*/,
    PDC_WP_MAPS_CLIENT                            = 46 /*0x2E*/,
    PDC_WP_SYNC_CLIENT                            = 47 /*0x2F*/,
    PDC_SETTING_SYNC_CLIENT                       = 48 /*0x30*/,
    PDC_WP_EDM_CLIENT                             = 49 /*0x31*/,
    PDC_WP_WALLET_CLIENT                          = 50 /*0x32*/,
    PDC_WP_LOCATION_CLIENT                        = 51 /*0x33*/,
    PDC_WP_CM_CLIENT                              = 53 /*0x35*/,
    PDC_WP_DCP_CLIENT                             = 54 /*0x36*/,
    PDC_WP_WIFIAUTO_CLIENT                        = 55 /*0x37*/,
    PDC_MDM_CERTINSTALLER_CLIENT                  = 57 /*0x39*/,
    PDC_WP_IM_CLIENT                              = 58 /*0x3A*/,
    PDC_WP_MMS_CLIENT                             = 59 /*0x3B*/,
    PDC_DEVICEENROLLER_CLIENT                     = 60 /*0x3C*/,
    PDC_WP_WIFI_SCANNING_CLIENT                   = 61 /*0x3D*/,
    PDC_WP_OMADM_CLIENT                           = 62 /*0x3E*/,
    PDC_WP_TELEMETRY_CHECK_CLIENT                 = 63 /*0x3F*/,
    PDC_WP_DIS_CLIENT                             = 64 /*0x40*/,
    PDC_BITS_CLIENT                               = 65 /*0x41*/,
    PDC_WP_VOIP_EXECUTION_CLIENT                  = 66 /*0x42*/,
    PDC_WP_RESERVED_CLIENT3                       = 67 /*0x43*/,
    PDC_SLEEP_STUDY_CLIENT                        = 68 /*0x44*/,
    PDC_WP_AUTOTIMEUPDATE_CLIENT                  = 69 /*0x45*/,
    PDC_HYPERV_CLIENT                             = 70 /*0x46*/,
    PDC_KM_SIGNAL_CLIENT                          = 71 /*0x47*/,
    PDC_UM_SIGNAL_CLIENT                          = 72 /*0x48*/,
    PDC_DEVICE_HEALTH_ATTESTATION_CLIENT          = 73 /*0x49*/,
    PDC_XB_SYSTEM_CLIENT                          = 74 /*0x4A*/,
    PDC_XB_HOST_CLIENT                            = 75 /*0x4B*/,
    PDC_PRINT_JOB_MANAGER_CLIENT                  = 76 /*0x4C*/,
    PDC_TELEMETRY_CLIENT                          = 77 /*0x4D*/,
    PDC_ERROR_REPORTING_CLIENT                    = 78 /*0x4E*/,
    PDC_XBOX_NTM                                  = 79 /*0x4F*/,
    PDC_CBE_CLIENT                                = 80 /*0x50*/,
    PDC_FIND_MY_PHONE_CLIENT                      = 81 /*0x51*/,
    PDC_COMMAND_CHANNEL_CLIENT                    = 82 /*0x52*/,
    PDC_PPM_PROFILES_CLIENT                       = 83 /*0x53*/,
    PDC_WIFI_CALLING_CLIENT                       = 84 /*0x54*/,
    PDC_WU_REBOOT_CLIENT                          = 85 /*0x55*/,
    PDC_SYSMAIN_CLIENT                            = 86 /*0x56*/,
    PDC_XBOX_UPDATE_CLIENT                        = 87 /*0x57*/,
    PDC_CHAT_SERVICE_CLIENT                       = 88 /*0x58*/,
    PDC_FIND_MY_DEVICE_CLIENT                     = 89 /*0x59*/,
    PDC_NOTIFICATION_FORWARDING_AND_ACTION_CLIENT = 90 /*0x5A*/,
    PDC_INSTALL_AGENT_CLIENT                      = 91 /*0x5B*/,
    PDC_XBOX_WAKE_ON_VOICE                        = 92 /*0x5C*/,
    PDC_PLM_AUDIO_CLIENT                          = 93 /*0x5D*/,
    PDC_WP_BCKAUDIO_CLIENT                        = 94 /*0x5E*/,
    PDC_WAKE_ON_LAN_CLIENT                        = 95 /*0x5F*/,
    PDC_WP_CLOUD_MESSAGING_CLIENT                 = 96 /*0x60*/,
    PDC_DATA_MIGRATION_MANAGER                    = 97 /*0x61*/,
    PDC_EVENT_SOUND_MANAGER_CLIENT                = 98 /*0x62*/,
    PDC_WWAN_DORMANCY_HINT_CLIENT                 = 99 /*0x63*/,
    PDC_NUMBER_OF_CLIENTS                         = 100 /*0x64*/
}PDCCLIENTID, *PPDCCLIENTID;

typedef enum _PEP_ACPI_RESOURCE_TYPE  // 10 elements, 0x4 bytes
{
    PepAcpiMemory         = 0 /*0x0*/,
    PepAcpiIoPort         = 1 /*0x1*/,
    PepAcpiInterrupt      = 2 /*0x2*/,
    PepAcpiGpioIo         = 3 /*0x3*/,
    PepAcpiGpioInt        = 4 /*0x4*/,
    PepAcpiSpbI2c         = 5 /*0x5*/,
    PepAcpiSpbSpi         = 6 /*0x6*/,
    PepAcpiSpbUart        = 7 /*0x7*/,
    PepAcpiExtendedMemory = 8 /*0x8*/,
    PepAcpiExtendedIo     = 9 /*0x9*/
}PEP_ACPI_RESOURCE_TYPE, *PPEP_ACPI_RESOURCE_TYPE;

typedef enum _PERFINFO_KERNELMEMORY_USAGE_TYPE  // 2 elements, 0x4 bytes
{
    PerfInfoMemUsagePfnMetadata = 0 /*0x0*/,
    PerfInfoMemUsageMax         = 1 /*0x1*/
}PERFINFO_KERNELMEMORY_USAGE_TYPE, *PPERFINFO_KERNELMEMORY_USAGE_TYPE;

typedef enum _PERFINFO_MM_STAT  // 4 elements, 0x4 bytes
{
    PerfInfoMMStatNotUsed              = 0 /*0x0*/,
    PerfInfoMMStatAggregatePageCombine = 1 /*0x1*/,
    PerfInfoMMStatIterationPageCombine = 2 /*0x2*/,
    PerfInfoMMStatMax                  = 3 /*0x3*/
}PERFINFO_MM_STAT, *PPERFINFO_MM_STAT;

typedef enum _PF_FILE_ACCESS_TYPE  // 3 elements, 0x4 bytes
{
    PfFileAccessTypeRead  = 0 /*0x0*/,
    PfFileAccessTypeWrite = 1 /*0x1*/,
    PfFileAccessTypeMax   = 2 /*0x2*/
}PF_FILE_ACCESS_TYPE, *PPF_FILE_ACCESS_TYPE;

typedef enum _PLUGPLAY_EVENT_CATEGORY  // 13 elements, 0x4 bytes
{
    HardwareProfileChangeEvent = 0 /*0x0*/,
    TargetDeviceChangeEvent    = 1 /*0x1*/,
    DeviceClassChangeEvent     = 2 /*0x2*/,
    CustomDeviceEvent          = 3 /*0x3*/,
    DeviceInstallEvent         = 4 /*0x4*/,
    DeviceArrivalEvent         = 5 /*0x5*/,
    VetoEvent                  = 6 /*0x6*/,
    BlockedDriverEvent         = 7 /*0x7*/,
    InvalidIDEvent             = 8 /*0x8*/,
    DevicePropertyChangeEvent  = 9 /*0x9*/,
    DeviceInstanceRemovalEvent = 10 /*0xA*/,
    DeviceInstanceStartedEvent = 11 /*0xB*/,
    MaxPlugEventCategory       = 12 /*0xC*/
}PLUGPLAY_EVENT_CATEGORY, *PPLUGPLAY_EVENT_CATEGORY;

typedef enum _PNP_DEVICE_ACTION_REQUEST  // 25 elements, 0x4 bytes
{
    AssignResources                = 0 /*0x0*/,
    ClearDeviceProblem             = 1 /*0x1*/,
    ClearProblem                   = 2 /*0x2*/,
    ClearEjectProblem              = 3 /*0x3*/,
    HaltDevice                     = 4 /*0x4*/,
    QueryPowerRelations            = 5 /*0x5*/,
    Rebalance                      = 6 /*0x6*/,
    ReenumerateBootDevices         = 7 /*0x7*/,
    ReenumerateDeviceOnly          = 8 /*0x8*/,
    ReenumerateDeviceTree          = 9 /*0x9*/,
    ReenumerateRootDevices         = 10 /*0xA*/,
    RequeryDeviceState             = 11 /*0xB*/,
    ResetDevice                    = 12 /*0xC*/,
    ResourceRequirementsChanged    = 13 /*0xD*/,
    RestartEnumeration             = 14 /*0xE*/,
    SetDeviceProblem               = 15 /*0xF*/,
    StartDevice                    = 16 /*0x10*/,
    StartSystemDevicesPass0        = 17 /*0x11*/,
    StartSystemDevicesPass1        = 18 /*0x12*/,
    NotifyTransportRelationsChange = 19 /*0x13*/,
    NotifyEjectionRelationsChange  = 20 /*0x14*/,
    ConfigureDevice                = 21 /*0x15*/,
    ConfigureDeviceClass           = 22 /*0x16*/,
    ConfigureDeviceExtensions      = 23 /*0x17*/,
    ConfigureDeviceReset           = 24 /*0x18*/
}PNP_DEVICE_ACTION_REQUEST, *PPNP_DEVICE_ACTION_REQUEST;

typedef enum _PNP_DEVICE_DELETE_TYPE  // 8 elements, 0x4 bytes
{
    QueryRemoveDevice           = 0 /*0x0*/,
    CancelRemoveDevice          = 1 /*0x1*/,
    RemoveDevice                = 2 /*0x2*/,
    SurpriseRemoveDevice        = 3 /*0x3*/,
    EjectDevice                 = 4 /*0x4*/,
    RemoveFailedDevice          = 5 /*0x5*/,
    RemoveUnstartedFailedDevice = 6 /*0x6*/,
    MaxDeviceDeleteType         = 7 /*0x7*/
}PNP_DEVICE_DELETE_TYPE, *PPNP_DEVICE_DELETE_TYPE;

typedef enum _PNP_DEVNODE_QUERY_REBALANCE_VETO_REASON  // 5 elements, 0x4 bytes
{
    DeviceQueryRebalanceSucceeded         = 0 /*0x0*/,
    DeviceQueryStopFailed                 = 1 /*0x1*/,
    DeviceFailedGetNewResourceRequirement = 2 /*0x2*/,
    DeviceInUnexpectedState               = 3 /*0x3*/,
    DeviceNotSupportQueryRebalance        = 4 /*0x4*/
}PNP_DEVNODE_QUERY_REBALANCE_VETO_REASON, *PPNP_DEVNODE_QUERY_REBALANCE_VETO_REASON;

typedef enum _PNP_DEVNODE_STATE  // 22 elements, 0x4 bytes
{
    DeviceNodeUnspecified            = 768 /*0x300*/,
    DeviceNodeUninitialized          = 769 /*0x301*/,
    DeviceNodeInitialized            = 770 /*0x302*/,
    DeviceNodeDriversAdded           = 771 /*0x303*/,
    DeviceNodeResourcesAssigned      = 772 /*0x304*/,
    DeviceNodeStartPending           = 773 /*0x305*/,
    DeviceNodeStartCompletion        = 774 /*0x306*/,
    DeviceNodeStartPostWork          = 775 /*0x307*/,
    DeviceNodeStarted                = 776 /*0x308*/,
    DeviceNodeQueryStopped           = 777 /*0x309*/,
    DeviceNodeStopped                = 778 /*0x30A*/,
    DeviceNodeRestartCompletion      = 779 /*0x30B*/,
    DeviceNodeEnumeratePending       = 780 /*0x30C*/,
    DeviceNodeEnumerateCompletion    = 781 /*0x30D*/,
    DeviceNodeAwaitingQueuedDeletion = 782 /*0x30E*/,
    DeviceNodeAwaitingQueuedRemoval  = 783 /*0x30F*/,
    DeviceNodeQueryRemoved           = 784 /*0x310*/,
    DeviceNodeRemovePendingCloses    = 785 /*0x311*/,
    DeviceNodeRemoved                = 786 /*0x312*/,
    DeviceNodeDeletePendingCloses    = 787 /*0x313*/,
    DeviceNodeDeleted                = 788 /*0x314*/,
    MaxDeviceNodeState               = 789 /*0x315*/
}PNP_DEVNODE_STATE, *PPNP_DEVNODE_STATE;

typedef enum _PNP_REBALANCE_FAILURE  // 7 elements, 0x4 bytes
{
    RebalanceFailureNone                    = 0 /*0x0*/,
    RebalanceFailureDisabled                = 1 /*0x1*/,
    RebalanceFailureNoMemory                = 2 /*0x2*/,
    RebalanceFailureQueryStopUnexpectedVeto = 3 /*0x3*/,
    RebalanceFailureNoRequirements          = 4 /*0x4*/,
    RebalanceFailureNoCandidates            = 5 /*0x5*/,
    RebalanceFailureNoConfiguration         = 6 /*0x6*/
}PNP_REBALANCE_FAILURE, *PPNP_REBALANCE_FAILURE;

typedef enum _PNP_REBALANCE_REASON  // 3 elements, 0x4 bytes
{
    RebalanceReasonUnknown             = 0 /*0x0*/,
    RebalanceReasonRequirementsChanged = 1 /*0x1*/,
    RebalanceReasonNewDevice           = 2 /*0x2*/
}PNP_REBALANCE_REASON, *PPNP_REBALANCE_REASON;

typedef enum _PNP_VETO_TYPE  // 13 elements, 0x4 bytes
{
    PNP_VetoTypeUnknown          = 0 /*0x0*/,
    PNP_VetoLegacyDevice         = 1 /*0x1*/,
    PNP_VetoPendingClose         = 2 /*0x2*/,
    PNP_VetoWindowsApp           = 3 /*0x3*/,
    PNP_VetoWindowsService       = 4 /*0x4*/,
    PNP_VetoOutstandingOpen      = 5 /*0x5*/,
    PNP_VetoDevice               = 6 /*0x6*/,
    PNP_VetoDriver               = 7 /*0x7*/,
    PNP_VetoIllegalDeviceRequest = 8 /*0x8*/,
    PNP_VetoInsufficientPower    = 9 /*0x9*/,
    PNP_VetoNonDisableable       = 10 /*0xA*/,
    PNP_VetoLegacyDriver         = 11 /*0xB*/,
    PNP_VetoInsufficientRights   = 12 /*0xC*/
}PNP_VETO_TYPE, *PPNP_VETO_TYPE;

typedef enum _PO_CS_DEVICE_NOTIFICATION_TYPE  // 6 elements, 0x4 bytes
{
    PoCsDeviceNotificationStorage  = 0 /*0x0*/,
    PoCsDeviceNotificationWiFi     = 1 /*0x1*/,
    PoCsDeviceNotificationMbn      = 2 /*0x2*/,
    PoCsDeviceNotificationAudio    = 3 /*0x3*/,
    PoCsDeviceNotificationEthernet = 4 /*0x4*/,
    PoCsDeviceNotificationMaximum  = 5 /*0x5*/
}PO_CS_DEVICE_NOTIFICATION_TYPE, *PPO_CS_DEVICE_NOTIFICATION_TYPE;

typedef enum _PO_FX_PERF_STATE_TYPE  // 3 elements, 0x4 bytes
{
    PoFxPerfStateTypeDiscrete = 0 /*0x0*/,
    PoFxPerfStateTypeRange    = 1 /*0x1*/,
    PoFxPerfStateTypeMaximum  = 2 /*0x2*/
}PO_FX_PERF_STATE_TYPE, *PPO_FX_PERF_STATE_TYPE;

typedef enum _PO_FX_PERF_STATE_UNIT  // 4 elements, 0x4 bytes
{
    PoFxPerfStateUnitOther     = 0 /*0x0*/,
    PoFxPerfStateUnitFrequency = 1 /*0x1*/,
    PoFxPerfStateUnitBandwidth = 2 /*0x2*/,
    PoFxPerfStateUnitMaximum   = 3 /*0x3*/
}PO_FX_PERF_STATE_UNIT, *PPO_FX_PERF_STATE_UNIT;

typedef enum _PO_HIBER_FORCE_DISABLE_REASON  // 3 elements, 0x4 bytes
{
    PoHiberForceDisableReasonPolicy      = 0 /*0x0*/,
    PoHiberForceDisableReasonGuardedHost = 1 /*0x1*/,
    PoHiberForceDisableReasonMax         = 2 /*0x2*/
}PO_HIBER_FORCE_DISABLE_REASON, *PPO_HIBER_FORCE_DISABLE_REASON;

typedef enum _PO_MODERN_SLEEP_ACTION  // 5 elements, 0x4 bytes
{
    PoModernSleepActionGlobalActivatorsVeto               = 0 /*0x0*/,
    PoModernSleepActionNonBlockingPhases                  = 1 /*0x1*/,
    PoModernSleepActionForceIdle                          = 2 /*0x2*/,
    PoModernSleepActionMinimalBlockingNotificationClients = 3 /*0x3*/,
    PoModernSleepActionMax                                = 4 /*0x4*/
}PO_MODERN_SLEEP_ACTION, *PPO_MODERN_SLEEP_ACTION;

typedef enum _POLICY_AUDIT_EVENT_TYPE  // 9 elements, 0x4 bytes
{
    AuditCategorySystem                 = 0 /*0x0*/,
    AuditCategoryLogon                  = 1 /*0x1*/,
    AuditCategoryObjectAccess           = 2 /*0x2*/,
    AuditCategoryPrivilegeUse           = 3 /*0x3*/,
    AuditCategoryDetailedTracking       = 4 /*0x4*/,
    AuditCategoryPolicyChange           = 5 /*0x5*/,
    AuditCategoryAccountManagement      = 6 /*0x6*/,
    AuditCategoryDirectoryServiceAccess = 7 /*0x7*/,
    AuditCategoryAccountLogon           = 8 /*0x8*/
}POLICY_AUDIT_EVENT_TYPE, *PPOLICY_AUDIT_EVENT_TYPE;

typedef enum _POOL_TYPE  // 23 elements, 0x4 bytes
{
    NonPagedPool                         = 0 /*0x0*/,
    NonPagedPoolExecute                  = 0 /*0x0*/,
    PagedPool                            = 1 /*0x1*/,
    NonPagedPoolMustSucceed              = 2 /*0x2*/,
    DontUseThisType                      = 3 /*0x3*/,
    NonPagedPoolCacheAligned             = 4 /*0x4*/,
    PagedPoolCacheAligned                = 5 /*0x5*/,
    NonPagedPoolCacheAlignedMustS        = 6 /*0x6*/,
    MaxPoolType                          = 7 /*0x7*/,
    NonPagedPoolBase                     = 0 /*0x0*/,
    NonPagedPoolBaseMustSucceed          = 2 /*0x2*/,
    NonPagedPoolBaseCacheAligned         = 4 /*0x4*/,
    NonPagedPoolBaseCacheAlignedMustS    = 6 /*0x6*/,
    NonPagedPoolSession                  = 32 /*0x20*/,
    PagedPoolSession                     = 33 /*0x21*/,
    NonPagedPoolMustSucceedSession       = 34 /*0x22*/,
    DontUseThisTypeSession               = 35 /*0x23*/,
    NonPagedPoolCacheAlignedSession      = 36 /*0x24*/,
    PagedPoolCacheAlignedSession         = 37 /*0x25*/,
    NonPagedPoolCacheAlignedMustSSession = 38 /*0x26*/,
    NonPagedPoolNx                       = 512 /*0x200*/,
    NonPagedPoolNxCacheAligned           = 516 /*0x204*/,
    NonPagedPoolSessionNx                = 544 /*0x220*/
}POOL_TYPE, *PPOOL_TYPE;

typedef enum _POP_DEVICE_IDLE_TYPE  // 2 elements, 0x4 bytes
{
    DeviceIdleNormal = 0 /*0x0*/,
    DeviceIdleDisk   = 1 /*0x1*/
}POP_DEVICE_IDLE_TYPE, *PPOP_DEVICE_IDLE_TYPE;

typedef enum _POP_IO_STATUS  // 3 elements, 0x4 bytes
{
    IoReady   = 0 /*0x0*/,
    IoPending = 1 /*0x1*/,
    IoDone    = 2 /*0x2*/
}POP_IO_STATUS, *PPOP_IO_STATUS;

typedef enum _POP_SLEEP_CHECKPOINT  // 40 elements, 0x4 bytes
{
    PopSleepCheckpointInvalid                          = 0 /*0x0*/,
    PopSleepCheckpointPowerTransitionStart             = 1 /*0x1*/,
    PopSleepCheckpointSuspendAppsBefore                = 2 /*0x2*/,
    PopSleepCheckpointSuspendAppsAfter                 = 3 /*0x3*/,
    PopSleepCheckpointSuspendServicesBefore            = 4 /*0x4*/,
    PopSleepCheckpointSuspendServicesAfter             = 5 /*0x5*/,
    PopSleepCheckpointNotifySuperfetchBefore           = 6 /*0x6*/,
    PopSleepCheckpointNotifySuperfetchAfter            = 7 /*0x7*/,
    PopSleepCheckpointNotifyCallbacksBefore            = 8 /*0x8*/,
    PopSleepCheckpointNotifyCallbacksAfter             = 9 /*0x9*/,
    PopSleepCheckpointSleepTransactionCommitted        = 10 /*0xA*/,
    PopSleepCheckpointQueryDriversBefore               = 11 /*0xB*/,
    PopSleepCheckpointQueryDriversAfter                = 12 /*0xC*/,
    PopSleepCheckpointAllocatingHiberContext           = 13 /*0xD*/,
    PopSleepCheckpointSuspendDriversBefore             = 14 /*0xE*/,
    PopSleepCheckpointPreSleepNotification             = 16 /*0x10*/,
    PopSleepCheckpointInterruptsDisabledBegin          = 17 /*0x11*/,
    PopSleepCheckpointInvokeHandlerBefore              = 18 /*0x12*/,
    PopSleepCheckpointSaveHiberContextBegin            = 19 /*0x13*/,
    PopSleepCheckpointInitializeDumpStackFailed        = 20 /*0x14*/,
    PopSleepCheckpointHiberWriteFailed                 = 21 /*0x15*/,
    PopSleepCheckpointHiberFileTooSmall                = 22 /*0x16*/,
    PopSleepCheckpointSaveHiberContextFailed           = 23 /*0x17*/,
    PopSleepCheckpointSaveHiberContextEnd              = 24 /*0x18*/,
    PopSleepCheckpointHiberKernelHandoff               = 25 /*0x19*/,
    PopSleepCheckpointInvokeHandlerAfter               = 26 /*0x1A*/,
    PopSleepCheckpointReadHiberfileBefore              = 27 /*0x1B*/,
    PopSleepCheckpointInitializeDumpStackForReadFailed = 28 /*0x1C*/,
    PopSleepCheckpointHiberReadFailed                  = 29 /*0x1D*/,
    PopSleepCheckpointChecksumFailure                  = 30 /*0x1E*/,
    PopSleepCheckpointDecompressionFailed              = 31 /*0x1F*/,
    PopSleepCheckpointReadHiberfileAfter               = 32 /*0x20*/,
    PopSleepCheckpointInterruptsDisabledEnd            = 33 /*0x21*/,
    PopSleepCheckpointWakeDriversAfter                 = 36 /*0x24*/,
    PopSleepCheckpointResumeAppsBefore                 = 37 /*0x25*/,
    PopSleepCheckpointResumeAppsAfter                  = 38 /*0x26*/,
    PopSleepCheckpointResumeServicesBefore             = 39 /*0x27*/,
    PopSleepCheckpointResumeServicesAfter              = 40 /*0x28*/,
    PopSleepCheckpointPowerTransitionEnd               = 41 /*0x29*/,
    PopSleepCheckpointMaximum                          = 42 /*0x2A*/
}POP_SLEEP_CHECKPOINT, *PPOP_SLEEP_CHECKPOINT;

typedef enum _POWER_ACTION  // 9 elements, 0x4 bytes
{
    PowerActionNone          = 0 /*0x0*/,
    PowerActionReserved      = 1 /*0x1*/,
    PowerActionSleep         = 2 /*0x2*/,
    PowerActionHibernate     = 3 /*0x3*/,
    PowerActionShutdown      = 4 /*0x4*/,
    PowerActionShutdownReset = 5 /*0x5*/,
    PowerActionShutdownOff   = 6 /*0x6*/,
    PowerActionWarmEject     = 7 /*0x7*/,
    PowerActionDisplayOff    = 8 /*0x8*/
}POWER_ACTION, *PPOWER_ACTION;

typedef enum _POWER_INFORMATION_LEVEL_INTERNAL  // 34 elements, 0x4 bytes
{
    PowerInternalAcpiInterfaceRegister                   = 0 /*0x0*/,
    PowerInternalS0LowPowerIdleInfo                      = 1 /*0x1*/,
    PowerInternalReapplyBrightnessSettings               = 2 /*0x2*/,
    PowerInternalUserAbsencePrediction                   = 3 /*0x3*/,
    PowerInternalUserAbsencePredictionCapability         = 4 /*0x4*/,
    PowerInternalPoProcessorLatencyHint                  = 5 /*0x5*/,
    PowerInternalStandbyNetworkRequest                   = 6 /*0x6*/,
    PowerInternalDirtyTransitionInformation              = 7 /*0x7*/,
    PowerInternalSetBackgroundTaskState                  = 8 /*0x8*/,
    PowerInternalTtmOpenTerminal                         = 9 /*0x9*/,
    PowerInformationInternalTtmFirst                     = 9 /*0x9*/,
    PowerInternalTtmCreateTerminal                       = 10 /*0xA*/,
    PowerInternalTtmEvacuateDevices                      = 11 /*0xB*/,
    PowerInternalTtmCreateTerminalEventQueue             = 12 /*0xC*/,
    PowerInternalTtmGetTerminalEvent                     = 13 /*0xD*/,
    PowerInternalTtmSetDefaultDeviceAssignment           = 14 /*0xE*/,
    PowerInternalTtmAssignDevice                         = 15 /*0xF*/,
    PowerInternalTtmSetDisplayState                      = 16 /*0x10*/,
    PowerInternalTtmSetDisplayTimeouts                   = 17 /*0x11*/,
    PowerInformationInternalTtmLast                      = 17 /*0x11*/,
    PowerInternalBootSessionStandbyActivationInformation = 18 /*0x12*/,
    PowerInternalSessionPowerState                       = 19 /*0x13*/,
    PowerInternalSessionTerminalInput                    = 20 /*0x14*/,
    PowerInternalSetWatchdog                             = 21 /*0x15*/,
    PowerInternalPhysicalPowerButtonPressInfoAtBoot      = 22 /*0x16*/,
    PowerInternalExternalMonitorConnected                = 23 /*0x17*/,
    PowerInternalHighPrecisionBrightnessSettings         = 24 /*0x18*/,
    PowerInternalWinrtScreenToggle                       = 25 /*0x19*/,
    PowerInternalVirtualHeterogeneityDisable             = 26 /*0x1A*/,
    PowerInternalTransitionCheckpoint                    = 27 /*0x1B*/,
    PowerInternalInputControllerState                    = 28 /*0x1C*/,
    PowerInternalFirmwareResetReason                     = 29 /*0x1D*/,
    PowerInternalVirtualHeterogeneitySupport             = 30 /*0x1E*/,
    PowerInformationInternalMaximum                      = 31 /*0x1F*/
}POWER_INFORMATION_LEVEL_INTERNAL, *PPOWER_INFORMATION_LEVEL_INTERNAL;

typedef enum _POWER_POLICY_DEVICE_TYPE  // 16 elements, 0x4 bytes
{
    PolicyDeviceSystemButton                   = 0 /*0x0*/,
    PolicyDeviceThermalZone                    = 1 /*0x1*/,
    PolicyDeviceBattery                        = 2 /*0x2*/,
    PolicyDeviceMemory                         = 3 /*0x3*/,
    PolicyInitiatePowerActionAPI               = 4 /*0x4*/,
    PolicySetPowerStateAPI                     = 5 /*0x5*/,
    PolicyImmediateDozeS4                      = 6 /*0x6*/,
    PolicySystemIdle                           = 7 /*0x7*/,
    PolicyDeviceWakeAlarm                      = 8 /*0x8*/,
    PolicyDeviceFan                            = 9 /*0x9*/,
    PolicyCsBatterySaver                       = 10 /*0xA*/,
    PolicyImmediateDozeS4Predicted             = 11 /*0xB*/,
    PolicyImmediateDozeS4PredictedNoWake       = 12 /*0xC*/,
    PolicyImmediateDozeS4AdaptiveBudget        = 13 /*0xD*/,
    PolicyImmediateDozeS4AdaptiveReserveNoWake = 14 /*0xE*/,
    PolicyDeviceMax                            = 15 /*0xF*/
}POWER_POLICY_DEVICE_TYPE, *PPOWER_POLICY_DEVICE_TYPE;

typedef enum _POWER_REQUEST_TYPE  // 4 elements, 0x4 bytes
{
    PowerRequestDisplayRequired   = 0 /*0x0*/,
    PowerRequestSystemRequired    = 1 /*0x1*/,
    PowerRequestAwayModeRequired  = 2 /*0x2*/,
    PowerRequestExecutionRequired = 3 /*0x3*/
}POWER_REQUEST_TYPE, *PPOWER_REQUEST_TYPE;

typedef enum _POWER_REQUEST_TYPE_INTERNAL  // 7 elements, 0x4 bytes
{
    PowerRequestDisplayRequiredInternal   = 0 /*0x0*/,
    PowerRequestSystemRequiredInternal    = 1 /*0x1*/,
    PowerRequestAwayModeRequiredInternal  = 2 /*0x2*/,
    PowerRequestExecutionRequiredInternal = 3 /*0x3*/,
    PowerRequestPerfBoostRequiredInternal = 4 /*0x4*/,
    PowerRequestActiveLockScreenInternal  = 5 /*0x5*/,
    PowerRequestInternalInvalid           = 6 /*0x6*/
}POWER_REQUEST_TYPE_INTERNAL, *PPOWER_REQUEST_TYPE_INTERNAL;

typedef enum _POWER_STATE_TYPE  // 2 elements, 0x4 bytes
{
    SystemPowerState = 0 /*0x0*/,
    DevicePowerState = 1 /*0x1*/
}POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER  // 10 elements, 0x4 bytes
{
    LookasideSmallIrpList      = 0 /*0x0*/,
    LookasideMediumIrpList     = 1 /*0x1*/,
    LookasideLargeIrpList      = 2 /*0x2*/,
    LookasideMdlList           = 3 /*0x3*/,
    LookasideCreateInfoList    = 4 /*0x4*/,
    LookasideNameBufferList    = 5 /*0x5*/,
    LookasideTwilightList      = 6 /*0x6*/,
    LookasideCompletionList    = 7 /*0x7*/,
    LookasideScratchBufferList = 8 /*0x8*/,
    LookasideMaximumList       = 9 /*0x9*/
}PP_NPAGED_LOOKASIDE_NUMBER, *PPP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _PPM_IDLE_BUCKET_TIME_TYPE  // 3 elements, 0x4 bytes
{
    PpmIdleBucketTimeInQpc   = 0 /*0x0*/,
    PpmIdleBucketTimeIn100ns = 1 /*0x1*/,
    PpmIdleBucketTimeMaximum = 2 /*0x2*/
}PPM_IDLE_BUCKET_TIME_TYPE, *PPPM_IDLE_BUCKET_TIME_TYPE;

typedef enum _PROC_HYPERVISOR_STATE  // 4 elements, 0x4 bytes
{
    ProcHypervisorNone       = 0 /*0x0*/,
    ProcHypervisorPresent    = 1 /*0x1*/,
    ProcHypervisorPower      = 2 /*0x2*/,
    ProcHypervisorHvCounters = 3 /*0x3*/
}PROC_HYPERVISOR_STATE, *PPROC_HYPERVISOR_STATE;

typedef enum _PROCESS_SECTION_TYPE  // 5 elements, 0x4 bytes
{
    ProcessSectionData           = 0 /*0x0*/,
    ProcessSectionImage          = 1 /*0x1*/,
    ProcessSectionImageNx        = 2 /*0x2*/,
    ProcessSectionPagefileBacked = 3 /*0x3*/,
    ProcessSectionMax            = 4 /*0x4*/
}PROCESS_SECTION_TYPE, *PPROCESS_SECTION_TYPE;

typedef enum _PROCESS_TERMINATE_REQUEST_REASON  // 5 elements, 0x4 bytes
{
    ProcessTerminateRequestReasonNone    = 0 /*0x0*/,
    ProcessTerminateCommitFail           = 1 /*0x1*/,
    ProcessTerminateRfgViolation         = 2 /*0x2*/,
    ProcessTerminateRfgAttachedViolation = 3 /*0x3*/,
    ProcessTerminateRequestReasonMax     = 4 /*0x4*/
}PROCESS_TERMINATE_REQUEST_REASON, *PPROCESS_TERMINATE_REQUEST_REASON;

typedef enum _PROCESS_VA_TYPE  // 4 elements, 0x4 bytes
{
    ProcessVAImage   = 0 /*0x0*/,
    ProcessVASection = 1 /*0x1*/,
    ProcessVAPrivate = 2 /*0x2*/,
    ProcessVAMax     = 3 /*0x3*/
}PROCESS_VA_TYPE, *PPROCESS_VA_TYPE;

typedef enum _PROCESSOR_CACHE_TYPE  // 4 elements, 0x4 bytes
{
    CacheUnified     = 0 /*0x0*/,
    CacheInstruction = 1 /*0x1*/,
    CacheData        = 2 /*0x2*/,
    CacheTrace       = 3 /*0x3*/
}PROCESSOR_CACHE_TYPE, *PPROCESSOR_CACHE_TYPE;

typedef enum _PROFILE_DEPARTURE_STYLE  // 4 elements, 0x4 bytes
{
    PDS_UPDATE_DEFAULT      = 1 /*0x1*/,
    PDS_UPDATE_ON_REMOVE    = 2 /*0x2*/,
    PDS_UPDATE_ON_INTERFACE = 3 /*0x3*/,
    PDS_UPDATE_ON_EJECT     = 4 /*0x4*/
}PROFILE_DEPARTURE_STYLE, *PPROFILE_DEPARTURE_STYLE;

typedef enum _PROFILE_STATUS  // 5 elements, 0x4 bytes
{
    DOCK_NOTDOCKDEVICE      = 0 /*0x0*/,
    DOCK_QUIESCENT          = 1 /*0x1*/,
    DOCK_ARRIVING           = 2 /*0x2*/,
    DOCK_DEPARTING          = 3 /*0x3*/,
    DOCK_EJECTIRP_COMPLETED = 4 /*0x4*/
}PROFILE_STATUS, *PPROFILE_STATUS;

typedef enum _PS_ATTRIBUTE_NUM  // 27 elements, 0x4 bytes
{
    PsAttributeParentProcess                = 0 /*0x0*/,
    PsAttributeDebugObject                  = 1 /*0x1*/,
    PsAttributeToken                        = 2 /*0x2*/,
    PsAttributeClientId                     = 3 /*0x3*/,
    PsAttributeTebAddress                   = 4 /*0x4*/,
    PsAttributeImageName                    = 5 /*0x5*/,
    PsAttributeImageInfo                    = 6 /*0x6*/,
    PsAttributeMemoryReserve                = 7 /*0x7*/,
    PsAttributePriorityClass                = 8 /*0x8*/,
    PsAttributeErrorMode                    = 9 /*0x9*/,
    PsAttributeStdHandleInfo                = 10 /*0xA*/,
    PsAttributeHandleList                   = 11 /*0xB*/,
    PsAttributeGroupAffinity                = 12 /*0xC*/,
    PsAttributePreferredNode                = 13 /*0xD*/,
    PsAttributeIdealProcessor               = 14 /*0xE*/,
    PsAttributeUmsThread                    = 15 /*0xF*/,
    PsAttributeMitigationOptions            = 16 /*0x10*/,
    PsAttributeProtectionLevel              = 17 /*0x11*/,
    PsAttributeSecureProcess                = 18 /*0x12*/,
    PsAttributeJobList                      = 19 /*0x13*/,
    PsAttributeChildProcessPolicy           = 20 /*0x14*/,
    PsAttributeAllApplicationPackagesPolicy = 21 /*0x15*/,
    PsAttributeWin32kFilter                 = 22 /*0x16*/,
    PsAttributeSafeOpenPromptOriginClaim    = 23 /*0x17*/,
    PsAttributeBnoIsolation                 = 24 /*0x18*/,
    PsAttributeDesktopAppPolicy             = 25 /*0x19*/,
    PsAttributeMax                          = 26 /*0x1A*/
}PS_ATTRIBUTE_NUM, *PPS_ATTRIBUTE_NUM;

typedef enum _PS_CREATE_STATE  // 8 elements, 0x4 bytes
{
    PsCreateInitialState        = 0 /*0x0*/,
    PsCreateFailOnFileOpen      = 1 /*0x1*/,
    PsCreateFailOnSectionCreate = 2 /*0x2*/,
    PsCreateFailExeFormat       = 3 /*0x3*/,
    PsCreateFailMachineMismatch = 4 /*0x4*/,
    PsCreateFailExeName         = 5 /*0x5*/,
    PsCreateSuccess             = 6 /*0x6*/,
    PsCreateMaximumStates       = 7 /*0x7*/
}PS_CREATE_STATE, *PPS_CREATE_STATE;

typedef enum _PS_MITIGATION_OPTION  // 20 elements, 0x4 bytes
{
    PS_MITIGATION_OPTION_NX                           = 0 /*0x0*/,
    PS_MITIGATION_OPTION_SEHOP                        = 1 /*0x1*/,
    PS_MITIGATION_OPTION_FORCE_RELOCATE_IMAGES        = 2 /*0x2*/,
    PS_MITIGATION_OPTION_HEAP_TERMINATE               = 3 /*0x3*/,
    PS_MITIGATION_OPTION_BOTTOM_UP_ASLR               = 4 /*0x4*/,
    PS_MITIGATION_OPTION_HIGH_ENTROPY_ASLR            = 5 /*0x5*/,
    PS_MITIGATION_OPTION_STRICT_HANDLE_CHECKS         = 6 /*0x6*/,
    PS_MITIGATION_OPTION_WIN32K_SYSTEM_CALL_DISABLE   = 7 /*0x7*/,
    PS_MITIGATION_OPTION_EXTENSION_POINT_DISABLE      = 8 /*0x8*/,
    PS_MITIGATION_OPTION_PROHIBIT_DYNAMIC_CODE        = 9 /*0x9*/,
    PS_MITIGATION_OPTION_CONTROL_FLOW_GUARD           = 10 /*0xA*/,
    PS_MITIGATION_OPTION_BLOCK_NON_MICROSOFT_BINARIES = 11 /*0xB*/,
    PS_MITIGATION_OPTION_FONT_DISABLE                 = 12 /*0xC*/,
    PS_MITIGATION_OPTION_IMAGE_LOAD_NO_REMOTE         = 13 /*0xD*/,
    PS_MITIGATION_OPTION_IMAGE_LOAD_NO_LOW_LABEL      = 14 /*0xE*/,
    PS_MITIGATION_OPTION_IMAGE_LOAD_PREFER_SYSTEM32   = 15 /*0xF*/,
    PS_MITIGATION_OPTION_RETURN_FLOW_GUARD            = 16 /*0x10*/,
    PS_MITIGATION_OPTION_LOADER_INTEGRITY_CONTINUITY  = 17 /*0x11*/,
    PS_MITIGATION_OPTION_STRICT_CONTROL_FLOW_GUARD    = 18 /*0x12*/,
    PS_MITIGATION_OPTION_RESTRICT_SET_THREAD_CONTEXT  = 19 /*0x13*/
}PS_MITIGATION_OPTION, *PPS_MITIGATION_OPTION;

typedef enum _PS_PROTECTED_SIGNER  // 10 elements, 0x4 bytes
{
    PsProtectedSignerNone         = 0 /*0x0*/,
    PsProtectedSignerAuthenticode = 1 /*0x1*/,
    PsProtectedSignerCodeGen      = 2 /*0x2*/,
    PsProtectedSignerAntimalware  = 3 /*0x3*/,
    PsProtectedSignerLsa          = 4 /*0x4*/,
    PsProtectedSignerWindows      = 5 /*0x5*/,
    PsProtectedSignerWinTcb       = 6 /*0x6*/,
    PsProtectedSignerWinSystem    = 7 /*0x7*/,
    PsProtectedSignerApp          = 8 /*0x8*/,
    PsProtectedSignerMax          = 9 /*0x9*/
}PS_PROTECTED_SIGNER, *PPS_PROTECTED_SIGNER;

typedef enum _PS_PROTECTED_TYPE  // 4 elements, 0x4 bytes
{
    PsProtectedTypeNone           = 0 /*0x0*/,
    PsProtectedTypeProtectedLight = 1 /*0x1*/,
    PsProtectedTypeProtected      = 2 /*0x2*/,
    PsProtectedTypeMax            = 3 /*0x3*/
}PS_PROTECTED_TYPE, *PPS_PROTECTED_TYPE;

typedef enum _PS_RESOURCE_TYPE  // 5 elements, 0x4 bytes
{
    PsResourceNonPagedPool = 0 /*0x0*/,
    PsResourcePagedPool    = 1 /*0x1*/,
    PsResourcePageFile     = 2 /*0x2*/,
    PsResourceWorkingSet   = 3 /*0x3*/,
    PsResourceMax          = 4 /*0x4*/
}PS_RESOURCE_TYPE, *PPS_RESOURCE_TYPE;

typedef enum _PS_STD_HANDLE_STATE  // 4 elements, 0x4 bytes
{
    PsNeverDuplicate     = 0 /*0x0*/,
    PsRequestDuplicate   = 1 /*0x1*/,
    PsAlwaysDuplicate    = 2 /*0x2*/,
    PsMaxStdHandleStates = 3 /*0x3*/
}PS_STD_HANDLE_STATE, *PPS_STD_HANDLE_STATE;

typedef enum _PS_WAKE_REASON  // 8 elements, 0x4 bytes
{
    PsWakeReasonUser              = 0 /*0x0*/,
    PsWakeReasonExecutionRequired = 1 /*0x1*/,
    PsWakeReasonKernel            = 2 /*0x2*/,
    PsWakeReasonInstrumentation   = 3 /*0x3*/,
    PsWakeReasonPreserveProcess   = 4 /*0x4*/,
    PsWakeReasonActivityReference = 5 /*0x5*/,
    PsWakeReasonWorkOnBehalf      = 6 /*0x6*/,
    PsMaxWakeReasons              = 7 /*0x7*/
}PS_WAKE_REASON, *PPS_WAKE_REASON;

typedef enum _REG_NOTIFY_CLASS  // 61 elements, 0x4 bytes
{
    RegNtDeleteKey                    = 0 /*0x0*/,
    RegNtPreDeleteKey                 = 0 /*0x0*/,
    RegNtSetValueKey                  = 1 /*0x1*/,
    RegNtPreSetValueKey               = 1 /*0x1*/,
    RegNtDeleteValueKey               = 2 /*0x2*/,
    RegNtPreDeleteValueKey            = 2 /*0x2*/,
    RegNtSetInformationKey            = 3 /*0x3*/,
    RegNtPreSetInformationKey         = 3 /*0x3*/,
    RegNtRenameKey                    = 4 /*0x4*/,
    RegNtPreRenameKey                 = 4 /*0x4*/,
    RegNtEnumerateKey                 = 5 /*0x5*/,
    RegNtPreEnumerateKey              = 5 /*0x5*/,
    RegNtEnumerateValueKey            = 6 /*0x6*/,
    RegNtPreEnumerateValueKey         = 6 /*0x6*/,
    RegNtQueryKey                     = 7 /*0x7*/,
    RegNtPreQueryKey                  = 7 /*0x7*/,
    RegNtQueryValueKey                = 8 /*0x8*/,
    RegNtPreQueryValueKey             = 8 /*0x8*/,
    RegNtQueryMultipleValueKey        = 9 /*0x9*/,
    RegNtPreQueryMultipleValueKey     = 9 /*0x9*/,
    RegNtPreCreateKey                 = 10 /*0xA*/,
    RegNtPostCreateKey                = 11 /*0xB*/,
    RegNtPreOpenKey                   = 12 /*0xC*/,
    RegNtPostOpenKey                  = 13 /*0xD*/,
    RegNtKeyHandleClose               = 14 /*0xE*/,
    RegNtPreKeyHandleClose            = 14 /*0xE*/,
    RegNtPostDeleteKey                = 15 /*0xF*/,
    RegNtPostSetValueKey              = 16 /*0x10*/,
    RegNtPostDeleteValueKey           = 17 /*0x11*/,
    RegNtPostSetInformationKey        = 18 /*0x12*/,
    RegNtPostRenameKey                = 19 /*0x13*/,
    RegNtPostEnumerateKey             = 20 /*0x14*/,
    RegNtPostEnumerateValueKey        = 21 /*0x15*/,
    RegNtPostQueryKey                 = 22 /*0x16*/,
    RegNtPostQueryValueKey            = 23 /*0x17*/,
    RegNtPostQueryMultipleValueKey    = 24 /*0x18*/,
    RegNtPostKeyHandleClose           = 25 /*0x19*/,
    RegNtPreCreateKeyEx               = 26 /*0x1A*/,
    RegNtPostCreateKeyEx              = 27 /*0x1B*/,
    RegNtPreOpenKeyEx                 = 28 /*0x1C*/,
    RegNtPostOpenKeyEx                = 29 /*0x1D*/,
    RegNtPreFlushKey                  = 30 /*0x1E*/,
    RegNtPostFlushKey                 = 31 /*0x1F*/,
    RegNtPreLoadKey                   = 32 /*0x20*/,
    RegNtPostLoadKey                  = 33 /*0x21*/,
    RegNtPreUnLoadKey                 = 34 /*0x22*/,
    RegNtPostUnLoadKey                = 35 /*0x23*/,
    RegNtPreQueryKeySecurity          = 36 /*0x24*/,
    RegNtPostQueryKeySecurity         = 37 /*0x25*/,
    RegNtPreSetKeySecurity            = 38 /*0x26*/,
    RegNtPostSetKeySecurity           = 39 /*0x27*/,
    RegNtCallbackObjectContextCleanup = 40 /*0x28*/,
    RegNtPreRestoreKey                = 41 /*0x29*/,
    RegNtPostRestoreKey               = 42 /*0x2A*/,
    RegNtPreSaveKey                   = 43 /*0x2B*/,
    RegNtPostSaveKey                  = 44 /*0x2C*/,
    RegNtPreReplaceKey                = 45 /*0x2D*/,
    RegNtPostReplaceKey               = 46 /*0x2E*/,
    RegNtPreQueryKeyName              = 47 /*0x2F*/,
    RegNtPostQueryKeyName             = 48 /*0x30*/,
    MaxRegNtNotifyClass               = 49 /*0x31*/
}REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef enum _ReplacesCorHdrNumericDefines  // 25 elements, 0x4 bytes
{
    COMIMAGE_FLAGS_ILONLY                      = 1 /*0x1*/,
    COMIMAGE_FLAGS_32BITREQUIRED               = 2 /*0x2*/,
    COMIMAGE_FLAGS_IL_LIBRARY                  = 4 /*0x4*/,
    COMIMAGE_FLAGS_STRONGNAMESIGNED            = 8 /*0x8*/,
    COMIMAGE_FLAGS_NATIVE_ENTRYPOINT           = 16 /*0x10*/,
    COMIMAGE_FLAGS_TRACKDEBUGDATA              = 65536 /*0x10000*/,
    COMIMAGE_FLAGS_32BITPREFERRED              = 131072 /*0x20000*/,
    COR_VERSION_MAJOR_V2                       = 2 /*0x2*/,
    COR_VERSION_MAJOR                          = 2 /*0x2*/,
    COR_VERSION_MINOR                          = 5 /*0x5*/,
    COR_DELETED_NAME_LENGTH                    = 8 /*0x8*/,
    COR_VTABLEGAP_NAME_LENGTH                  = 8 /*0x8*/,
    NATIVE_TYPE_MAX_CB                         = 1 /*0x1*/,
    COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE       = 255 /*0xFF*/,
    IMAGE_COR_MIH_METHODRVA                    = 1 /*0x1*/,
    IMAGE_COR_MIH_EHRVA                        = 2 /*0x2*/,
    IMAGE_COR_MIH_BASICBLOCK                   = 8 /*0x8*/,
    COR_VTABLE_32BIT                           = 1 /*0x1*/,
    COR_VTABLE_64BIT                           = 2 /*0x2*/,
    COR_VTABLE_FROM_UNMANAGED                  = 4 /*0x4*/,
    COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8 /*0x8*/,
    COR_VTABLE_CALL_MOST_DERIVED               = 16 /*0x10*/,
    IMAGE_COR_EATJ_THUNK_SIZE                  = 32 /*0x20*/,
    MAX_CLASS_NAME                             = 1024 /*0x400*/,
    MAX_PACKAGE_NAME                           = 1024 /*0x400*/
}ReplacesCorHdrNumericDefines, *PReplacesCorHdrNumericDefines;

typedef enum _REQUESTER_TYPE  // 3 elements, 0x4 bytes
{
    KernelRequester            = 0 /*0x0*/,
    UserProcessRequester       = 1 /*0x1*/,
    UserSharedServiceRequester = 2 /*0x2*/
}REQUESTER_TYPE, *PREQUESTER_TYPE;

typedef enum _RTL_GENERIC_COMPARE_RESULTS  // 3 elements, 0x4 bytes
{
    GenericLessThan    = 0 /*0x0*/,
    GenericGreaterThan = 1 /*0x1*/,
    GenericEqual       = 2 /*0x2*/
}RTL_GENERIC_COMPARE_RESULTS, *PRTL_GENERIC_COMPARE_RESULTS;

typedef enum _SE_WS_APPX_SIGNATURE_ORIGIN  // 5 elements, 0x4 bytes
{
    SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0 /*0x0*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN       = 1 /*0x1*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE      = 2 /*0x2*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS       = 3 /*0x3*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE    = 4 /*0x4*/
}SE_WS_APPX_SIGNATURE_ORIGIN, *PSE_WS_APPX_SIGNATURE_ORIGIN;

typedef enum _SECURITY_IMPERSONATION_LEVEL  // 4 elements, 0x4 bytes
{
    SecurityAnonymous      = 0 /*0x0*/,
    SecurityIdentification = 1 /*0x1*/,
    SecurityImpersonation  = 2 /*0x2*/,
    SecurityDelegation     = 3 /*0x3*/
}SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _SECURITY_OPERATION_CODE  // 4 elements, 0x4 bytes
{
    SetSecurityDescriptor    = 0 /*0x0*/,
    QuerySecurityDescriptor  = 1 /*0x1*/,
    DeleteSecurityDescriptor = 2 /*0x2*/,
    AssignSecurityDescriptor = 3 /*0x3*/
}SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _SEP_CACHED_HANDLES_ENTRY_TYPE  // 2 elements, 0x4 bytes
{
    SepCachedHandlesEntryLowbox       = 0 /*0x0*/,
    SepCachedHandlesEntryBnoIsolation = 1 /*0x1*/
}SEP_CACHED_HANDLES_ENTRY_TYPE, *PSEP_CACHED_HANDLES_ENTRY_TYPE;

typedef enum _SERVERSILO_STATE  // 5 elements, 0x4 bytes
{
    SERVERSILO_INITING       = 0 /*0x0*/,
    SERVERSILO_STARTED       = 1 /*0x1*/,
    SERVERSILO_SHUTTING_DOWN = 2 /*0x2*/,
    SERVERSILO_TERMINATING   = 3 /*0x3*/,
    SERVERSILO_TERMINATED    = 4 /*0x4*/
}SERVERSILO_STATE, *PSERVERSILO_STATE;

typedef enum _SLEEPSTUDY_SPM_SCENARIO_CS_EXIT  // 3 elements, 0x4 bytes
{
    SpmScenarioStopReasonUnspecified = 16 /*0x10*/,
    SpmScenarioStopReasonCsExit      = 17 /*0x11*/,
    SpmScenarioStopReasonMax         = 18 /*0x12*/
}SLEEPSTUDY_SPM_SCENARIO_CS_EXIT, *PSLEEPSTUDY_SPM_SCENARIO_CS_EXIT;

typedef enum _SYSTEM_POWER_CONDITION  // 4 elements, 0x4 bytes
{
    PoAc               = 0 /*0x0*/,
    PoDc               = 1 /*0x1*/,
    PoHot              = 2 /*0x2*/,
    PoConditionMaximum = 3 /*0x3*/
}SYSTEM_POWER_CONDITION, *PSYSTEM_POWER_CONDITION;

typedef enum _SYSTEM_POWER_STATE  // 8 elements, 0x4 bytes
{
    PowerSystemUnspecified = 0 /*0x0*/,
    PowerSystemWorking     = 1 /*0x1*/,
    PowerSystemSleeping1   = 2 /*0x2*/,
    PowerSystemSleeping2   = 3 /*0x3*/,
    PowerSystemSleeping3   = 4 /*0x4*/,
    PowerSystemHibernate   = 5 /*0x5*/,
    PowerSystemShutdown    = 6 /*0x6*/,
    PowerSystemMaximum     = 7 /*0x7*/
}SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _TlgBlob_t  // 7 elements, 0x4 bytes
{
    _TlgBlobNone      = 0 /*0x0*/,
    _TlgBlobEnd       = 1 /*0x1*/,
    _TlgBlobProvider  = 2 /*0x2*/,
    _TlgBlobEvent3    = 3 /*0x3*/,
    _TlgBlobProvider3 = 4 /*0x4*/,
    _TlgBlobEvent2    = 5 /*0x5*/,
    _TlgBlobMax       = 6 /*0x6*/
}TlgBlob_t, *PTlgBlob_t;

typedef enum _TlgIn_t  // 36 elements, 0x4 bytes
{
    TlgInNULL                 = 0 /*0x0*/,
    TlgInUNICODESTRING        = 1 /*0x1*/,
    TlgInANSISTRING           = 2 /*0x2*/,
    TlgInINT8                 = 3 /*0x3*/,
    TlgInUINT8                = 4 /*0x4*/,
    TlgInINT16                = 5 /*0x5*/,
    TlgInUINT16               = 6 /*0x6*/,
    TlgInINT32                = 7 /*0x7*/,
    TlgInUINT32               = 8 /*0x8*/,
    TlgInINT64                = 9 /*0x9*/,
    TlgInUINT64               = 10 /*0xA*/,
    TlgInFLOAT                = 11 /*0xB*/,
    TlgInDOUBLE               = 12 /*0xC*/,
    TlgInBOOL32               = 13 /*0xD*/,
    TlgInBINARY               = 14 /*0xE*/,
    TlgInGUID                 = 15 /*0xF*/,
    _TlgInPOINTER_unsupported = 16 /*0x10*/,
    TlgInFILETIME             = 17 /*0x11*/,
    TlgInSYSTEMTIME           = 18 /*0x12*/,
    TlgInSID                  = 19 /*0x13*/,
    TlgInHEXINT32             = 20 /*0x14*/,
    TlgInHEXINT64             = 21 /*0x15*/,
    TlgInCOUNTEDSTRING        = 22 /*0x16*/,
    TlgInCOUNTEDANSISTRING    = 23 /*0x17*/,
    _TlgInSTRUCT              = 24 /*0x18*/,
    _TlgInMax                 = 25 /*0x19*/,
    TlgInINTPTR               = 9 /*0x9*/,
    TlgInUINTPTR              = 10 /*0xA*/,
    TlgInPOINTER              = 21 /*0x15*/,
    _TlgInCcount              = 32 /*0x20*/,
    TlgInVcount               = 64 /*0x40*/,
    _TlgInChain               = 128 /*0x80*/,
    _TlgInCustom              = 96 /*0x60*/,
    _TlgInTypeMask            = 31 /*0x1F*/,
    _TlgInCountMask           = 96 /*0x60*/,
    _TlgInFlagMask            = 224 /*0xE0*/
}TlgIn_t, *PTlgIn_t;

typedef enum _TlgOut_t  // 24 elements, 0x4 bytes
{
    TlgOutNULL                 = 0 /*0x0*/,
    TlgOutNOPRINT              = 1 /*0x1*/,
    TlgOutSTRING               = 2 /*0x2*/,
    TlgOutBOOLEAN              = 3 /*0x3*/,
    TlgOutHEX                  = 4 /*0x4*/,
    TlgOutPID                  = 5 /*0x5*/,
    TlgOutTID                  = 6 /*0x6*/,
    TlgOutPORT                 = 7 /*0x7*/,
    TlgOutIPV4                 = 8 /*0x8*/,
    TlgOutIPV6                 = 9 /*0x9*/,
    TlgOutSOCKETADDRESS        = 10 /*0xA*/,
    TlgOutXML                  = 11 /*0xB*/,
    TlgOutJSON                 = 12 /*0xC*/,
    TlgOutWIN32ERROR           = 13 /*0xD*/,
    TlgOutNTSTATUS             = 14 /*0xE*/,
    TlgOutHRESULT              = 15 /*0xF*/,
    TlgOutFILETIME             = 16 /*0x10*/,
    TlgOutSIGNED               = 17 /*0x11*/,
    TlgOutUNSIGNED             = 18 /*0x12*/,
    TlgOutUTF8                 = 35 /*0x23*/,
    TlgOutPKCS7_WITH_TYPE_INFO = 36 /*0x24*/,
    _TlgOutMax                 = 37 /*0x25*/,
    _TlgOutChain               = 128 /*0x80*/,
    _TlgOutTypeMask            = 127 /*0x7F*/
}TlgOut_t, *PTlgOut_t;

typedef enum _TOKEN_INFORMATION_CLASS  // 45 elements, 0x4 bytes
{
    TokenUser                            = 1 /*0x1*/,
    TokenGroups                          = 2 /*0x2*/,
    TokenPrivileges                      = 3 /*0x3*/,
    TokenOwner                           = 4 /*0x4*/,
    TokenPrimaryGroup                    = 5 /*0x5*/,
    TokenDefaultDacl                     = 6 /*0x6*/,
    TokenSource                          = 7 /*0x7*/,
    TokenType                            = 8 /*0x8*/,
    TokenImpersonationLevel              = 9 /*0x9*/,
    TokenStatistics                      = 10 /*0xA*/,
    TokenRestrictedSids                  = 11 /*0xB*/,
    TokenSessionId                       = 12 /*0xC*/,
    TokenGroupsAndPrivileges             = 13 /*0xD*/,
    TokenSessionReference                = 14 /*0xE*/,
    TokenSandBoxInert                    = 15 /*0xF*/,
    TokenAuditPolicy                     = 16 /*0x10*/,
    TokenOrigin                          = 17 /*0x11*/,
    TokenElevationType                   = 18 /*0x12*/,
    TokenLinkedToken                     = 19 /*0x13*/,
    TokenElevation                       = 20 /*0x14*/,
    TokenHasRestrictions                 = 21 /*0x15*/,
    TokenAccessInformation               = 22 /*0x16*/,
    TokenVirtualizationAllowed           = 23 /*0x17*/,
    TokenVirtualizationEnabled           = 24 /*0x18*/,
    TokenIntegrityLevel                  = 25 /*0x19*/,
    TokenUIAccess                        = 26 /*0x1A*/,
    TokenMandatoryPolicy                 = 27 /*0x1B*/,
    TokenLogonSid                        = 28 /*0x1C*/,
    TokenIsAppContainer                  = 29 /*0x1D*/,
    TokenCapabilities                    = 30 /*0x1E*/,
    TokenAppContainerSid                 = 31 /*0x1F*/,
    TokenAppContainerNumber              = 32 /*0x20*/,
    TokenUserClaimAttributes             = 33 /*0x21*/,
    TokenDeviceClaimAttributes           = 34 /*0x22*/,
    TokenRestrictedUserClaimAttributes   = 35 /*0x23*/,
    TokenRestrictedDeviceClaimAttributes = 36 /*0x24*/,
    TokenDeviceGroups                    = 37 /*0x25*/,
    TokenRestrictedDeviceGroups          = 38 /*0x26*/,
    TokenSecurityAttributes              = 39 /*0x27*/,
    TokenIsRestricted                    = 40 /*0x28*/,
    TokenProcessTrustLevel               = 41 /*0x29*/,
    TokenPrivateNameSpace                = 42 /*0x2A*/,
    TokenSingletonAttributes             = 43 /*0x2B*/,
    TokenBnoIsolation                    = 44 /*0x2C*/,
    MaxTokenInfoClass                    = 45 /*0x2D*/
}TOKEN_INFORMATION_CLASS, *PTOKEN_INFORMATION_CLASS;

typedef enum _TOKEN_TYPE  // 2 elements, 0x4 bytes
{
    TokenPrimary       = 1 /*0x1*/,
    TokenImpersonation = 2 /*0x2*/
}TOKEN_TYPE, *PTOKEN_TYPE;

typedef enum _TP_CALLBACK_PRIORITY  // 5 elements, 0x4 bytes
{
    TP_CALLBACK_PRIORITY_HIGH    = 0 /*0x0*/,
    TP_CALLBACK_PRIORITY_NORMAL  = 1 /*0x1*/,
    TP_CALLBACK_PRIORITY_LOW     = 2 /*0x2*/,
    TP_CALLBACK_PRIORITY_INVALID = 3 /*0x3*/,
    TP_CALLBACK_PRIORITY_COUNT   = 3 /*0x3*/
}TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef enum _TRACE_INFORMATION_CLASS  // 18 elements, 0x4 bytes
{
    TraceIdClass                   = 0 /*0x0*/,
    TraceHandleClass               = 1 /*0x1*/,
    TraceEnableFlagsClass          = 2 /*0x2*/,
    TraceEnableLevelClass          = 3 /*0x3*/,
    GlobalLoggerHandleClass        = 4 /*0x4*/,
    EventLoggerHandleClass         = 5 /*0x5*/,
    AllLoggerHandlesClass          = 6 /*0x6*/,
    TraceHandleByNameClass         = 7 /*0x7*/,
    LoggerEventsLostClass          = 8 /*0x8*/,
    TraceSessionSettingsClass      = 9 /*0x9*/,
    LoggerEventsLoggedClass        = 10 /*0xA*/,
    DiskIoNotifyRoutinesClass      = 11 /*0xB*/,
    TraceInformationClassReserved1 = 12 /*0xC*/,
    AllPossibleNotifyRoutinesClass = 12 /*0xC*/,
    FltIoNotifyRoutinesClass       = 13 /*0xD*/,
    TraceInformationClassReserved2 = 14 /*0xE*/,
    WdfNotifyRoutinesClass         = 15 /*0xF*/,
    MaxTraceInformationClass       = 16 /*0x10*/
}TRACE_INFORMATION_CLASS, *PTRACE_INFORMATION_CLASS;

typedef enum _TRANSFER_TYPE  // 3 elements, 0x4 bytes
{
    ReadTransfer  = 0 /*0x0*/,
    WriteTransfer = 1 /*0x1*/,
    OtherTransfer = 2 /*0x2*/
}TRANSFER_TYPE, *PTRANSFER_TYPE;

typedef enum _TYPE_OF_MEMORY  // 37 elements, 0x4 bytes
{
    LoaderExceptionBlock     = 0 /*0x0*/,
    LoaderSystemBlock        = 1 /*0x1*/,
    LoaderFree               = 2 /*0x2*/,
    LoaderBad                = 3 /*0x3*/,
    LoaderLoadedProgram      = 4 /*0x4*/,
    LoaderFirmwareTemporary  = 5 /*0x5*/,
    LoaderFirmwarePermanent  = 6 /*0x6*/,
    LoaderOsloaderHeap       = 7 /*0x7*/,
    LoaderOsloaderStack      = 8 /*0x8*/,
    LoaderSystemCode         = 9 /*0x9*/,
    LoaderHalCode            = 10 /*0xA*/,
    LoaderBootDriver         = 11 /*0xB*/,
    LoaderConsoleInDriver    = 12 /*0xC*/,
    LoaderConsoleOutDriver   = 13 /*0xD*/,
    LoaderStartupDpcStack    = 14 /*0xE*/,
    LoaderStartupKernelStack = 15 /*0xF*/,
    LoaderStartupPanicStack  = 16 /*0x10*/,
    LoaderStartupPcrPage     = 17 /*0x11*/,
    LoaderStartupPdrPage     = 18 /*0x12*/,
    LoaderRegistryData       = 19 /*0x13*/,
    LoaderMemoryData         = 20 /*0x14*/,
    LoaderNlsData            = 21 /*0x15*/,
    LoaderSpecialMemory      = 22 /*0x16*/,
    LoaderBBTMemory          = 23 /*0x17*/,
    LoaderZero               = 24 /*0x18*/,
    LoaderXIPRom             = 25 /*0x19*/,
    LoaderHALCachedMemory    = 26 /*0x1A*/,
    LoaderLargePageFiller    = 27 /*0x1B*/,
    LoaderErrorLogMemory     = 28 /*0x1C*/,
    LoaderVsmMemory          = 29 /*0x1D*/,
    LoaderFirmwareCode       = 30 /*0x1E*/,
    LoaderFirmwareData       = 31 /*0x1F*/,
    LoaderFirmwareReserved   = 32 /*0x20*/,
    LoaderEnclaveMemory      = 33 /*0x21*/,
    LoaderFirmwareKsr        = 34 /*0x22*/,
    LoaderEnclaveKsr         = 35 /*0x23*/,
    LoaderMaximum            = 36 /*0x24*/
}TYPE_OF_MEMORY, *PTYPE_OF_MEMORY;

typedef enum _UoWActionType  // 15 elements, 0x4 bytes
{
    UoWAddThisKey            = 0 /*0x0*/,
    UoWAddChildKey           = 1 /*0x1*/,
    UoWDeleteThisKey         = 2 /*0x2*/,
    UoWDeleteChildKey        = 3 /*0x3*/,
    UoWSetValueNew           = 4 /*0x4*/,
    UoWSetValueExisting      = 5 /*0x5*/,
    UoWDeleteValue           = 6 /*0x6*/,
    UoWSetKeyUserFlags       = 7 /*0x7*/,
    UoWSetLastWriteTime      = 8 /*0x8*/,
    UoWSetSecurityDescriptor = 9 /*0x9*/,
    UoWRenameSubKey          = 10 /*0xA*/,
    UoWRenameOldSubKey       = 11 /*0xB*/,
    UoWRenameNewSubKey       = 12 /*0xC*/,
    UoWIsolation             = 13 /*0xD*/,
    UoWInvalid               = 14 /*0xE*/
}UoWActionType, *PUoWActionType;

typedef enum _USER_ACTIVITY_PRESENCE  // 5 elements, 0x4 bytes
{
    PowerUserPresent    = 0 /*0x0*/,
    PowerUserNotPresent = 1 /*0x1*/,
    PowerUserInactive   = 2 /*0x2*/,
    PowerUserMaximum    = 3 /*0x3*/,
    PowerUserInvalid    = 3 /*0x3*/
}USER_ACTIVITY_PRESENCE, *PUSER_ACTIVITY_PRESENCE;

typedef enum _VI_DEADLOCK_RESOURCE_TYPE  // 10 elements, 0x4 bytes
{
    VfDeadlockUnknown               = 0 /*0x0*/,
    VfDeadlockMutex                 = 1 /*0x1*/,
    VfDeadlockMutexAbandoned        = 2 /*0x2*/,
    VfDeadlockFastMutex             = 3 /*0x3*/,
    VfDeadlockFastMutexUnsafe       = 4 /*0x4*/,
    VfDeadlockSpinLock              = 5 /*0x5*/,
    VfDeadlockInStackQueuedSpinLock = 6 /*0x6*/,
    VfDeadlockUnusedSpinLock        = 7 /*0x7*/,
    VfDeadlockEresource             = 8 /*0x8*/,
    VfDeadlockTypeMaximum           = 9 /*0x9*/
}VI_DEADLOCK_RESOURCE_TYPE, *PVI_DEADLOCK_RESOURCE_TYPE;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT  // 9 elements, 0x4 bytes
{
    WheaDataFormatIPFSalRecord = 0 /*0x0*/,
    WheaDataFormatXPFMCA       = 1 /*0x1*/,
    WheaDataFormatMemory       = 2 /*0x2*/,
    WheaDataFormatPCIExpress   = 3 /*0x3*/,
    WheaDataFormatNMIPort      = 4 /*0x4*/,
    WheaDataFormatPCIXBus      = 5 /*0x5*/,
    WheaDataFormatPCIXDevice   = 6 /*0x6*/,
    WheaDataFormatGeneric      = 7 /*0x7*/,
    WheaDataFormatMax          = 8 /*0x8*/
}WHEA_ERROR_PACKET_DATA_FORMAT, *PWHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _WHEA_ERROR_SEVERITY  // 4 elements, 0x4 bytes
{
    WheaErrSevRecoverable   = 0 /*0x0*/,
    WheaErrSevFatal         = 1 /*0x1*/,
    WheaErrSevCorrected     = 2 /*0x2*/,
    WheaErrSevInformational = 3 /*0x3*/
}WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_SOURCE_STATE  // 2 elements, 0x4 bytes
{
    WheaErrSrcStateStopped = 1 /*0x1*/,
    WheaErrSrcStateStarted = 2 /*0x2*/
}WHEA_ERROR_SOURCE_STATE, *PWHEA_ERROR_SOURCE_STATE;

typedef enum _WHEA_ERROR_SOURCE_TYPE  // 15 elements, 0x4 bytes
{
    WheaErrSrcTypeMCE          = 0 /*0x0*/,
    WheaErrSrcTypeCMC          = 1 /*0x1*/,
    WheaErrSrcTypeCPE          = 2 /*0x2*/,
    WheaErrSrcTypeNMI          = 3 /*0x3*/,
    WheaErrSrcTypePCIe         = 4 /*0x4*/,
    WheaErrSrcTypeGeneric      = 5 /*0x5*/,
    WheaErrSrcTypeINIT         = 6 /*0x6*/,
    WheaErrSrcTypeBOOT         = 7 /*0x7*/,
    WheaErrSrcTypeSCIGeneric   = 8 /*0x8*/,
    WheaErrSrcTypeIPFMCA       = 9 /*0x9*/,
    WheaErrSrcTypeIPFCMC       = 10 /*0xA*/,
    WheaErrSrcTypeIPFCPE       = 11 /*0xB*/,
    WheaErrSrcTypeGenericV2    = 12 /*0xC*/,
    WheaErrSrcTypeSCIGenericV2 = 13 /*0xD*/,
    WheaErrSrcTypeMax          = 14 /*0xE*/
}WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_TYPE  // 7 elements, 0x4 bytes
{
    WheaErrTypeProcessor  = 0 /*0x0*/,
    WheaErrTypeMemory     = 1 /*0x1*/,
    WheaErrTypePCIExpress = 2 /*0x2*/,
    WheaErrTypeNMI        = 3 /*0x3*/,
    WheaErrTypePCIXBus    = 4 /*0x4*/,
    WheaErrTypePCIXDevice = 5 /*0x5*/,
    WheaErrTypeGeneric    = 6 /*0x6*/
}WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef enum _WORKING_SET_TYPE  // 7 elements, 0x4 bytes
{
    WorkingSetTypeUser        = 0 /*0x0*/,
    WorkingSetTypeSession     = 1 /*0x1*/,
    WorkingSetTypeSystemTypes = 2 /*0x2*/,
    WorkingSetTypeSystemCache = 2 /*0x2*/,
    WorkingSetTypePagedPool   = 3 /*0x3*/,
    WorkingSetTypeSystemPtes  = 4 /*0x4*/,
    WorkingSetTypeMaximum     = 5 /*0x5*/
}WORKING_SET_TYPE, *PWORKING_SET_TYPE;

typedef enum _WOW64_SHARED_INFORMATION  // 9 elements, 0x4 bytes
{
    SharedNtdll32LdrInitializeThunk                  = 0 /*0x0*/,
    SharedNtdll32KiUserExceptionDispatcher           = 1 /*0x1*/,
    SharedNtdll32KiUserApcDispatcher                 = 2 /*0x2*/,
    SharedNtdll32KiUserCallbackDispatcher            = 3 /*0x3*/,
    SharedNtdll32RtlUserThreadStart                  = 4 /*0x4*/,
    SharedNtdll32pQueryProcessDebugInformationRemote = 5 /*0x5*/,
    SharedNtdll32BaseAddress                         = 6 /*0x6*/,
    SharedNtdll32LdrSystemDllInitBlock               = 7 /*0x7*/,
    Wow64SharedPageEntriesCount                      = 8 /*0x8*/
}WOW64_SHARED_INFORMATION, *PWOW64_SHARED_INFORMATION;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Information about structure types

typedef struct _ACCESS_REASONS;
typedef struct _ACCESS_STATE;
typedef struct _ACL;
typedef struct _ACTIVATION_CONTEXT;
typedef struct _ACTIVATION_CONTEXT_DATA;
typedef struct _ACTIVATION_CONTEXT_STACK;
typedef struct _ACTIVATION_CONTEXT_STACK32;
typedef struct _ACTIVATION_CONTEXT_STACK64;
typedef struct _ADAPTER_OBJECT;
typedef union _AER_BRIDGE_DESCRIPTOR_FLAGS;
typedef union _AER_ENDPOINT_DESCRIPTOR_FLAGS;
typedef union _AER_ROOTPORT_DESCRIPTOR_FLAGS;
typedef struct _AGGREGATED_PAYLOAD_FILTER;
typedef struct _ALPC_COMMUNICATION_INFO;
typedef struct _ALPC_COMPLETION_LIST;
typedef struct _ALPC_COMPLETION_LIST_HEADER;
typedef struct _ALPC_COMPLETION_LIST_STATE;
typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE;
typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY;
typedef struct _ALPC_DISPATCH_CONTEXT;
typedef struct _ALPC_HANDLE_ENTRY;
typedef struct _ALPC_HANDLE_TABLE;
typedef struct _ALPC_MESSAGE_ATTRIBUTES;
typedef struct _ALPC_PORT;
typedef struct _ALPC_PORT_ATTRIBUTES;
typedef struct _ALPC_PROCESS_CONTEXT;
typedef struct _ALPC_WORK_ON_BEHALF_TICKET;
typedef struct _AMD64_DBGKD_CONTROL_SET;
typedef struct _ARBITER_ADD_RESERVED_PARAMETERS;
typedef struct _ARBITER_ALLOCATION_STATE;
typedef struct _ARBITER_ALTERNATIVE;
typedef struct _ARBITER_BOOT_ALLOCATION_PARAMETERS;
typedef struct _ARBITER_CONFLICT_INFO;
typedef struct _ARBITER_INSTANCE;
typedef struct _ARBITER_INTERFACE;
typedef struct _ARBITER_LIST_ENTRY;
typedef struct _ARBITER_ORDERING;
typedef struct _ARBITER_ORDERING_LIST;
typedef struct _ARBITER_PARAMETERS;
typedef struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS;
typedef struct _ARBITER_QUERY_ARBITRATE_PARAMETERS;
typedef struct _ARBITER_QUERY_CONFLICT_PARAMETERS;
typedef struct _ARBITER_RETEST_ALLOCATION_PARAMETERS;
typedef struct _ARBITER_TEST_ALLOCATION_PARAMETERS;
typedef struct _ARM_DBGKD_CONTROL_SET;
typedef struct _ARM64_DBGKD_CONTROL_SET;
typedef struct _ARMCE_DBGKD_CONTROL_SET;
typedef struct _ASSEMBLY_STORAGE_MAP;
typedef struct _ASYNC_READ_THREAD_STATS;
typedef struct _AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION;
typedef struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION;
typedef struct _AUX_ACCESS_DATA;
typedef struct _BATTERY_REPORTING_SCALE;
typedef struct _BITMAP_RANGE;
typedef struct _BLOB;
typedef struct _BLOB_COUNTERS;
typedef struct _BLOB_TYPE;
typedef struct _BUS_EXTENSION_LIST;
typedef struct _CACHE_DESCRIPTOR;
typedef struct _CACHE_MANAGER_CALLBACKS;
typedef struct _CACHE_UNINITIALIZE_EVENT;
typedef struct _CACHED_CHILD_LIST;
typedef struct _CACHED_KSTACK_LIST;
typedef struct _CALL_HASH_ENTRY;
typedef struct _CALL_PERFORMANCE_DATA;
typedef struct _CALLBACK_OBJECT;
typedef struct _CC_ASYNC_READ_CONTEXT;
typedef struct _CC_EXTERNAL_CACHE_INFO;
typedef struct _CC_PARTITION;
typedef struct _CELL_DATA;
typedef struct _CHILD_LIST;
typedef struct _CI_NGEN_PATHS;
typedef struct _CLIENT_ID;
typedef struct _CLIENT_ID32;
typedef struct _CLIENT_ID64;
typedef union _CLS_LSN;
typedef struct _CM_BIG_DATA;
typedef struct _CM_CACHED_VALUE_INDEX;
typedef struct _CM_CELL_REMAP_BLOCK;
typedef struct _CM_COMPONENT_HASH;
typedef struct _CM_DIRTY_VECTOR_LOG;
typedef struct _CM_DIRTY_VECTOR_LOG_ENTRY;
typedef struct _CM_FAST_LEAF_HINT;
typedef struct _CM_FULL_RESOURCE_DESCRIPTOR;
typedef struct _CM_INDEX;
typedef struct _CM_INDEX_HINT_BLOCK;
typedef struct _CM_INTENT_LOCK;
typedef struct _CM_KCB_LAYER_INFO;
typedef struct _CM_KCB_UOW;
typedef struct _CM_KEY_BODY;
typedef struct _CM_KEY_CONTROL_BLOCK;
typedef struct _CM_KEY_HASH;
typedef struct _CM_KEY_HASH_TABLE_ENTRY;
typedef struct _CM_KEY_INDEX;
typedef struct _CM_KEY_NODE;
typedef struct _CM_KEY_REFERENCE;
typedef struct _CM_KEY_SECURITY;
typedef struct _CM_KEY_SECURITY_CACHE;
typedef struct _CM_KEY_SECURITY_CACHE_ENTRY;
typedef struct _CM_KEY_VALUE;
typedef struct _CM_NAME_CONTROL_BLOCK;
typedef struct _CM_NAME_HASH;
typedef struct _CM_NOTIFY_BLOCK;
typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR;
typedef struct _CM_PARTIAL_RESOURCE_LIST;
typedef struct _CM_PATH_HASH;
typedef struct _CM_RESOURCE_LIST;
typedef struct _CM_RM;
typedef struct _CM_TRANS;
typedef union _CM_TRANS_PTR;
typedef struct _CM_UOW_KEY_STATE_MODIFICATION;
typedef struct _CM_UOW_SET_SD_DATA;
typedef struct _CM_UOW_SET_VALUE_KEY_DATA;
typedef struct _CM_UOW_SET_VALUE_LIST_DATA;
typedef struct _CM_WORKITEM;
typedef struct _CMHIVE;
typedef struct _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT;
typedef struct _CMP_OFFSET_ARRAY;
typedef struct _COMPRESSED_DATA_INFO;
typedef struct _CONTEXT;
typedef struct _CONTROL_AREA;
typedef struct _COUNTER_READING;
typedef union _CPU_INFO;
typedef struct _CRITICAL_PROCESS_EXCEPTION_DATA;
typedef struct _CURDIR;
typedef union _CVDD;
typedef struct _DBGKD_ANY_CONTROL_SET;
typedef struct _DBGKD_BREAKPOINTEX;
typedef struct _DBGKD_CONTEXT_EX;
typedef struct _DBGKD_CONTINUE;
typedef struct _DBGKD_CONTINUE2;
typedef struct _DBGKD_FILL_MEMORY;
typedef struct _DBGKD_GET_CONTEXT;
typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT32;
typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT64;
typedef struct _DBGKD_GET_SET_BUS_DATA;
typedef struct _DBGKD_GET_VERSION32;
typedef struct _DBGKD_GET_VERSION64;
typedef struct _DBGKD_LOAD_SYMBOLS32;
typedef struct _DBGKD_LOAD_SYMBOLS64;
typedef struct _DBGKD_MANIPULATE_STATE32;
typedef struct _DBGKD_MANIPULATE_STATE64;
typedef struct _DBGKD_QUERY_MEMORY;
typedef struct _DBGKD_QUERY_SPECIAL_CALLS;
typedef struct _DBGKD_READ_MEMORY32;
typedef struct _DBGKD_READ_MEMORY64;
typedef struct _DBGKD_READ_WRITE_IO_EXTENDED32;
typedef struct _DBGKD_READ_WRITE_IO_EXTENDED64;
typedef struct _DBGKD_READ_WRITE_IO32;
typedef struct _DBGKD_READ_WRITE_IO64;
typedef struct _DBGKD_READ_WRITE_MSR;
typedef struct _DBGKD_RESTORE_BREAKPOINT;
typedef struct _DBGKD_SEARCH_MEMORY;
typedef struct _DBGKD_SET_CONTEXT;
typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT32;
typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT64;
typedef struct _DBGKD_SET_SPECIAL_CALL32;
typedef struct _DBGKD_SET_SPECIAL_CALL64;
typedef struct _DBGKD_SWITCH_PARTITION;
typedef struct _DBGKD_WRITE_BREAKPOINT32;
typedef struct _DBGKD_WRITE_BREAKPOINT64;
typedef struct _DBGKD_WRITE_CUSTOM_BREAKPOINT;
typedef struct _DBGKD_WRITE_MEMORY32;
typedef struct _DBGKD_WRITE_MEMORY64;
typedef struct _DBGKM_EXCEPTION32;
typedef struct _DBGKM_EXCEPTION64;
typedef struct _DEFERRED_WRITE;
typedef struct _DELAY_ACK_FO;
typedef struct _DEVICE_CAPABILITIES;
typedef struct _DEVICE_DESCRIPTION;
typedef struct _DEVICE_MAP;
typedef struct _DEVICE_NODE;
typedef struct _DEVICE_OBJECT;
typedef struct _DEVICE_OBJECT_LIST;
typedef struct _DEVICE_OBJECT_POWER_EXTENSION;
typedef struct _DEVICE_RELATIONS;
typedef struct _DEVOBJ_EXTENSION;
typedef struct _DIAGNOSTIC_BUFFER;
typedef struct _DIAGNOSTIC_CONTEXT;
typedef struct _DIRTY_PAGE_STATISTICS;
typedef struct _DIRTY_PAGE_THRESHOLDS;
typedef struct _DISALLOWED_GUIDS;
typedef struct _DISPATCHER_HEADER;
typedef struct _DOCK_INTERFACE;
typedef struct _DRIVER_EXTENSION;
typedef struct _DRIVER_OBJECT;
typedef struct _DUAL;
typedef struct _DUMMY_FILE_OBJECT;
typedef struct _DUMP_INITIALIZATION_CONTEXT;
typedef struct _DUMP_STACK_CONTEXT;
typedef struct _DYNAMIC_FUNCTION_TABLE;
typedef struct _ECP_LIST;
typedef struct _EJOB;
typedef union _ENERGY_STATE_DURATION;
typedef struct _ENODE;
typedef struct _EPROCESS;
typedef struct _EPROCESS_QUOTA_BLOCK;
typedef struct _EPROCESS_VALUES;
typedef struct _ERESOURCE;
typedef struct _ESERVERSILO_GLOBALS;
typedef struct _ETHREAD;
typedef struct _ETIMER;
typedef struct _ETW_BUFFER_CONTEXT;
typedef struct _ETW_BUFFER_QUEUE;
typedef struct _ETW_COUNTERS;
typedef struct _ETW_FILTER_EVENT_NAME_DATA;
typedef struct _ETW_FILTER_HEADER;
typedef struct _ETW_FILTER_PID;
typedef struct _ETW_FILTER_STRING_TOKEN;
typedef struct _ETW_FILTER_STRING_TOKEN_ELEMENT;
typedef struct _ETW_GUID_ENTRY;
typedef struct _ETW_HASH_BUCKET;
typedef struct _ETW_LAST_ENABLE_INFO;
typedef struct _ETW_LOGGER_HANDLE;
typedef struct _ETW_PAYLOAD_FILTER;
typedef struct _ETW_PERF_COUNTERS;
typedef struct _ETW_PERFECT_HASH_FUNCTION;
typedef struct _ETW_PMC_SUPPORT;
typedef struct _ETW_PRIV_HANDLE_DEMUX_TABLE;
typedef struct _ETW_PROVIDER_TRAITS;
typedef struct _ETW_QUEUE_ENTRY;
typedef struct _ETW_REALTIME_CONSUMER;
typedef struct _ETW_REF_CLOCK;
typedef struct _ETW_REG_ENTRY;
typedef struct _ETW_REPLY_QUEUE;
typedef struct _ETW_SESSION_PERF_COUNTERS;
typedef struct _ETW_SILO_TRACING_BLOCK;
typedef struct _ETW_SILODRIVERSTATE;
typedef struct _ETW_SOFT_RESTART_CONTEXT;
typedef struct _ETW_STACK_CACHE;
typedef struct _ETW_SYSTEMTIME;
typedef struct _ETW_WMITRACE_WORK;
typedef struct _ETWP_NOTIFICATION_HEADER;
typedef struct _EVENT_DATA_DESCRIPTOR;
typedef struct _EVENT_DESCRIPTOR;
typedef struct _EVENT_FILTER_DESCRIPTOR;
typedef struct _EVENT_FILTER_HEADER;
typedef struct _EVENT_HEADER;
typedef struct _EVENT_HEADER_EXTENDED_DATA_ITEM;
typedef struct _EVENT_PAYLOAD_PREDICATE;
typedef struct _EVENT_RECORD;
typedef struct _EWOW64PROCESS;
typedef struct _EX_FAST_REF;
typedef struct _EX_PUSH_LOCK;
typedef struct _EX_PUSH_LOCK_AUTO_EXPAND;
typedef struct _EX_PUSH_LOCK_AUTO_EXPAND_STATE;
typedef struct _EX_RUNDOWN_REF;
typedef struct _EX_RUNDOWN_REF_CACHE_AWARE;
typedef struct _EX_TIMER;
typedef struct _EX_WORK_QUEUE;
typedef struct _EXCEPTION_POINTERS;
typedef struct _EXCEPTION_RECORD;
typedef struct _EXCEPTION_RECORD32;
typedef struct _EXCEPTION_RECORD64;
typedef struct _EXCEPTION_REGISTRATION_RECORD;
typedef struct _EXHANDLE;
typedef struct _EXT_DELETE_PARAMETERS;
typedef struct _EXT_SET_PARAMETERS_V0;
typedef struct _FAST_ERESOURCE;
typedef struct _FAST_ERESOURCE_INTERNAL;
typedef struct _FAST_IO_DISPATCH;
typedef struct _FAST_MUTEX;
typedef struct _FAST_OWNER_ENTRY;
typedef struct _FAST_OWNER_ENTRY_INTERNAL;
typedef struct _FILE_BASIC_INFORMATION;
typedef struct _FILE_GET_QUOTA_INFORMATION;
typedef struct _FILE_NETWORK_OPEN_INFORMATION;
typedef struct _FILE_OBJECT;
typedef union _FILE_SEGMENT_ELEMENT;
typedef struct _FILE_STANDARD_INFORMATION;
typedef struct _FILESYSTEM_DISK_COUNTERS;
typedef struct _flags;
typedef struct _FLS_CALLBACK_INFO;
typedef struct _FREE_DISPLAY;
typedef struct _FS_FILTER_CALLBACK_DATA;
typedef struct _FS_FILTER_CALLBACKS;
typedef union _FS_FILTER_PARAMETERS;
typedef struct _FS_FILTER_SECTION_SYNC_OUTPUT;
typedef struct _FSRTL_ADVANCED_FCB_HEADER;
typedef struct _GDI_TEB_BATCH;
typedef struct _GDI_TEB_BATCH32;
typedef struct _GDI_TEB_BATCH64;
typedef struct _GENERAL_LOOKASIDE;
typedef struct _GENERAL_LOOKASIDE_POOL;
typedef struct _GENERIC_MAPPING;
typedef struct _GROUP_AFFINITY;
typedef struct _GUID;
typedef struct _HAL_CHANNEL_MEMORY_RANGES;
typedef struct _HAL_NODE_RANGE;
typedef struct _HAL_PMC_COUNTERS;
typedef struct _HANDLE_REVOCATION_INFO;
typedef struct _HANDLE_TABLE;
typedef union _HANDLE_TABLE_ENTRY;
typedef struct _HANDLE_TABLE_ENTRY_INFO;
typedef struct _HANDLE_TABLE_FREE_LIST;
typedef struct _HANDLE_TRACE_DB_ENTRY;
typedef struct _HANDLE_TRACE_DEBUG_INFO;
typedef struct _HARDWARE_PTE;
typedef struct _HBASE_BLOCK;
typedef struct _HBIN;
typedef struct _HCELL;
typedef struct _HEAP;
typedef struct _HEAP_COUNTERS;
typedef struct _HEAP_ENTRY;
typedef struct _HEAP_ENTRY_EXTRA;
typedef struct _HEAP_EXTENDED_ENTRY;
typedef struct _HEAP_FREE_ENTRY;
typedef struct _HEAP_FREE_ENTRY_EXTRA;
typedef struct _HEAP_LIST_LOOKUP;
typedef struct _HEAP_LOCK;
typedef struct _HEAP_LOOKASIDE;
typedef struct _HEAP_PSEUDO_TAG_ENTRY;
typedef struct _HEAP_SEGMENT;
typedef struct _HEAP_STOP_ON_TAG;
typedef struct _HEAP_STOP_ON_VALUES;
typedef struct _HEAP_SUBALLOCATOR_CALLBACKS;
typedef struct _HEAP_TAG_ENTRY;
typedef struct _HEAP_TUNING_PARAMETERS;
typedef struct _HEAP_UCR_DESCRIPTOR;
typedef struct _HEAP_UNPACKED_ENTRY;
typedef struct _HEAP_VIRTUAL_ALLOC_ENTRY;
typedef struct _HHIVE;
typedef struct _HIVE_LIST_ENTRY;
typedef struct _HIVE_LOAD_FAILURE;
typedef struct _HIVE_WAIT_PACKET;
typedef struct _HIVE_WRITE_WAIT_QUEUE;
typedef struct _HMAP_DIRECTORY;
typedef struct _HMAP_ENTRY;
typedef struct _HMAP_TABLE;
typedef struct _HV_GET_BIN_CONTEXT;
typedef struct _HV_GET_CELL_CONTEXT;
typedef union _HV_PARTITION_PRIVILEGE_MASK;
typedef struct _HV_X64_HYPERVISOR_FEATURES;
typedef struct _HVIEW_MAP;
typedef struct _HVIEW_MAP_DIRECTORY;
typedef struct _HVIEW_MAP_ENTRY;
typedef struct _HVIEW_MAP_PIN_LOG;
typedef struct _HVIEW_MAP_PIN_LOG_ENTRY;
typedef struct _HVIEW_MAP_TABLE;
typedef struct _IA64_DBGKD_CONTROL_SET;
typedef struct _IMAGE_DATA_DIRECTORY;
typedef struct _IMAGE_DEBUG_DIRECTORY;
typedef struct _IMAGE_DOS_HEADER;
typedef struct _IMAGE_FILE_HEADER;
typedef struct _IMAGE_NT_HEADERS64;
typedef struct _IMAGE_OPTIONAL_HEADER64;
typedef struct _IMAGE_ROM_OPTIONAL_HEADER;
typedef struct _IMAGE_RUNTIME_FUNCTION_ENTRY;
typedef struct _IMAGE_SECTION_HEADER;
typedef struct _IMAGE_SECURITY_CONTEXT;
typedef struct _INITIAL_PRIVILEGE_SET;
typedef struct _INTERFACE;
typedef struct _INTERRUPT_CONNECTION_DATA;
typedef struct _INTERRUPT_HT_INTR_INFO;
typedef struct _INTERRUPT_REMAPPING_INFO;
typedef struct _INTERRUPT_VECTOR_DATA;
typedef struct _INVERTED_FUNCTION_TABLE;
typedef struct _INVERTED_FUNCTION_TABLE_ENTRY;
typedef struct _IO_ADAPTER_CRYPTO_KEY_DESCRIPTOR;
typedef struct _IO_ADAPTER_CRYPTO_PARAMETERS;
typedef struct _IO_CLIENT_EXTENSION;
typedef struct _IO_COMPLETION_CONTEXT;
typedef struct _IO_DRIVER_CREATE_CONTEXT;
typedef struct _IO_IRP_EXT_TRACK_OFFSET_HEADER;
typedef struct _IO_MINI_COMPLETION_PACKET_USER;
typedef struct _IO_PRIORITY_INFO;
typedef struct _IO_REMOVE_LOCK;
typedef struct _IO_REMOVE_LOCK_COMMON_BLOCK;
typedef struct _IO_RESOURCE_DESCRIPTOR;
typedef struct _IO_RESOURCE_LIST;
typedef struct _IO_RESOURCE_REQUIREMENTS_LIST;
typedef struct _IO_SECURITY_CONTEXT;
typedef struct _IO_STACK_LOCATION;
typedef struct _IO_STATUS_BLOCK;
typedef struct _IO_TIMER;
typedef struct _IO_WORKITEM;
typedef struct _iobuf;
typedef struct _IOP_FILE_OBJECT_EXTENSION;
typedef struct _IOP_IRP_EXTENSION;
typedef struct _IOP_IRP_EXTENSION_STATUS;
typedef struct _IOP_IRP_STACK_PROFILER;
typedef struct _IOV_FORCED_PENDING_TRACE;
typedef struct _IOV_IRP_TRACE;
typedef struct _IRP;
typedef struct _ISR_THUNK;
typedef struct _ISRDPCSTATS;
typedef struct _JOB_ACCESS_STATE;
typedef struct _JOB_CPU_RATE_CONTROL;
typedef struct _JOB_NET_RATE_CONTROL;
typedef struct _JOB_NOTIFICATION_INFORMATION;
typedef struct _JOB_RATE_CONTROL_HEADER;
typedef union _JOBOBJECT_ENERGY_TRACKING_STATE;
typedef struct _JOBOBJECT_WAKE_FILTER;
typedef struct _KAFFINITY_EX;
typedef union _KALPC_DIRECT_EVENT;
typedef struct _KALPC_HANDLE_DATA;
typedef struct _KALPC_MESSAGE;
typedef struct _KALPC_MESSAGE_ATTRIBUTES;
typedef struct _KALPC_REGION;
typedef struct _KALPC_RESERVE;
typedef struct _KALPC_SECTION;
typedef struct _KALPC_SECURITY_DATA;
typedef struct _KALPC_VIEW;
typedef struct _KALPC_WORK_ON_BEHALF_DATA;
typedef struct _KAPC;
typedef struct _KAPC_STATE;
typedef struct _KDESCRIPTOR;
typedef struct _KDEVICE_QUEUE;
typedef struct _KDEVICE_QUEUE_ENTRY;
typedef struct _KDPC;
typedef struct _KDPC_DATA;
typedef struct _KDPC_LIST;
typedef struct _KENLISTMENT;
typedef struct _KENLISTMENT_HISTORY;
typedef struct _KENTROPY_TIMING_STATE;
typedef struct _KERNEL_STACK_SEGMENT;
typedef struct _KEVENT;
typedef struct _KEXCEPTION_FRAME;
typedef union _KEXECUTE_OPTIONS;
typedef struct _KFLOATING_SAVE;
typedef struct _KGATE;
typedef union _KGDTENTRY64;
typedef struct _KHETERO_PROCESSOR_SET;
typedef union _KIDTENTRY64;
typedef struct _KINTERRUPT;
typedef struct _KLDR_DATA_TABLE_ENTRY;
typedef struct _KLOCK_ENTRY;
typedef union _KLOCK_ENTRY_BOOST_BITMAP;
typedef struct _KLOCK_ENTRY_LOCK_STATE;
typedef struct _KLOCK_QUEUE_HANDLE;
typedef struct _KMUTANT;
typedef struct _KNODE;
typedef struct _KPCR;
typedef struct _KPRCB;
typedef struct _KPRIQUEUE;
typedef struct _KPROCESS;
typedef struct _KPROCESSOR_STATE;
typedef struct _KQUEUE;
typedef struct _KREQUEST_PACKET;
typedef struct _KRESOURCEMANAGER;
typedef struct _KRESOURCEMANAGER_COMPLETION_BINDING;
typedef struct _KSCB;
typedef struct _KSCHEDULING_GROUP;
typedef struct _KSCHEDULING_GROUP_POLICY;
typedef struct _KSECONDARY_IDT_ENTRY;
typedef struct _KSECURE_FAULT_INFORMATION;
typedef struct _KSEMAPHORE;
typedef struct _KSHARED_READY_QUEUE;
typedef struct _KSPECIAL_REGISTERS;
typedef struct _KSPIN_LOCK_QUEUE;
typedef struct _KSTACK_CONTROL;
typedef union _KSTACK_COUNT;
typedef struct _KSYSTEM_TIME;
typedef struct _KTHREAD;
typedef struct _KTHREAD_COUNTERS;
typedef struct _KTIMER;
typedef struct _KTIMER_EXPIRATION_TRACE;
typedef struct _KTIMER_TABLE;
typedef struct _KTIMER_TABLE_ENTRY;
typedef struct _KTIMER2;
typedef struct _KTIMER2_COLLECTION;
typedef struct _KTM;
typedef struct _KTMNOTIFICATION_PACKET;
typedef struct _KTMOBJECT_NAMESPACE;
typedef struct _KTMOBJECT_NAMESPACE_LINK;
typedef struct _KTRANSACTION;
typedef struct _KTRANSACTION_HISTORY;
typedef struct _KTRAP_FRAME;
typedef struct _KTSS64;
typedef struct _KUMS_CONTEXT_HEADER;
typedef struct _KUSER_SHARED_DATA;
typedef struct _KWAIT_BLOCK;
typedef struct _KWAIT_CHAIN;
typedef struct _KWAIT_CHAIN_ENTRY;
typedef union _KWAIT_STATUS_REGISTER;
typedef union _LARGE_INTEGER;
typedef struct _LAZY_WRITER;
typedef struct _LDR_DATA_TABLE_ENTRY;
typedef struct _LDR_DDAG_NODE;
typedef struct _LDR_SERVICE_TAG_RECORD;
typedef struct _LDRP_CSLIST;
typedef struct _LDRP_LOAD_CONTEXT;
typedef struct _LEARNING_MODE_DATA;
typedef struct _LIST_ENTRY;
typedef struct _LIST_ENTRY32;
typedef struct _LIST_ENTRY64;
typedef struct _LOCK_HEADER;
typedef struct _LOCK_TRACKER;
typedef struct _LOG_HANDLE_CONTEXT;
typedef struct _LOGGED_STREAM_CALLBACK_V1;
typedef struct _LOGGED_STREAM_CALLBACK_V2;
typedef struct _LOOKASIDE_LIST_EX;
typedef struct _LPCP_MESSAGE;
typedef struct _LPCP_NONPAGED_PORT_QUEUE;
typedef struct _LPCP_PORT_OBJECT;
typedef struct _LPCP_PORT_QUEUE;
typedef struct _LUID;
typedef struct _LUID_AND_ATTRIBUTES;
typedef struct _M128A;
typedef struct _MAILSLOT_CREATE_PARAMETERS;
typedef struct _MAPPED_FILE_SEGMENT;
typedef struct _MBCB;
typedef struct _MCGEN_TRACE_CONTEXT;
typedef struct _MDL;
typedef struct _MEMORY_ALLOCATION_DESCRIPTOR;
typedef struct _MI_ACCESS_LOG_STATE;
typedef struct _MI_AVAILABLE_PAGE_WAIT_STATES;
typedef struct _MI_BAD_MEMORY_EVENT_ENTRY;
typedef struct _MI_CACHED_PTE;
typedef struct _MI_CACHED_PTES;
typedef struct _MI_CLONE_BLOCK_FLAGS;
typedef struct _MI_COMBINE_PAGE_LISTHEAD;
typedef struct _MI_COMBINE_STATE;
typedef struct _MI_COMBINE_WORKITEM;
typedef struct _MI_COMMON_PAGE_STATE;
typedef struct _MI_CONTROL_AREA_WAIT_BLOCK;
typedef struct _MI_CROSS_PARTITION_CHARGES;
typedef struct _MI_DEBUGGER_STATE;
typedef struct _MI_DECAY_TIMER_LINK;
typedef struct _MI_DECAY_TIMER_LINKAGE;
typedef struct _MI_DRIVER_VA;
typedef struct _MI_DYNAMIC_BITMAP;
typedef struct _MI_ERROR_STATE;
typedef struct _MI_EXTRA_IMAGE_INFORMATION;
typedef union _MI_FLAGS;
typedef struct _MI_FORCED_COMMITS;
typedef struct _MI_HARDWARE_STATE;
typedef struct _MI_HYPER_SPACE;
typedef struct _MI_IMAGE_SECURITY_REFERENCE;
typedef struct _MI_IO_CACHE_STATS;
typedef struct _MI_IO_PAGE_STATE;
typedef struct _MI_LARGEPAGE_IMAGE_INFO;
typedef struct _MI_LDW_WORK_CONTEXT;
typedef struct _MI_MODWRITE_DATA;
typedef struct _MI_NODE_INFORMATION;
typedef struct _MI_PAGE_COMBINE_STATISTICS;
typedef struct _MI_PAGE_COMBINING_SUPPORT;
typedef struct _MI_PAGEFILE_BITMAPS_CACHE_ENTRY;
typedef struct _MI_PAGEFILE_TRACES;
typedef struct _MI_PAGELIST_STATE;
typedef struct _MI_PAGING_FILE_SPACE_BITMAPS;
typedef struct _MI_PAGING_IO_STATE;
typedef struct _MI_PARTITION;
typedef struct _MI_PARTITION_COMMIT;
typedef struct _MI_PARTITION_CORE;
typedef struct _MI_PARTITION_FLAGS;
typedef struct _MI_PARTITION_MODWRITES;
typedef struct _MI_PARTITION_PAGE_LISTS;
typedef struct _MI_PARTITION_SEGMENTS;
typedef struct _MI_PARTITION_STATE;
typedef struct _MI_PARTITION_STORES;
typedef struct _MI_PARTITION_ZEROING;
typedef struct _MI_PER_SESSION_PROTOS;
typedef struct _MI_POOL_FAILURE_REASONS;
typedef struct _MI_POOL_STATE;
typedef struct _MI_PROBE_RAISE_TRACKER;
typedef struct _MI_PROCESS_STATE;
typedef struct _MI_PTE_CHAIN_HEAD;
typedef struct _MI_REBUILD_LARGE_PAGE_TIMER;
typedef struct _MI_RESAVAIL_FAILURES;
typedef union _MI_RESERVATION_CLUSTER_INFO;
typedef struct _MI_RESUME_WORKITEM;
typedef struct _MI_REVERSE_VIEW_MAP;
typedef struct _MI_RFG_PROTECTED_STACK;
typedef struct _MI_SECTION_IMAGE_INFORMATION;
typedef struct _MI_SECTION_STATE;
typedef struct _MI_SESSION_DRIVER_UNLOAD;
typedef struct _MI_SESSION_STATE;
typedef struct _MI_SHUTDOWN_STATE;
typedef struct _MI_SPECIAL_POOL;
typedef struct _MI_STANDBY_STATE;
typedef struct _MI_SUB64K_FREE_RANGES;
typedef struct _MI_SUBSECTION_ENTRY1;
typedef struct _MI_SYSTEM_CACHE_VIEW_ATTRIBUTES;
typedef struct _MI_SYSTEM_IMAGE_STATE;
typedef struct _MI_SYSTEM_INFORMATION;
typedef struct _MI_SYSTEM_NODE_INFORMATION;
typedef struct _MI_SYSTEM_PTE_STATE;
typedef struct _MI_SYSTEM_PTE_TYPE;
typedef struct _MI_SYSTEM_TRIM_STATE;
typedef struct _MI_SYSTEM_VA_ASSIGNMENT;
typedef struct _MI_SYSTEM_VA_STATE;
typedef struct _MI_TRIAGE_DUMP_DATA;
typedef struct _MI_VAD_EVENT_BLOCK;
typedef struct _MI_VAD_SEQUENTIAL_INFO;
typedef struct _MI_VERIFIER_POOL_HEADER;
typedef struct _MI_VISIBLE_PARTITION;
typedef struct _MI_VISIBLE_STATE;
typedef struct _MI_WSLE;
typedef struct _MI_ZERO_COST_COUNTS;
typedef struct _MIPFNBLINK;
typedef struct _MM_DRIVER_VERIFIER_DATA;
typedef struct _MM_PAGE_ACCESS_INFO;
typedef union _MM_PAGE_ACCESS_INFO_FLAGS;
typedef struct _MM_PAGE_ACCESS_INFO_HEADER;
typedef struct _MM_PAGED_POOL_INFO;
typedef struct _MM_SESSION_SPACE;
typedef struct _MM_SESSION_SPACE_FLAGS;
typedef union _MM_STORE_KEY;
typedef struct _MM_SYSTEM_PAGE_COUNTS;
typedef struct _MMADDRESS_LIST;
typedef struct _MMCLONE_BLOCK;
typedef struct _MMCLONE_DESCRIPTOR;
typedef struct _MMCLONE_HEADER;
typedef struct _MMDEREFERENCE_SEGMENT_HEADER;
typedef struct _MMEXTEND_INFO;
typedef struct _MMINPAGE_FLAGS;
typedef struct _MMINPAGE_SUPPORT;
typedef struct _MMINPAGE_SUPPORT_FLOW_THROUGH;
typedef struct _MMMOD_WRITER_LISTHEAD;
typedef struct _MMMOD_WRITER_MDL_ENTRY;
typedef struct _MMPAGE_FILE_EXPANSION;
typedef struct _MMPAGE_FILE_EXPANSION_FLAGS;
typedef struct _MMPAGING_FILE;
typedef struct _MMPFN;
typedef struct _MMPFNENTRY1;
typedef struct _MMPFNENTRY3;
typedef struct _MMPFNLIST;
typedef struct _MMPFNLIST_SHORT;
typedef struct _MMPTE;
typedef struct _MMPTE_HARDWARE;
typedef struct _MMPTE_LIST;
typedef struct _MMPTE_PROTOTYPE;
typedef struct _MMPTE_SOFTWARE;
typedef struct _MMPTE_SUBSECTION;
typedef struct _MMPTE_TIMESTAMP;
typedef struct _MMPTE_TRANSITION;
typedef struct _MMSECTION_FLAGS;
typedef struct _MMSECTION_FLAGS2;
typedef struct _MMSECURE_FLAGS;
typedef struct _MMSESSION;
typedef struct _MMSUBSECTION_FLAGS;
typedef struct _MMSUPPORT_AGGREGATION;
typedef struct _MMSUPPORT_FLAGS;
typedef struct _MMSUPPORT_FULL;
typedef struct _MMSUPPORT_INSTANCE;
typedef struct _MMSUPPORT_SHARED;
typedef struct _MMVAD;
typedef struct _MMVAD_FLAGS;
typedef struct _MMVAD_FLAGS1;
typedef struct _MMVAD_FLAGS2;
typedef struct _MMVAD_SHORT;
typedef struct _MMWORKING_SET_EXPANSION_HEAD;
typedef struct _MMWSL_INSTANCE;
typedef struct _MODWRITER_FLAGS;
typedef struct _MSUBSECTION;
typedef struct _NAMED_PIPE_CREATE_PARAMETERS;
typedef struct _NB10;
typedef struct _NON_PAGED_DEBUG_INFO;
typedef struct _NONOPAQUE_OPLOCK;
typedef struct _NPAGED_LOOKASIDE_LIST;
typedef struct _NT_TIB;
typedef struct _NT_TIB32;
typedef struct _NT_TIB64;
typedef struct _OB_DUPLICATE_OBJECT_STATE;
typedef struct _OB_EXTENDED_PARSE_PARAMETERS;
typedef struct _OB_EXTENDED_USER_INFO;
typedef struct _OB_HANDLE_REVOCATION_BLOCK;
typedef struct _OBJECT_ATTRIBUTES;
typedef struct _OBJECT_CREATE_INFORMATION;
typedef struct _OBJECT_DIRECTORY;
typedef struct _OBJECT_DIRECTORY_ENTRY;
typedef struct _OBJECT_DUMP_CONTROL;
typedef struct _OBJECT_FOOTER;
typedef struct _OBJECT_HANDLE_COUNT_DATABASE;
typedef struct _OBJECT_HANDLE_COUNT_ENTRY;
typedef struct _OBJECT_HANDLE_INFORMATION;
typedef struct _OBJECT_HEADER;
typedef struct _OBJECT_HEADER_AUDIT_INFO;
typedef struct _OBJECT_HEADER_CREATOR_INFO;
typedef struct _OBJECT_HEADER_EXTENDED_INFO;
typedef struct _OBJECT_HEADER_HANDLE_INFO;
typedef struct _OBJECT_HEADER_NAME_INFO;
typedef struct _OBJECT_HEADER_PADDING_INFO;
typedef struct _OBJECT_HEADER_PROCESS_INFO;
typedef struct _OBJECT_HEADER_QUOTA_INFO;
typedef struct _OBJECT_NAME_INFORMATION;
typedef struct _OBJECT_NAMESPACE_LOOKUPTABLE;
typedef struct _OBJECT_REF_INFO;
typedef struct _OBJECT_REF_STACK_INFO;
typedef struct _OBJECT_REF_TRACE;
typedef struct _OBJECT_SYMBOLIC_LINK;
typedef struct _OBJECT_TYPE;
typedef struct _OBJECT_TYPE_INITIALIZER;
typedef struct _OBP_LOOKUP_CONTEXT;
typedef struct _OBP_SILODRIVERSTATE;
typedef struct _OBP_SYSTEM_DOS_DEVICE_STATE;
typedef struct _OPEN_PACKET;
typedef struct _OWNER_ENTRY;
typedef struct _PAGED_LOOKASIDE_LIST;
typedef struct _PAGEFAULT_HISTORY;
typedef struct _PALPC_PORT_REFERENCE_WAIT_BLOCK;
typedef struct _PCW_BUFFER;
typedef union _PCW_CALLBACK_INFORMATION;
typedef struct _PCW_COUNTER_DESCRIPTOR;
typedef struct _PCW_COUNTER_INFORMATION;
typedef struct _PCW_DATA;
typedef struct _PCW_INSTANCE;
typedef struct _PCW_MASK_INFORMATION;
typedef struct _PCW_PROCESSOR_INFO;
typedef struct _PCW_REGISTRATION;
typedef struct _PCW_REGISTRATION_INFORMATION;
typedef struct _PEB;
typedef struct _PEB_LDR_DATA;
typedef struct _PEB32;
typedef struct _PEB64;
typedef struct _PEBS_DS_SAVE_AREA;
typedef struct _PENDING_RELATIONS_LIST_ENTRY;
typedef struct _PEP_ACPI_EXTENDED_ADDRESS;
typedef struct _PEP_ACPI_GPIO_RESOURCE;
typedef struct _PEP_ACPI_INTERRUPT_RESOURCE;
typedef struct _PEP_ACPI_IO_MEMORY_RESOURCE;
typedef union _PEP_ACPI_RESOURCE;
typedef union _PEP_ACPI_RESOURCE_FLAGS;
typedef struct _PEP_ACPI_SPB_I2C_RESOURCE;
typedef struct _PEP_ACPI_SPB_RESOURCE;
typedef struct _PEP_ACPI_SPB_SPI_RESOURCE;
typedef struct _PEP_ACPI_SPB_UART_RESOURCE;
typedef struct _PEP_CRASHDUMP_INFORMATION;
typedef struct _PEPHANDLE__;
typedef struct _PERF_CONTROL_STATE_SELECTION;
typedef struct _PERFINFO_GROUPMASK;
typedef struct _PERFINFO_PPM_STATE_SELECTION;
typedef struct _PERIODIC_CAPTURE_STATE_GUIDS;
typedef struct _PF_KERNEL_GLOBALS;
typedef struct _PHYSICAL_MEMORY_DESCRIPTOR;
typedef struct _PHYSICAL_MEMORY_RUN;
typedef struct _PI_BUS_EXTENSION;
typedef struct _PI_RESOURCE_ARBITER_ENTRY;
typedef struct _PLATFORM_IDLE_ACCOUNTING;
typedef struct _PLATFORM_IDLE_STATE_ACCOUNTING;
typedef struct _PLUGPLAY_EVENT_BLOCK;
typedef struct _PNP_ASSIGN_RESOURCES_CONTEXT;
typedef struct _PNP_DEVICE_ACTION_ENTRY;
typedef struct _PNP_DEVICE_COMPLETION_QUEUE;
typedef struct _PNP_DEVICE_COMPLETION_REQUEST;
typedef struct _PNP_DEVICE_EVENT_ENTRY;
typedef struct _PNP_DEVICE_EVENT_LIST;
typedef struct _PNP_REBALANCE_TRACE_CONTEXT;
typedef struct _PNP_RESOURCE_CONFLICT_TRACE_CONTEXT;
typedef struct _PNP_RESOURCE_REQUEST;
typedef struct _PO_DEVICE_NOTIFY;
typedef struct _PO_DEVICE_NOTIFY_ORDER;
typedef struct _PO_DIAG_STACK_RECORD;
typedef struct _PO_FX_COMPONENT_PERF_SET;
typedef struct _PO_FX_PERF_STATE;
typedef struct _PO_FX_PERF_STATE_CHANGE;
typedef struct _PO_HIBER_PERF;
typedef struct _PO_IRP_MANAGER;
typedef struct _PO_IRP_QUEUE;
typedef struct _PO_MEMORY_IMAGE;
typedef struct _PO_NOTIFY_ORDER_LEVEL;
typedef struct _PO_PROCESS_ENERGY_CONTEXT;
typedef struct _POOL_DESCRIPTOR;
typedef struct _POOL_HEADER;
typedef struct _POOL_TRACKER_BIG_PAGES;
typedef struct _POOL_TRACKER_TABLE;
typedef struct _POP_ACTION_TRIGGER;
typedef struct _POP_COOLING_EXTENSION;
typedef struct _POP_CURRENT_BROADCAST;
typedef struct _POP_DEVICE_SYS_STATE;
typedef struct _POP_FX_ACCOUNTING;
typedef struct _POP_FX_COMPONENT;
typedef union _POP_FX_COMPONENT_FLAGS;
typedef struct _POP_FX_DEPENDENT;
typedef struct _POP_FX_DEVICE;
typedef union _POP_FX_DEVICE_STATUS;
typedef struct _POP_FX_DRIVER_CALLBACKS;
typedef struct _POP_FX_IDLE_STATE;
typedef struct _POP_FX_LOG_ENTRY;
typedef union _POP_FX_PERF_FLAGS;
typedef struct _POP_FX_PERF_INFO;
typedef struct _POP_FX_PERF_SET;
typedef struct _POP_FX_PLUGIN;
typedef struct _POP_FX_PROVIDER;
typedef struct _POP_FX_WORK_ORDER;
typedef struct _POP_FX_WORK_ORDER_WATCHDOG_INFO;
typedef struct _POP_HIBER_CONTEXT;
typedef struct _POP_IO_INFO;
typedef struct _POP_IRP_DATA;
typedef struct _POP_IRP_WORKER_ENTRY;
typedef struct _POP_PER_PROCESSOR_CONTEXT;
typedef struct _POP_POLICY_DEVICE;
typedef struct _POP_POWER_ACTION;
typedef struct _POP_POWER_SETTING_VALUES;
typedef struct _POP_PPM_PROFILE;
typedef struct _POP_RW_LOCK;
typedef struct _POP_SHUTDOWN_BUG_CHECK;
typedef struct _POP_THERMAL_TELEMETRY_TRACKER;
typedef struct _POP_THERMAL_ZONE;
typedef struct _POP_TRIGGER_WAIT;
typedef struct _PORT_MESSAGE;
typedef struct _PORT_MESSAGE32;
typedef struct _POWER_ACTION_POLICY;
typedef struct _POWER_SEQUENCE;
typedef union _POWER_STATE;
typedef struct _PP_LOOKASIDE_LIST;
typedef struct _PPC_DBGKD_CONTROL_SET;
typedef struct _PPM_CONCURRENCY_ACCOUNTING;
typedef struct _PPM_COORDINATED_SELECTION;
typedef union _PPM_COORDINATED_SYNCHRONIZATION;
typedef struct _PPM_ENGINE_SETTINGS;
typedef struct _PPM_FFH_THROTTLE_STATE_INFO;
typedef struct _PPM_IDLE_STATE;
typedef struct _PPM_IDLE_STATES;
typedef union _PPM_IDLE_SYNCHRONIZATION_STATE;
typedef struct _PPM_PLATFORM_STATE;
typedef struct _PPM_PLATFORM_STATES;
typedef union _PPM_POLICY_SETTINGS_MASK;
typedef struct _PPM_SELECTION_DEPENDENCY;
typedef struct _PPM_SELECTION_MENU;
typedef struct _PPM_SELECTION_MENU_ENTRY;
typedef struct _PPM_SELECTION_STATISTICS;
typedef struct _PPM_VETO_ACCOUNTING;
typedef struct _PPM_VETO_ENTRY;
typedef struct _PRIVATE_CACHE_MAP;
typedef struct _PRIVATE_CACHE_MAP_FLAGS;
typedef struct _PRIVILEGE_SET;
typedef struct _PROC_FEEDBACK;
typedef struct _PROC_FEEDBACK_COUNTER;
typedef struct _PROC_IDLE_ACCOUNTING;
typedef struct _PROC_IDLE_POLICY;
typedef struct _PROC_IDLE_SNAP;
typedef struct _PROC_IDLE_STATE_ACCOUNTING;
typedef struct _PROC_IDLE_STATE_BUCKET;
typedef struct _PROC_PERF_CHECK;
typedef struct _PROC_PERF_CHECK_SNAP;
typedef struct _PROC_PERF_CONSTRAINT;
typedef struct _PROC_PERF_DOMAIN;
typedef struct _PROC_PERF_HISTORY;
typedef struct _PROC_PERF_HISTORY_ENTRY;
typedef struct _PROC_PERF_LOAD;
typedef struct _PROCESS_DISK_COUNTERS;
typedef struct _PROCESS_ENERGY_VALUES;
typedef struct _PROCESS_ENERGY_VALUES_EXTENSION;
typedef struct _PROCESS_EXTENDED_ENERGY_VALUES;
typedef struct _PROCESSOR_IDLE_CONSTRAINTS;
typedef struct _PROCESSOR_IDLE_DEPENDENCY;
typedef struct _PROCESSOR_IDLE_PREPARE_INFO;
typedef struct _PROCESSOR_IDLESTATE_INFO;
typedef struct _PROCESSOR_IDLESTATE_POLICY;
typedef struct _PROCESSOR_NUMBER;
typedef struct _PROCESSOR_PERFSTATE_POLICY;
typedef struct _PROCESSOR_PLATFORM_STATE_RESIDENCIES;
typedef struct _PROCESSOR_PLATFORM_STATE_RESIDENCY;
typedef struct _PROCESSOR_POWER_STATE;
typedef struct _PROCESSOR_PROFILE_CONTROL_AREA;
typedef struct _PROVIDER_BINARY_ENTRY;
typedef union _PS_CLIENT_SECURITY_CONTEXT;
typedef union _PS_INTERLOCKED_TIMER_DELAY_VALUES;
typedef struct _PS_IO_CONTROL_ENTRY;
typedef struct _PS_JOB_WAKE_INFORMATION;
typedef struct _PS_MITIGATION_OPTIONS_MAP;
typedef struct _PS_PROCESS_WAKE_INFORMATION;
typedef struct _PS_PROPERTY_SET;
typedef struct _PS_PROTECTION;
typedef union _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS;
typedef struct _PS_TRUSTLET_ATTRIBUTE_DATA;
typedef struct _PS_TRUSTLET_ATTRIBUTE_HEADER;
typedef struct _PS_TRUSTLET_ATTRIBUTE_TYPE;
typedef struct _PS_TRUSTLET_CREATE_ATTRIBUTES;
typedef struct _PS_TRUSTLET_TKSESSION_ID;
typedef struct _PSP_STORAGE;
typedef struct _PTE_TRACKER;
typedef struct _QUAD;
typedef struct _RELATION_LIST;
typedef struct _RELATIVE_SYMLINK_INFO;
typedef struct _REMOTE_PORT_VIEW;
typedef struct _REQUEST_MAILBOX;
typedef struct _RH_OP_CONTEXT;
typedef struct _RSDS;
typedef struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME;
typedef struct _RTL_ATOM_TABLE;
typedef struct _RTL_ATOM_TABLE_ENTRY;
typedef struct _RTL_ATOM_TABLE_REFERENCE;
typedef struct _RTL_AVL_TABLE;
typedef struct _RTL_AVL_TREE;
typedef struct _RTL_BALANCED_LINKS;
typedef struct _RTL_BALANCED_NODE;
typedef struct _RTL_BITMAP;
typedef struct _RTL_BITMAP_EX;
typedef struct _RTL_CHASH_ENTRY;
typedef struct _RTL_CHASH_TABLE;
typedef struct _RTL_CRITICAL_SECTION;
typedef struct _RTL_CRITICAL_SECTION_DEBUG;
typedef struct _RTL_DRIVE_LETTER_CURDIR;
typedef struct _RTL_DYNAMIC_HASH_TABLE;
typedef struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENTRY;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR;
typedef struct _RTL_HASH_ENTRY;
typedef struct _RTL_HASH_TABLE;
typedef struct _RTL_HASH_TABLE_ITERATOR;
typedef struct _RTL_RANGE;
typedef struct _RTL_RANGE_LIST;
typedef struct _RTL_RB_TREE;
typedef union _RTL_RUN_ONCE;
typedef struct _RTL_SPLAY_LINKS;
typedef struct _RTL_SRWLOCK;
typedef struct _RTL_TIME_ZONE_INFORMATION;
typedef struct _RTL_UMS_CONTEXT;
typedef struct _RTL_USER_PROCESS_PARAMETERS;
typedef struct _RTLP_RANGE_LIST_ENTRY;
typedef struct _SCSI_REQUEST_BLOCK;
typedef struct _SE_AUDIT_PROCESS_CREATION_INFO;
typedef struct _SECTION;
typedef struct _SECTION_IMAGE_INFORMATION;
typedef struct _SECTION_OBJECT_POINTERS;
typedef struct _SECURITY_CLIENT_CONTEXT;
typedef struct _SECURITY_DESCRIPTOR;
typedef struct _SECURITY_DESCRIPTOR_RELATIVE;
typedef struct _SECURITY_QUALITY_OF_SERVICE;
typedef struct _SECURITY_SUBJECT_CONTEXT;
typedef struct _SEGMENT;
typedef struct _SEGMENT_FLAGS;
typedef struct _SEP_AUDIT_POLICY;
typedef struct _SEP_CACHED_HANDLES_ENTRY;
typedef struct _SEP_CACHED_HANDLES_ENTRY_DESCRIPTOR;
typedef struct _SEP_CACHED_HANDLES_TABLE;
typedef struct _SEP_LOGON_SESSION_REFERENCES;
typedef struct _SEP_LOWBOX_NUMBER_ENTRY;
typedef struct _SEP_LOWBOX_NUMBER_MAPPING;
typedef struct _SEP_LUID_TO_INDEX_MAP_ENTRY;
typedef struct _SEP_RM_LSA_CONNECTION_STATE;
typedef struct _SEP_SID_VALUES_BLOCK;
typedef struct _SEP_SILOSTATE;
typedef struct _SEP_TOKEN_DIAG_TRACK_ENTRY;
typedef struct _SEP_TOKEN_PRIVILEGES;
typedef struct _SESSION_LOWBOX_MAP;
typedef struct _SHARED_CACHE_MAP;
typedef struct _SHARED_CACHE_MAP_LIST_CURSOR;
typedef struct _SID;
typedef struct _SID_AND_ATTRIBUTES;
typedef struct _SID_AND_ATTRIBUTES_HASH;
typedef struct _SID_IDENTIFIER_AUTHORITY;
typedef struct _SILO_USER_SHARED_DATA;
typedef struct _SINGLE_LIST_ENTRY;
typedef struct _SINGLE_LIST_ENTRY32;
typedef struct _SLIST_ENTRY;
typedef union _SLIST_HEADER;
typedef struct _STACK_TABLE;
typedef struct _STRING;
typedef struct _STRING32;
typedef struct _STRING64;
typedef struct _SUBSECTION;
typedef struct _SYNCH_COUNTERS;
typedef struct _SYSPTES_HEADER;
typedef struct _SYSTEM_POWER_CAPABILITIES;
typedef struct _SYSTEM_POWER_LEVEL;
typedef struct _SYSTEM_POWER_POLICY;
typedef struct _SYSTEM_POWER_STATE_CONTEXT;
typedef struct _tagSWITCH_CONTEXT;
typedef struct _tagSWITCH_CONTEXT_ATTRIBUTE;
typedef struct _tagSWITCH_CONTEXT_DATA;
typedef struct _TEB;
typedef struct _TEB_ACTIVE_FRAME;
typedef struct _TEB_ACTIVE_FRAME_CONTEXT;
typedef struct _TEB32;
typedef struct _TEB64;
typedef struct _TERMINATION_PORT;
typedef struct _THERMAL_COOLING_INTERFACE;
typedef struct _THERMAL_INFORMATION;
typedef struct _THERMAL_INFORMATION_EX;
typedef struct _THERMAL_POLICY;
typedef struct _THERMAL_ZONE_COUNTERS;
typedef struct _THREAD_ENERGY_VALUES;
typedef struct _THREAD_PERFORMANCE_DATA;
typedef struct _TIME_FIELDS;
typedef union _TIMELINE_BITMAP;
typedef struct _TlgProvider_t;
typedef struct _TlgProviderMetadata_t;
typedef struct _TOKEN;
typedef struct _TOKEN_ACCESS_INFORMATION;
typedef struct _TOKEN_AUDIT_POLICY;
typedef struct _TOKEN_CONTROL;
typedef struct _TOKEN_MANDATORY_POLICY;
typedef struct _TOKEN_PRIVILEGES;
typedef struct _TOKEN_SOURCE;
typedef struct _TP_CALLBACK_ENVIRON_V3;
typedef struct _TP_CALLBACK_INSTANCE;
typedef struct _TP_CLEANUP_GROUP;
typedef struct _TP_POOL;
typedef struct _TRACE_ENABLE_INFO;
typedef struct _TRACE_LOGFILE_HEADER;
typedef struct _TraceLoggingMetadata_t;
typedef struct _TRIAGE_9F_PNP;
typedef struct _TRIAGE_9F_POWER;
typedef struct _TRIAGE_DEVICE_NODE;
typedef struct _TRIAGE_EX_WORK_QUEUE;
typedef struct _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE;
typedef struct _TRIAGE_PNP_DEVICE_COMPLETION_REQUEST;
typedef struct _TRIAGE_POP_FX_DEVICE;
typedef struct _TRIAGE_POP_IRP_DATA;
typedef struct _TRUSTLET_COLLABORATION_ID;
typedef struct _TRUSTLET_MAILBOX_KEY;
typedef struct _TXN_PARAMETER_BLOCK;
typedef union _ULARGE_INTEGER;
typedef struct _UMS_CONTROL_BLOCK;
typedef struct _UNEXPECTED_INTERRUPT;
typedef struct _UNICODE_STRING;
typedef struct _VACB;
typedef struct _VACB_ARRAY_HEADER;
typedef struct _VACB_LEVEL_ALLOCATION_LIST;
typedef struct _VACB_LEVEL_REFERENCE;
typedef struct _VERIFIER_SHARED_EXPORT_THUNK;
typedef struct _VF_ADDRESS_RANGE;
typedef struct _VF_AVL_TABLE;
typedef struct _VF_AVL_TREE;
typedef struct _VF_AVL_TREE_NODE;
typedef struct _VF_AVL_TREE_NODE_EX;
typedef struct _VF_DRIVER_IO_CALLBACKS;
typedef struct _VF_KE_CRITICAL_REGION_TRACE;
typedef struct _VF_POOL_TRACE;
typedef struct _VF_SUSPECT_DRIVER_ENTRY;
typedef struct _VF_TARGET_ALL_SHARED_EXPORT_THUNKS;
typedef struct _VF_TARGET_DRIVER;
typedef struct _VF_TARGET_VERIFIED_DRIVER_DATA;
typedef struct _VF_TRACKER;
typedef struct _VF_TRACKER_STAMP;
typedef struct _VF_WATCHDOG_IRP;
typedef struct _VI_DEADLOCK_GLOBALS;
typedef struct _VI_DEADLOCK_NODE;
typedef struct _VI_DEADLOCK_RESOURCE;
typedef struct _VI_DEADLOCK_THREAD;
typedef struct _VI_FAULT_TRACE;
typedef struct _VI_POOL_ENTRY;
typedef struct _VI_POOL_ENTRY_INUSE;
typedef struct _VI_POOL_PAGE_HEADER;
typedef struct _VI_TRACK_IRQL;
typedef struct _VI_VERIFIER_ISSUE;
typedef struct _VOLUME_CACHE_MAP;
typedef struct _VPB;
typedef struct _WAIT_CONTEXT_BLOCK;
typedef struct _WAITING_IRP;
typedef struct _WHEA_AER_BRIDGE_DESCRIPTOR;
typedef struct _WHEA_AER_ENDPOINT_DESCRIPTOR;
typedef struct _WHEA_AER_ROOTPORT_DESCRIPTOR;
typedef union _WHEA_ERROR_PACKET_FLAGS;
typedef struct _WHEA_ERROR_PACKET_V2;
typedef struct _WHEA_ERROR_RECORD;
typedef struct _WHEA_ERROR_RECORD_HEADER;
typedef union _WHEA_ERROR_RECORD_HEADER_FLAGS;
typedef union _WHEA_ERROR_RECORD_HEADER_VALIDBITS;
typedef struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;
typedef struct _WHEA_ERROR_SOURCE_DESCRIPTOR;
typedef union _WHEA_ERROR_STATUS;
typedef struct _WHEA_GENERIC_ERROR_DESCRIPTOR;
typedef struct _WHEA_GENERIC_ERROR_DESCRIPTOR_V2;
typedef struct _WHEA_IPF_CMC_DESCRIPTOR;
typedef struct _WHEA_IPF_CPE_DESCRIPTOR;
typedef struct _WHEA_IPF_MCA_DESCRIPTOR;
typedef struct _WHEA_MEMORY_ERROR_SECTION;
typedef union _WHEA_MEMORY_ERROR_SECTION_VALIDBITS;
typedef struct _WHEA_NOTIFICATION_DESCRIPTOR;
typedef union _WHEA_NOTIFICATION_FLAGS;
typedef struct _WHEA_PCI_SLOT_NUMBER;
typedef union _WHEA_PERSISTENCE_INFO;
typedef union _WHEA_REVISION;
typedef union _WHEA_TIMESTAMP;
typedef struct _WHEA_XPF_CMC_DESCRIPTOR;
typedef struct _WHEA_XPF_MC_BANK_DESCRIPTOR;
typedef struct _WHEA_XPF_MCE_DESCRIPTOR;
typedef struct _WHEA_XPF_NMI_DESCRIPTOR;
typedef struct _WHEAP_ERROR_RECORD_WRAPPER;
typedef union _WHEAP_ERROR_RECORD_WRAPPER_FLAGS;
typedef struct _WHEAP_ERROR_SOURCE;
typedef struct _WHEAP_ERROR_SOURCE_TABLE;
typedef struct _WHEAP_INFO_BLOCK;
typedef struct _WHEAP_WORK_QUEUE;
typedef struct _WMI_BUFFER_HEADER;
typedef struct _WMI_LOGGER_CONTEXT;
typedef struct _WNF_LOCK;
typedef struct _WNF_SCOPE_MAP;
typedef struct _WNF_SILODRIVERSTATE;
typedef struct _WNF_STATE_NAME;
typedef struct _WORK_QUEUE_ENTRY;
typedef struct _WORK_QUEUE_ITEM;
typedef struct _WRITE_BEHIND_THROUGHPUT;
typedef struct _X86_DBGKD_CONTROL_SET;
typedef struct _X86_KTRAP_FRAME;
typedef struct _X86_KTRAP_FRAME_BLUE;
typedef union _XPF_MC_BANK_FLAGS;
typedef union _XPF_MCE_FLAGS;
typedef struct _XSAVE_AREA;
typedef struct _XSAVE_AREA_HEADER;
typedef struct _XSAVE_FORMAT;
typedef struct _XSTATE_CONFIGURATION;
typedef struct _XSTATE_CONTEXT;
typedef struct _XSTATE_FEATURE;
typedef struct _XSTATE_SAVE;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Function types

typedef VOID (NEAR CDECL FUNCT_00DF_00DE_CleanupGroupCancelCallback_DeRefSecurityDescriptor_PostRoutine) (VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_00E6_FinalizationCallback) (struct _TP_CALLBACK_INSTANCE*, VOID*);
typedef enum _EXCEPTION_DISPOSITION (NEAR CDECL FUNCT_0184_0183_Handler) (struct _EXCEPTION_RECORD*, VOID*, struct _CONTEXT*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_02CA_PostProcessInitRoutine_FinishRoutine_DispatchAddress) ();
typedef VOID (NEAR CDECL FUNCT_00DF_05FE_DeferredRoutine) (struct _KDPC*, VOID*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_0790_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_0787_KernelRoutine) (struct _KAPC*, FUNCT_00DF_0790_NormalRoutine**, VOID**, VOID**, VOID**);
typedef VOID (NEAR CDECL FUNCT_00DF_0790_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_0795_RundownRoutine) (struct _KAPC*);
typedef VOID* (NEAR CDECL FUNCT_00E2_0855_AllocateEx) (enum _POOL_TYPE, UINT64, ULONG32, struct _LOOKASIDE_LIST_EX*);
typedef VOID* (NEAR CDECL FUNCT_00E2_085F_Allocate) (enum _POOL_TYPE, UINT64, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00DF_0864_FreeEx) (VOID*, struct _LOOKASIDE_LIST_EX*);
typedef VOID (NEAR CDECL FUNCT_00DF_0868_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure_DevicePowerRequired_DevicePowerNotRequired_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead_DisableCallback) (VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_08DE_IdlePrepare) (struct _PROCESSOR_IDLE_PREPARE_INFO*);
typedef LONG32 (NEAR CDECL FUNCT_0091_08FE_IdlePreExecute) (VOID*, ULONG32, ULONG32, ULONG32, ULONG32*);
typedef LONG32 (NEAR CDECL FUNCT_0091_0905_IdleExecute) (VOID*, UINT64, ULONG32, ULONG32, ULONG32, ULONG32*);
typedef ULONG32 (NEAR CDECL FUNCT_0009_090D_IdlePreselect) (VOID*, struct _PROCESSOR_IDLE_CONSTRAINTS*);
typedef ULONG32 (NEAR CDECL FUNCT_0009_0912_IdleTest) (VOID*, ULONG32, ULONG32);
typedef ULONG32 (NEAR CDECL FUNCT_0009_0917_IdleAvailabilityCheck) (VOID*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00DF_091B_IdleComplete) (VOID*, ULONG32, ULONG32, ULONG32, ULONG32*);
typedef VOID (NEAR CDECL FUNCT_00DF_091D_IdleCancel_PassiveCooling_Free_ComponentActive_ComponentIdle) (VOID*, ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_009A_091F_IdleIsHalted_IdleInitiateWake_CompletionRoutine) (VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_09B6_InstantaneousRead) (UINT64, ULONG32*);
typedef VOID (NEAR CDECL FUNCT_00DF_09BA_DifferentialRead) (UINT64, UINT8, UINT64*, UINT64*);
typedef VOID (NEAR CDECL FUNCT_00DF_0A39_GetFFHThrottleState) (UINT64*);
typedef VOID (NEAR CDECL FUNCT_00DF_0A3C_TimeWindowHandler_BoostPolicyHandler_BoostModeHandler_EnergyPerfPreferenceHandler_AutonomousActivityWindowHandler_AutonomousModeHandler) (UINT64, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00DF_0A40_ReinitializeHandler) (UINT64);
typedef ULONG32 (NEAR CDECL FUNCT_0009_0A43_PerfSelectionHandler) (UINT64, ULONG32, ULONG32, ULONG32, ULONG32, ULONG32, ULONG32, ULONG32*, UINT64*);
typedef VOID (NEAR CDECL FUNCT_00DF_0A4E_PerfControlHandler_DomainPerfControlHandler) (UINT64, struct _PERF_CONTROL_STATE_SELECTION*, UINT8, UINT8);
typedef VOID (NEAR CDECL FUNCT_00DF_0AEC_WorkerRoutine) (VOID*, VOID*, VOID*, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_0091_0C63_AddDevice) (struct _DRIVER_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_0091_0C7D_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter_PreQueryOpen) (struct _FS_FILTER_CALLBACK_DATA*, VOID**);
typedef VOID (NEAR CDECL FUNCT_00DF_0EC5_MiniPacketCallback) (struct _IO_MINI_COMPLETION_PACKET_USER*, VOID*);
typedef INT64 (NEAR CDECL FUNCT_00AA_1072_GetCpuClock) ();
typedef VOID (NEAR CDECL FUNCT_00DF_12C7_DriverUnload_Function) (struct _DRIVER_OBJECT*);
typedef struct _IMAGE_RUNTIME_FUNCTION_ENTRY* (NEAR CDECL FUNCT_136C_1381_Callback) (UINT64, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_13AC_UserApcRoutine) (VOID*, struct _IO_STATUS_BLOCK*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00DF_13B1_DriverStartIo_CancelRoutine) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef LONG32 (NEAR CDECL FUNCT_0091_1652_CompletionRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_165D_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter_PostQueryOpen) (struct _FS_FILTER_CALLBACK_DATA*, LONG32, VOID*);
typedef UINT8 (NEAR CDECL FUNCT_009A_1680_FastIoCheckIfPossible) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_168A_FastIoRead_FastIoWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, VOID*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_1694_FastIoQueryBasicInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_BASIC_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_16A2_FastIoQueryStandardInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_STANDARD_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_16B0_FastIoLock) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, UINT8, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_16BB_FastIoUnlockSingle) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_16C4_FastIoUnlockAll) (struct _FILE_OBJECT*, struct _EPROCESS*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_16CA_FastIoUnlockAllByKey) (struct _FILE_OBJECT*, VOID*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_16D1_FastIoDeviceControl) (struct _FILE_OBJECT*, UINT8, VOID*, ULONG32, VOID*, ULONG32, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR CDECL FUNCT_00DF_16DC_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection) (struct _FILE_OBJECT*);
typedef VOID (NEAR CDECL FUNCT_00DF_16DF_FastIoDetachDevice) (struct _DEVICE_OBJECT*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_16E3_FastIoQueryNetworkOpenInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_0091_16F3_AcquireForModWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _ERESOURCE**, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_16F9_MdlRead_PrepareMdlWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_1703_MdlReadComplete_MdlReadCompleteCompressed) (struct _FILE_OBJECT*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_1708_MdlWriteComplete_MdlWriteCompleteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_170E_FastIoReadCompressed_FastIoWriteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, VOID*, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _COMPRESSED_DATA_INFO*, ULONG32, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_009A_1723_FastIoQueryOpen) (struct _IRP*, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_0091_1728_ReleaseForModWrite) (struct _FILE_OBJECT*, struct _ERESOURCE*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_0091_172D_AcquireForCcFlush_ReleaseForCcFlush) (struct _FILE_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_0091_1731_DriverInit) (struct _DRIVER_OBJECT*, struct _UNICODE_STRING*);
typedef LONG32 (NEAR CDECL FUNCT_0091_1736_MajorFunction) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef VOID (NEAR CDECL FUNCT_00DF_1740_TimerRoutine) (struct _DEVICE_OBJECT*, VOID*);
typedef enum _IO_ALLOCATION_ACTION (NEAR CDECL FUNCT_1756_1755_DeviceRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_17A5_ActiveCooling) (VOID*, UINT8);
typedef VOID (NEAR CDECL FUNCT_00DF_1804_DumpProcedure) (VOID*, struct _OBJECT_DUMP_CONTROL*);
typedef LONG32 (NEAR CDECL FUNCT_0091_180C_OpenProcedure) (enum _OB_OPEN_REASON, CHAR, struct _EPROCESS*, VOID*, ULONG32*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00DF_181A_CloseProcedure) (struct _EPROCESS*, VOID*, UINT64, UINT64);
typedef LONG32 (NEAR CDECL FUNCT_0091_1820_ParseProcedure) (VOID*, VOID*, struct _ACCESS_STATE*, CHAR, ULONG32, struct _UNICODE_STRING*, struct _UNICODE_STRING*, VOID*, struct _SECURITY_QUALITY_OF_SERVICE*, VOID**);
typedef LONG32 (NEAR CDECL FUNCT_0091_182C_ParseProcedureEx) (VOID*, VOID*, struct _ACCESS_STATE*, CHAR, ULONG32, struct _UNICODE_STRING*, struct _UNICODE_STRING*, VOID*, struct _SECURITY_QUALITY_OF_SERVICE*, struct _OB_EXTENDED_PARSE_PARAMETERS*, VOID**);
typedef LONG32 (NEAR CDECL FUNCT_0091_183E_SecurityProcedure) (VOID*, enum _SECURITY_OPERATION_CODE, ULONG32*, VOID*, ULONG32*, VOID**, enum _POOL_TYPE, struct _GENERIC_MAPPING*, CHAR);
typedef LONG32 (NEAR CDECL FUNCT_0091_184F_QueryNameProcedure) (VOID*, UINT8, struct _OBJECT_NAME_INFORMATION*, ULONG32, ULONG32*, CHAR);
typedef UINT8 (NEAR CDECL FUNCT_009A_1857_OkayToCloseProcedure) (struct _EPROCESS*, VOID*, VOID*, CHAR);
typedef VOID (NEAR CDECL FUNCT_00DF_19C3_EnableCallback) (struct _GUID*, ULONG32, UINT8, UINT64, UINT64, struct _EVENT_FILTER_DESCRIPTOR*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_19D1_AnnotationFunc) (/*NoType*/);
typedef struct _CELL_DATA* (NEAR CDECL FUNCT_1E03_1E02_GetCellRoutine) (struct _HHIVE*, ULONG32, struct _HV_GET_CELL_CONTEXT*);
typedef VOID (NEAR CDECL FUNCT_00DF_1E5D_ReleaseCellRoutine) (struct _HHIVE*, struct _HV_GET_CELL_CONTEXT*);
typedef VOID* (NEAR CDECL FUNCT_00E2_1E61_Allocate) (ULONG32, UINT8, ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_009A_1E66_FileWrite) (struct _HHIVE*, ULONG32, struct _CMP_OFFSET_ARRAY*, ULONG32, ULONG32*, ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_009A_1E73_FileRead) (struct _HHIVE*, ULONG32, ULONG32*, VOID*, ULONG32);
typedef LONG32 (NEAR CDECL FUNCT_0091_2053_NotificationRoutine) (struct _KENLISTMENT*, VOID*, VOID*, ULONG32, union _LARGE_INTEGER*, ULONG32, VOID*);
typedef enum _RTL_GENERIC_COMPARE_RESULTS (NEAR CDECL FUNCT_2099_2098_CompareRoutine) (struct _RTL_AVL_TABLE*, VOID*, VOID*);
typedef VOID* (NEAR CDECL FUNCT_00E2_20A2_AllocateRoutine) (struct _RTL_AVL_TABLE*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00DF_20A6_FreeRoutine) (struct _RTL_AVL_TABLE*, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_0091_220D_Callback) (enum _PCW_CALLBACK_TYPE, union _PCW_CALLBACK_INFORMATION*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_2457_NextIrpCallerCompletion_CallerCompletion) (struct _DEVICE_OBJECT*, UINT8, union _POWER_STATE, VOID*, struct _IO_STATUS_BLOCK*);
typedef UINT8 (NEAR CDECL FUNCT_009A_248A_AcceptDeviceNotification_AcceptAcpiNotification) (ULONG32, VOID*);
typedef UINT8 (NEAR CDECL FUNCT_009A_248E_AcceptProcessorNotification) (struct _PEPHANDLE__*, ULONG32, VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_24A8_ComponentIdleState) (VOID*, ULONG32, ULONG32);
typedef LONG32 (NEAR CDECL FUNCT_0091_24AA_PowerControl) (VOID*, struct _GUID*, VOID*, UINT64, VOID*, UINT64, UINT64*);
typedef VOID (NEAR CDECL FUNCT_00DF_24B3_ComponentCriticalTransition) (VOID*, ULONG32, UINT8);
typedef VOID (NEAR CDECL FUNCT_00DF_24B8_DripsWatchdogCallback) (VOID*, struct _DEVICE_OBJECT*, ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_009A_24C7_PowerOnDumpDeviceCallback) (struct _PEP_CRASHDUMP_INFORMATION*);
typedef VOID (NEAR CDECL FUNCT_00DF_2515_ComponentPerfState) (VOID*, ULONG32, UINT8, VOID*);
typedef ULONG32 (NEAR CDECL FUNCT_0009_2605_ProfileDepartureSetMode) (VOID*, enum _PROFILE_DEPARTURE_STYLE);
typedef ULONG32 (NEAR CDECL FUNCT_0009_260E_ProfileDepartureUpdate) (VOID*);
typedef LONG32 (NEAR CDECL FUNCT_0091_28CD_QueryPlatformStateResidency) (VOID*, struct _PROCESSOR_PLATFORM_STATE_RESIDENCIES*);
typedef VOID (NEAR CDECL FUNCT_00DF_29A2_FlushToLsnRoutine) (VOID*, union _LARGE_INTEGER);
typedef VOID (NEAR CDECL FUNCT_00DF_29A6_QueryLogHandleInfoRoutine) (VOID*, UINT16*);
typedef UINT8 (NEAR CDECL FUNCT_009A_2A10_AcquireForLazyWrite_AcquireForReadAhead) (VOID*, UINT8);
typedef VOID (NEAR CDECL FUNCT_00DF_2AC1_Callback) (VOID*, UINT64, ULONG32);
typedef LONG32 (NEAR CDECL FUNCT_0091_2B78_CommitRoutine) (VOID*, VOID**, UINT64*);
typedef LONG32 (NEAR CDECL FUNCT_0091_2C15_DestroyProcedure) (VOID*);
typedef VOID (NEAR CDECL FUNCT_00DF_2DCD_TrackedOffsetCallback) (struct _IO_IRP_EXT_TRACK_OFFSET_HEADER*, struct _IO_IRP_EXT_TRACK_OFFSET_HEADER*, INT64);
typedef VOID (NEAR CDECL FUNCT_00DF_2F88_WorkRoutine) (struct _WHEAP_WORK_QUEUE*, struct _LIST_ENTRY*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3713_ArbiterHandler) (VOID*, enum _ARBITER_ACTION, struct _ARBITER_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3774_UnpackRequirement) (struct _IO_RESOURCE_DESCRIPTOR*, UINT64*, UINT64*, UINT64*, UINT64*);
typedef LONG32 (NEAR CDECL FUNCT_0091_377B_PackResource) (struct _IO_RESOURCE_DESCRIPTOR*, UINT64, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3780_UnpackResource) (struct _CM_PARTIAL_RESOURCE_DESCRIPTOR*, UINT64*, UINT64*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3785_ScoreRequirement) (struct _IO_RESOURCE_DESCRIPTOR*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3788_TestAllocation) (struct _ARBITER_INSTANCE*, struct _ARBITER_TEST_ALLOCATION_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_0091_378E_RetestAllocation) (struct _ARBITER_INSTANCE*, struct _ARBITER_RETEST_ALLOCATION_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3793_CommitAllocation_RollbackAllocation) (struct _ARBITER_INSTANCE*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3796_BootAllocation) (struct _ARBITER_INSTANCE*, struct _ARBITER_BOOT_ALLOCATION_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_0091_379B_QueryArbitrate) (struct _ARBITER_INSTANCE*, struct _ARBITER_QUERY_ARBITRATE_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_0091_37A0_QueryConflict) (struct _ARBITER_INSTANCE*, struct _ARBITER_QUERY_CONFLICT_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_0091_37A5_AddReserved) (struct _ARBITER_INSTANCE*, struct _ARBITER_ADD_RESERVED_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_0091_37AA_StartArbiter) (struct _ARBITER_INSTANCE*, struct _CM_RESOURCE_LIST*);
typedef LONG32 (NEAR CDECL FUNCT_0091_37AE_PreprocessEntry_AllocateEntry) (struct _ARBITER_INSTANCE*, struct _ARBITER_ALLOCATION_STATE*);
typedef UINT8 (NEAR CDECL FUNCT_009A_37B2_GetNextAllocationRange_FindSuitableRange_OverrideConflict) (struct _ARBITER_INSTANCE*, struct _ARBITER_ALLOCATION_STATE*);
typedef VOID (NEAR CDECL FUNCT_00DF_37B4_AddAllocation_BacktrackAllocation) (struct _ARBITER_INSTANCE*, struct _ARBITER_ALLOCATION_STATE*);
typedef LONG32 (NEAR CDECL FUNCT_0091_37B6_InitializeRangeList) (struct _ARBITER_INSTANCE*, ULONG32, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR*, struct _RTL_RANGE_LIST*);
typedef UINT8 (NEAR CDECL FUNCT_009A_37BC_ConflictCallback) (VOID*, struct _RTL_RANGE*);
typedef VOID (NEAR CDECL FUNCT_00DF_38B6_Callback) (struct _KTIMER2*, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3970_Callback) (struct _OBJECT_SYMBOLIC_LINK*, VOID*, struct _UNICODE_STRING*, VOID**);
typedef VOID (NEAR CDECL FUNCT_00DF_3A6C_Routine) (VOID*, VOID*, struct _IO_WORKITEM*);
typedef VOID (NEAR CDECL FUNCT_00DF_3D1F_StallRoutine) (ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_009A_3D22_OpenRoutine) (union _LARGE_INTEGER);
typedef LONG32 (NEAR CDECL FUNCT_0091_3D25_WriteRoutine) (union _LARGE_INTEGER*, struct _MDL*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3D2B_WritePendingRoutine) (LONG32, union _LARGE_INTEGER*, struct _MDL*, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3D39_ReadRoutine) (LONG32, union _LARGE_INTEGER*, struct _MDL*);
typedef LONG32 (NEAR CDECL FUNCT_0091_3D3E_GetDriveTelemetryRoutine) (ULONG32, ULONG32, VOID*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00DF_3D44_GetTransferSizesRoutine) (ULONG32*, ULONG32*);
typedef VOID (NEAR CDECL FUNCT_00DF_3D48_DumpNotifyRoutine) (enum _DUMP_EVENTS, VOID*, ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_009A_3E44_ServiceRoutine) (struct _KINTERRUPT*, VOID*);
typedef UINT8 (NEAR CDECL FUNCT_009A_3E49_MessageServiceRoutine) (struct _KINTERRUPT*, VOID*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00DF_3EC4_CompletionRoutine) (VOID*, struct _IRP*);

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Structure types

          typedef struct _ACCESS_REASONS // 1 elements, 0x80 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      Data[32];                                        
          }ACCESS_REASONS, *PACCESS_REASONS;                                   
                                                                            
          typedef struct _LUID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     ULONG32      LowPart;                                    
/*0x004*/     LONG32       HighPart;                                   
          }LUID, *PLUID;                                               
                                                                       
          typedef struct _SECURITY_SUBJECT_CONTEXT                   // 4 elements, 0x20 bytes (sizeof) 
          {                                                                                             
/*0x000*/     VOID*        ClientToken;                                                                 
/*0x008*/     enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                                    
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                             
/*0x010*/     VOID*        PrimaryToken;                                                                
/*0x018*/     VOID*        ProcessAuditId;                                                              
          }SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT;                                        
                                                                                                        
          typedef struct _LUID_AND_ATTRIBUTES // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _LUID Luid;              // 2 elements, 0x8 bytes (sizeof) 
/*0x008*/     ULONG32      Attributes;                                          
          }LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES;                                  
                                                                                
          typedef struct _INITIAL_PRIVILEGE_SET         // 3 elements, 0x2C bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[3];                                    
          }INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET;                                   
                                                                                           
          typedef struct _PRIVILEGE_SET                 // 3 elements, 0x14 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[1];                                    
          }PRIVILEGE_SET, *PPRIVILEGE_SET;                                                 
                                                                                           
          typedef struct _UNICODE_STRING    // 3 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT16       Length;                                             
/*0x002*/     UINT16       MaximumLength;                                      
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     WCHAR*       Buffer;                                             
          }UNICODE_STRING, *PUNICODE_STRING;                                   
                                                                               
          typedef struct _ACCESS_STATE                                 // 16 elements, 0xA0 bytes (sizeof) 
          {                                                                                                
/*0x000*/     struct _LUID OperationID;                                // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     UINT8        SecurityEvaluated;                                                              
/*0x009*/     UINT8        GenerateAudit;                                                                  
/*0x00A*/     UINT8        GenerateOnClose;                                                                
/*0x00B*/     UINT8        PrivilegesAllocated;                                                            
/*0x00C*/     ULONG32      Flags;                                                                          
/*0x010*/     ULONG32      RemainingDesiredAccess;                                                         
/*0x014*/     ULONG32      PreviouslyGrantedAccess;                                                        
/*0x018*/     ULONG32      OriginalDesiredAccess;                                                          
/*0x01C*/     UINT8        _PADDING0_[0x4];                                                                
/*0x020*/     struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext; // 4 elements, 0x20 bytes (sizeof)  
/*0x040*/     VOID*        SecurityDescriptor;                                                             
/*0x048*/     VOID*        AuxData;                                                                        
              union                                                    // 2 elements, 0x2C bytes (sizeof)  
              {                                                                                            
/*0x050*/         struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;   // 3 elements, 0x2C bytes (sizeof)  
/*0x050*/         struct _PRIVILEGE_SET PrivilegeSet;                  // 3 elements, 0x14 bytes (sizeof)  
              }Privileges;                                                                                 
/*0x07C*/     UINT8        AuditPrivileges;                                                                
/*0x07D*/     UINT8        _PADDING1_[0x3];                                                                
/*0x080*/     struct _UNICODE_STRING ObjectName;                       // 3 elements, 0x10 bytes (sizeof)  
/*0x090*/     struct _UNICODE_STRING ObjectTypeName;                   // 3 elements, 0x10 bytes (sizeof)  
          }ACCESS_STATE, *PACCESS_STATE;                                                                   
                                                                                                           
          typedef struct _ACL           // 5 elements, 0x8 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT8        AclRevision;                                   
/*0x001*/     UINT8        Sbz1;                                          
/*0x002*/     UINT16       AclSize;                                       
/*0x004*/     UINT16       AceCount;                                      
/*0x006*/     UINT16       Sbz2;                                          
          }ACL, *PACL;                                                    
                                                                          
typedef struct _ACTIVATION_CONTEXT // 0 elements, 0x0 bytes (sizeof) 
{                                                                    
}ACTIVATION_CONTEXT, *PACTIVATION_CONTEXT;                                  
                                                                     
typedef struct _ACTIVATION_CONTEXT_DATA // 0 elements, 0x0 bytes (sizeof) 
{                                                                         
}ACTIVATION_CONTEXT_DATA, *PACTIVATION_CONTEXT_DATA;                                  
                                                                          
          typedef struct _LIST_ENTRY     // 2 elements, 0x10 bytes (sizeof) 
          {                                                                 
/*0x000*/     struct _LIST_ENTRY* Flink;                                    
/*0x008*/     struct _LIST_ENTRY* Blink;                                    
          }LIST_ENTRY, *PLIST_ENTRY;                                        
                                                                            
          typedef struct _ACTIVATION_CONTEXT_STACK                     // 5 elements, 0x28 bytes (sizeof) 
          {                                                                                               
/*0x000*/     struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;                                    
/*0x008*/     struct _LIST_ENTRY FrameListCache;                       // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     ULONG32      Flags;                                                                         
/*0x01C*/     ULONG32      NextCookieSequenceNumber;                                                      
/*0x020*/     ULONG32      StackId;                                                                       
/*0x024*/     UINT8        _PADDING0_[0x4];                                                               
          }ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK;                                          
                                                                                                          
          typedef struct _LIST_ENTRY32 // 2 elements, 0x8 bytes (sizeof) 
          {                                                              
/*0x000*/     ULONG32      Flink;                                        
/*0x004*/     ULONG32      Blink;                                        
          }LIST_ENTRY32, *PLIST_ENTRY32;                                  
                                                                         
          typedef struct _ACTIVATION_CONTEXT_STACK32 // 5 elements, 0x18 bytes (sizeof) 
          {                                                                             
/*0x000*/     ULONG32      ActiveFrame;                                                 
/*0x004*/     struct _LIST_ENTRY32 FrameListCache;   // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     ULONG32      Flags;                                                       
/*0x010*/     ULONG32      NextCookieSequenceNumber;                                    
/*0x014*/     ULONG32      StackId;                                                     
          }ACTIVATION_CONTEXT_STACK32, *PACTIVATION_CONTEXT_STACK32;                                   
                                                                                        
          typedef struct _LIST_ENTRY64 // 2 elements, 0x10 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT64       Flink;                                         
/*0x008*/     UINT64       Blink;                                         
          }LIST_ENTRY64, *PLIST_ENTRY64;                                   
                                                                          
          typedef struct _ACTIVATION_CONTEXT_STACK64 // 5 elements, 0x28 bytes (sizeof) 
          {                                                                             
/*0x000*/     UINT64       ActiveFrame;                                                 
/*0x008*/     struct _LIST_ENTRY64 FrameListCache;   // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     ULONG32      Flags;                                                       
/*0x01C*/     ULONG32      NextCookieSequenceNumber;                                    
/*0x020*/     ULONG32      StackId;                                                     
/*0x024*/     UINT8        _PADDING0_[0x4];                                             
          }ACTIVATION_CONTEXT_STACK64, *PACTIVATION_CONTEXT_STACK64;                                   
                                                                                        
typedef struct _ADAPTER_OBJECT // 0 elements, 0x0 bytes (sizeof) 
{                                                                
}ADAPTER_OBJECT, *PADAPTER_OBJECT;                                  
                                                                 
          typedef union _AER_BRIDGE_DESCRIPTOR_FLAGS                  // 9 elements, 0x2 bytes (sizeof) 
          {                                                                                             
              struct                                                  // 8 elements, 0x2 bytes (sizeof) 
              {                                                                                         
/*0x000*/         UINT16       UncorrectableErrorMaskRW : 1;          // 0 BitPosition                  
/*0x000*/         UINT16       UncorrectableErrorSeverityRW : 1;      // 1 BitPosition                  
/*0x000*/         UINT16       CorrectableErrorMaskRW : 1;            // 2 BitPosition                  
/*0x000*/         UINT16       AdvancedCapsAndControlRW : 1;          // 3 BitPosition                  
/*0x000*/         UINT16       SecondaryUncorrectableErrorMaskRW : 1; // 4 BitPosition                  
/*0x000*/         UINT16       SecondaryUncorrectableErrorSevRW : 1;  // 5 BitPosition                  
/*0x000*/         UINT16       SecondaryCapsAndControlRW : 1;         // 6 BitPosition                  
/*0x000*/         UINT16       Reserved : 9;                          // 7 BitPosition                  
              };                                                                                        
/*0x000*/     UINT16       AsUSHORT;                                                                    
          }AER_BRIDGE_DESCRIPTOR_FLAGS, *PAER_BRIDGE_DESCRIPTOR_FLAGS;                                  
                                                                                                        
          typedef union _AER_ENDPOINT_DESCRIPTOR_FLAGS           // 6 elements, 0x2 bytes (sizeof) 
          {                                                                                        
              struct                                             // 5 elements, 0x2 bytes (sizeof) 
              {                                                                                    
/*0x000*/         UINT16       UncorrectableErrorMaskRW : 1;     // 0 BitPosition                  
/*0x000*/         UINT16       UncorrectableErrorSeverityRW : 1; // 1 BitPosition                  
/*0x000*/         UINT16       CorrectableErrorMaskRW : 1;       // 2 BitPosition                  
/*0x000*/         UINT16       AdvancedCapsAndControlRW : 1;     // 3 BitPosition                  
/*0x000*/         UINT16       Reserved : 12;                    // 4 BitPosition                  
              };                                                                                   
/*0x000*/     UINT16       AsUSHORT;                                                               
          }AER_ENDPOINT_DESCRIPTOR_FLAGS, *PAER_ENDPOINT_DESCRIPTOR_FLAGS;                                  
                                                                                                   
          typedef union _AER_ROOTPORT_DESCRIPTOR_FLAGS           // 7 elements, 0x2 bytes (sizeof) 
          {                                                                                        
              struct                                             // 6 elements, 0x2 bytes (sizeof) 
              {                                                                                    
/*0x000*/         UINT16       UncorrectableErrorMaskRW : 1;     // 0 BitPosition                  
/*0x000*/         UINT16       UncorrectableErrorSeverityRW : 1; // 1 BitPosition                  
/*0x000*/         UINT16       CorrectableErrorMaskRW : 1;       // 2 BitPosition                  
/*0x000*/         UINT16       AdvancedCapsAndControlRW : 1;     // 3 BitPosition                  
/*0x000*/         UINT16       RootErrorCommandRW : 1;           // 4 BitPosition                  
/*0x000*/         UINT16       Reserved : 11;                    // 5 BitPosition                  
              };                                                                                   
/*0x000*/     UINT16       AsUSHORT;                                                               
          }AER_ROOTPORT_DESCRIPTOR_FLAGS, *PAER_ROOTPORT_DESCRIPTOR_FLAGS;                                  
                                                                                                   
          typedef struct _GUID       // 4 elements, 0x10 bytes (sizeof) 
          {                                                             
/*0x000*/     ULONG32      Data1;                                       
/*0x004*/     UINT16       Data2;                                       
/*0x006*/     UINT16       Data3;                                       
/*0x008*/     UINT8        Data4[8];                                    
          }GUID, *PGUID;                                                
                                                                        
          typedef struct _EVENT_PAYLOAD_PREDICATE // 3 elements, 0x18 bytes (sizeof) 
          {                                                                          
/*0x000*/     UINT16       FieldIndex;                                               
/*0x002*/     UINT16       CompareOp;                                                
/*0x004*/     UINT8        _PADDING0_[0x4];                                          
/*0x008*/     UINT64       Value[2];                                                 
          }EVENT_PAYLOAD_PREDICATE, *PEVENT_PAYLOAD_PREDICATE;                                   
                                                                                     
          typedef struct _AGGREGATED_PAYLOAD_FILTER              // 18 elements, 0x50 bytes (sizeof) 
          {                                                                                          
              struct                                             // 2 elements, 0x2 bytes (sizeof)   
              {                                                                                      
/*0x000*/         UINT16       MagicValue : 12;                  // 0 BitPosition                    
/*0x000*/         UINT16       DescriptorVersion : 4;            // 12 BitPosition                   
              };                                                                                     
/*0x002*/     UINT16       Size;                                                                     
/*0x004*/     UINT16       PredicateCount;                                                           
/*0x006*/     UINT16       Reserved;                                                                 
/*0x008*/     UINT64       HashedEventIdBitmap;                                                      
/*0x010*/     struct _GUID ProviderGuid;                         // 4 elements, 0x10 bytes (sizeof)  
/*0x020*/     UINT16       EachEventTableOffset;                                                     
/*0x022*/     UINT16       EachEventTableLength;                                                     
/*0x024*/     UINT16       PayloadDecoderTableOffset;                                                
/*0x026*/     UINT16       PayloadDecoderTableLength;                                                
/*0x028*/     UINT16       EventFilterTableOffset;                                                   
/*0x02A*/     UINT16       EventFilterTableLength;                                                   
/*0x02C*/     UINT16       UNICODEStringTableOffset;                                                 
/*0x02E*/     UINT16       UNICODEStringTableLength;                                                 
/*0x030*/     UINT16       ANSIStringTableOffset;                                                    
/*0x032*/     UINT16       ANSIStringTableLength;                                                    
/*0x034*/     UINT8        _PADDING0_[0x4];                                                          
/*0x038*/     struct _EVENT_PAYLOAD_PREDICATE PredicateTable[1];                                     
          }AGGREGATED_PAYLOAD_FILTER, *PAGGREGATED_PAYLOAD_FILTER;                                    
                                                                                                     
          typedef struct _EX_PUSH_LOCK                 // 7 elements, 0x8 bytes (sizeof) 
          {                                                                              
              union                                    // 3 elements, 0x8 bytes (sizeof) 
              {                                                                          
                  struct                               // 5 elements, 0x8 bytes (sizeof) 
                  {                                                                      
/*0x000*/             UINT64       Locked : 1;         // 0 BitPosition                  
/*0x000*/             UINT64       Waiting : 1;        // 1 BitPosition                  
/*0x000*/             UINT64       Waking : 1;         // 2 BitPosition                  
/*0x000*/             UINT64       MultipleShared : 1; // 3 BitPosition                  
/*0x000*/             UINT64       Shared : 60;        // 4 BitPosition                  
                  };                                                                     
/*0x000*/         UINT64       Value;                                                    
/*0x000*/         VOID*        Ptr;                                                      
              };                                                                         
          }EX_PUSH_LOCK, *PEX_PUSH_LOCK;                                                 
                                                                                         
          typedef struct _ALPC_HANDLE_TABLE       // 4 elements, 0x18 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _ALPC_HANDLE_ENTRY* Handles;                                    
/*0x008*/     ULONG32      TotalHandles;                                             
/*0x00C*/     ULONG32      Flags;                                                    
/*0x010*/     struct _EX_PUSH_LOCK Lock;          // 7 elements, 0x8 bytes (sizeof)  
          }ALPC_HANDLE_TABLE, *PALPC_HANDLE_TABLE;                                   
                                                                                     
          typedef struct _ALPC_COMMUNICATION_INFO         // 6 elements, 0x48 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _ALPC_PORT* ConnectionPort;                                             
/*0x008*/     struct _ALPC_PORT* ServerCommunicationPort;                                    
/*0x010*/     struct _ALPC_PORT* ClientCommunicationPort;                                    
/*0x018*/     struct _LIST_ENTRY CommunicationList;       // 2 elements, 0x10 bytes (sizeof) 
/*0x028*/     struct _ALPC_HANDLE_TABLE HandleTable;      // 4 elements, 0x18 bytes (sizeof) 
/*0x040*/     struct _KALPC_MESSAGE* CloseMessage;                                           
          }ALPC_COMMUNICATION_INFO, *PALPC_COMMUNICATION_INFO;                                   
                                                                                             
          typedef struct _ALPC_COMPLETION_LIST             // 21 elements, 0xA0 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _LIST_ENTRY Entry;                    // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/     struct _EPROCESS* OwnerProcess;                                                  
/*0x018*/     struct _EX_PUSH_LOCK CompletionListLock;     // 7 elements, 0x8 bytes (sizeof)   
/*0x020*/     struct _MDL* Mdl;                                                                
/*0x028*/     VOID*        UserVa;                                                             
/*0x030*/     VOID*        UserLimit;                                                          
/*0x038*/     VOID*        DataUserVa;                                                         
/*0x040*/     VOID*        SystemVa;                                                           
/*0x048*/     UINT64       TotalSize;                                                          
/*0x050*/     struct _ALPC_COMPLETION_LIST_HEADER* Header;                                     
/*0x058*/     VOID*        List;                                                               
/*0x060*/     UINT64       ListSize;                                                           
/*0x068*/     VOID*        Bitmap;                                                             
/*0x070*/     UINT64       BitmapSize;                                                         
/*0x078*/     VOID*        Data;                                                               
/*0x080*/     UINT64       DataSize;                                                           
/*0x088*/     ULONG32      BitmapLimit;                                                        
/*0x08C*/     ULONG32      BitmapNextHint;                                                     
/*0x090*/     ULONG32      ConcurrencyCount;                                                   
/*0x094*/     ULONG32      AttributeFlags;                                                     
/*0x098*/     ULONG32      AttributeSize;                                                      
/*0x09C*/     UINT8        _PADDING0_[0x4];                                                    
          }ALPC_COMPLETION_LIST, *PALPC_COMPLETION_LIST;                                       
                                                                                               
          typedef struct _ALPC_COMPLETION_LIST_STATE       // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                  
              union                                        // 2 elements, 0x8 bytes (sizeof) 
              {                                                                              
                  struct                                   // 3 elements, 0x8 bytes (sizeof) 
                  {                                                                          
/*0x000*/             UINT64       Head : 24;              // 0 BitPosition                  
/*0x000*/             UINT64       Tail : 24;              // 24 BitPosition                 
/*0x000*/             UINT64       ActiveThreadCount : 16; // 48 BitPosition                 
                  }s1;                                                                       
/*0x000*/         INT64        Value;                                                        
              }u1;                                                                           
          }ALPC_COMPLETION_LIST_STATE, *PALPC_COMPLETION_LIST_STATE;                                  
                                                                                             
          typedef struct _RTL_SRWLOCK                  // 7 elements, 0x8 bytes (sizeof) 
          {                                                                              
              union                                    // 3 elements, 0x8 bytes (sizeof) 
              {                                                                          
                  struct                               // 5 elements, 0x8 bytes (sizeof) 
                  {                                                                      
/*0x000*/             UINT64       Locked : 1;         // 0 BitPosition                  
/*0x000*/             UINT64       Waiting : 1;        // 1 BitPosition                  
/*0x000*/             UINT64       Waking : 1;         // 2 BitPosition                  
/*0x000*/             UINT64       MultipleShared : 1; // 3 BitPosition                  
/*0x000*/             UINT64       Shared : 60;        // 4 BitPosition                  
                  };                                                                     
/*0x000*/         UINT64       Value;                                                    
/*0x000*/         VOID*        Ptr;                                                      
              };                                                                         
          }RTL_SRWLOCK, *PRTL_SRWLOCK;                                                   
                                                                                         
          typedef struct _ALPC_COMPLETION_LIST_HEADER   // 18 elements, 0x180 bytes (sizeof) 
          {                                                                                  
/*0x000*/     UINT64       StartMagic;                                                       
/*0x008*/     ULONG32      TotalSize;                                                        
/*0x00C*/     ULONG32      ListOffset;                                                       
/*0x010*/     ULONG32      ListSize;                                                         
/*0x014*/     ULONG32      BitmapOffset;                                                     
/*0x018*/     ULONG32      BitmapSize;                                                       
/*0x01C*/     ULONG32      DataOffset;                                                       
/*0x020*/     ULONG32      DataSize;                                                         
/*0x024*/     ULONG32      AttributeFlags;                                                   
/*0x028*/     ULONG32      AttributeSize;                                                    
/*0x02C*/     UINT8        _PADDING0_[0x14];                                                 
/*0x040*/     struct _ALPC_COMPLETION_LIST_STATE State; // 1 elements, 0x8 bytes (sizeof)    
/*0x048*/     ULONG32      LastMessageId;                                                    
/*0x04C*/     ULONG32      LastCallbackId;                                                   
/*0x050*/     UINT8        _PADDING1_[0x30];                                                 
/*0x080*/     ULONG32      PostCount;                                                        
/*0x084*/     UINT8        _PADDING2_[0x3C];                                                 
/*0x0C0*/     ULONG32      ReturnCount;                                                      
/*0x0C4*/     UINT8        _PADDING3_[0x3C];                                                 
/*0x100*/     ULONG32      LogSequenceNumber;                                                
/*0x104*/     UINT8        _PADDING4_[0x3C];                                                 
/*0x140*/     struct _RTL_SRWLOCK UserLock;             // 7 elements, 0x8 bytes (sizeof)    
/*0x148*/     UINT64       EndMagic;                                                         
/*0x150*/     UINT8        _PADDING5_[0x30];                                                 
          }ALPC_COMPLETION_LIST_HEADER, *PALPC_COMPLETION_LIST_HEADER;                                     
                                                                                             
          typedef struct _SINGLE_LIST_ENTRY    // 1 elements, 0x8 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _SINGLE_LIST_ENTRY* Next;                                   
          }SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY;                                  
                                                                                 
          typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY   // 3 elements, 0x18 bytes (sizeof) 
          {                                                                                           
/*0x000*/     struct _SINGLE_LIST_ENTRY ListEntry;                 // 1 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _IO_MINI_COMPLETION_PACKET_USER* Packet;                                         
/*0x010*/     struct _ALPC_COMPLETION_PACKET_LOOKASIDE* Lookaside;                                    
          }ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY, *PALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY;                                   
                                                                                                      
          typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE             // 10 elements, 0x50 bytes (sizeof) 
          {                                                                                                
/*0x000*/     UINT64       Lock;                                                                           
/*0x008*/     ULONG32      Size;                                                                           
/*0x00C*/     ULONG32      ActiveCount;                                                                    
/*0x010*/     ULONG32      PendingNullCount;                                                               
/*0x014*/     ULONG32      PendingCheckCompletionListCount;                                                
/*0x018*/     ULONG32      PendingDelete;                                                                  
/*0x01C*/     UINT8        _PADDING0_[0x4];                                                                
/*0x020*/     struct _SINGLE_LIST_ENTRY FreeListHead;                  // 1 elements, 0x8 bytes (sizeof)   
/*0x028*/     VOID*        CompletionPort;                                                                 
/*0x030*/     VOID*        CompletionKey;                                                                  
/*0x038*/     struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY Entry[1];                                     
          }ALPC_COMPLETION_PACKET_LOOKASIDE, *PALPC_COMPLETION_PACKET_LOOKASIDE;                                    
                                                                                                           
          typedef union _KALPC_DIRECT_EVENT    // 3 elements, 0x8 bytes (sizeof) 
          {                                                                      
/*0x000*/     UINT64       Event;                                                
              struct                           // 2 elements, 0x8 bytes (sizeof) 
              {                                                                  
/*0x000*/         UINT64       Referenced : 1; // 0 BitPosition                  
/*0x000*/         UINT64       Reserved : 63;  // 1 BitPosition                  
              };                                                                 
          }KALPC_DIRECT_EVENT, *PKALPC_DIRECT_EVENT;                                  
                                                                                 
          typedef struct _ALPC_DISPATCH_CONTEXT                   // 12 elements, 0x40 bytes (sizeof) 
          {                                                                                           
/*0x000*/     struct _ALPC_PORT* PortObject;                                                          
/*0x008*/     struct _KALPC_MESSAGE* Message;                                                         
/*0x010*/     struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;                                     
/*0x018*/     struct _ETHREAD* TargetThread;                                                          
/*0x020*/     struct _ALPC_PORT* TargetPort;                                                          
/*0x028*/     union _KALPC_DIRECT_EVENT DirectEvent;              // 3 elements, 0x8 bytes (sizeof)   
/*0x030*/     ULONG32      Flags;                                                                     
/*0x034*/     UINT16       TotalLength;                                                               
/*0x036*/     UINT16       Type;                                                                      
/*0x038*/     UINT16       DataInfoOffset;                                                            
/*0x03A*/     UINT8        SignalCompletion;                                                          
/*0x03B*/     UINT8        PostedToCompletionList;                                                    
/*0x03C*/     UINT8        _PADDING0_[0x4];                                                           
          }ALPC_DISPATCH_CONTEXT, *PALPC_DISPATCH_CONTEXT;                                            
                                                                                                      
          typedef struct _ALPC_HANDLE_ENTRY // 1 elements, 0x8 bytes (sizeof) 
          {                                                                   
/*0x000*/     VOID*        Object;                                            
          }ALPC_HANDLE_ENTRY, *PALPC_HANDLE_ENTRY;                                  
                                                                              
          typedef struct _ALPC_MESSAGE_ATTRIBUTES // 2 elements, 0x8 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      AllocatedAttributes;                                     
/*0x004*/     ULONG32      ValidAttributes;                                         
          }ALPC_MESSAGE_ATTRIBUTES, *PALPC_MESSAGE_ATTRIBUTES;                                  
                                                                                    
          typedef struct _SECURITY_QUALITY_OF_SERVICE                // 4 elements, 0xC bytes (sizeof) 
          {                                                                                            
/*0x000*/     ULONG32      Length;                                                                     
/*0x004*/     enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                                   
/*0x008*/     UINT8        ContextTrackingMode;                                                        
/*0x009*/     UINT8        EffectiveOnly;                                                              
/*0x00A*/     UINT8        _PADDING0_[0x2];                                                            
          }SECURITY_QUALITY_OF_SERVICE, *PSECURITY_QUALITY_OF_SERVICE;                                  
                                                                                                       
          typedef struct _TOKEN_SOURCE       // 2 elements, 0x10 bytes (sizeof) 
          {                                                                     
/*0x000*/     CHAR         SourceName[8];                                       
/*0x008*/     struct _LUID SourceIdentifier; // 2 elements, 0x8 bytes (sizeof)  
          }TOKEN_SOURCE, *PTOKEN_SOURCE;                                        
                                                                                
          typedef struct _TOKEN_CONTROL         // 4 elements, 0x28 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _LUID TokenId;             // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _LUID AuthenticationId;    // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/     struct _LUID ModifiedId;          // 2 elements, 0x8 bytes (sizeof)  
/*0x018*/     struct _TOKEN_SOURCE TokenSource; // 2 elements, 0x10 bytes (sizeof) 
          }TOKEN_CONTROL, *PTOKEN_CONTROL;                                         
                                                                                   
          typedef struct _SECURITY_CLIENT_CONTEXT              // 6 elements, 0x48 bytes (sizeof) 
          {                                                                                       
/*0x000*/     struct _SECURITY_QUALITY_OF_SERVICE SecurityQos; // 4 elements, 0xC bytes (sizeof)  
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                       
/*0x010*/     VOID*        ClientToken;                                                           
/*0x018*/     UINT8        DirectlyAccessClientToken;                                             
/*0x019*/     UINT8        DirectAccessEffectiveOnly;                                             
/*0x01A*/     UINT8        ServerIsRemote;                                                        
/*0x01B*/     UINT8        _PADDING1_[0x1];                                                       
/*0x01C*/     struct _TOKEN_CONTROL ClientTokenControl;        // 4 elements, 0x28 bytes (sizeof) 
/*0x044*/     UINT8        _PADDING2_[0x4];                                                       
          }SECURITY_CLIENT_CONTEXT, *PSECURITY_CLIENT_CONTEXT;                                    
                                                                                                  
          typedef struct _ALPC_PORT_ATTRIBUTES                 // 10 elements, 0x48 bytes (sizeof) 
          {                                                                                        
/*0x000*/     ULONG32      Flags;                                                                  
/*0x004*/     struct _SECURITY_QUALITY_OF_SERVICE SecurityQos; // 4 elements, 0xC bytes (sizeof)   
/*0x010*/     UINT64       MaxMessageLength;                                                       
/*0x018*/     UINT64       MemoryBandwidth;                                                        
/*0x020*/     UINT64       MaxPoolUsage;                                                           
/*0x028*/     UINT64       MaxSectionSize;                                                         
/*0x030*/     UINT64       MaxViewSize;                                                            
/*0x038*/     UINT64       MaxTotalSectionSize;                                                    
/*0x040*/     ULONG32      DupObjectTypes;                                                         
/*0x044*/     ULONG32      Reserved;                                                               
          }ALPC_PORT_ATTRIBUTES, *PALPC_PORT_ATTRIBUTES;                                           
                                                                                                   
          typedef struct _ALPC_PORT                                                // 40 elements, 0x1D8 bytes (sizeof) 
          {                                                                                                             
/*0x000*/     struct _LIST_ENTRY PortListEntry;                                    // 2 elements, 0x10 bytes (sizeof)   
/*0x010*/     struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;                                                       
/*0x018*/     struct _EPROCESS* OwnerProcess;                                                                           
/*0x020*/     VOID*        CompletionPort;                                                                              
/*0x028*/     VOID*        CompletionKey;                                                                               
/*0x030*/     struct _ALPC_COMPLETION_PACKET_LOOKASIDE* CompletionPacketLookaside;                                      
/*0x038*/     VOID*        PortContext;                                                                                 
/*0x040*/     struct _SECURITY_CLIENT_CONTEXT StaticSecurity;                      // 6 elements, 0x48 bytes (sizeof)   
/*0x088*/     struct _EX_PUSH_LOCK IncomingQueueLock;                              // 7 elements, 0x8 bytes (sizeof)    
/*0x090*/     struct _LIST_ENTRY MainQueue;                                        // 2 elements, 0x10 bytes (sizeof)   
/*0x0A0*/     struct _LIST_ENTRY LargeMessageQueue;                                // 2 elements, 0x10 bytes (sizeof)   
/*0x0B0*/     struct _EX_PUSH_LOCK PendingQueueLock;                               // 7 elements, 0x8 bytes (sizeof)    
/*0x0B8*/     struct _LIST_ENTRY PendingQueue;                                     // 2 elements, 0x10 bytes (sizeof)   
/*0x0C8*/     struct _EX_PUSH_LOCK DirectQueueLock;                                // 7 elements, 0x8 bytes (sizeof)    
/*0x0D0*/     struct _LIST_ENTRY DirectQueue;                                      // 2 elements, 0x10 bytes (sizeof)   
/*0x0E0*/     struct _EX_PUSH_LOCK WaitQueueLock;                                  // 7 elements, 0x8 bytes (sizeof)    
/*0x0E8*/     struct _LIST_ENTRY WaitQueue;                                        // 2 elements, 0x10 bytes (sizeof)   
              union                                                                // 2 elements, 0x8 bytes (sizeof)    
              {                                                                                                         
/*0x0F8*/         struct _KSEMAPHORE* Semaphore;                                                                        
/*0x0F8*/         struct _KEVENT* DummyEvent;                                                                           
              };                                                                                                        
/*0x100*/     struct _ALPC_PORT_ATTRIBUTES PortAttributes;                         // 10 elements, 0x48 bytes (sizeof)  
/*0x148*/     struct _EX_PUSH_LOCK ResourceListLock;                               // 7 elements, 0x8 bytes (sizeof)    
/*0x150*/     struct _LIST_ENTRY ResourceListHead;                                 // 2 elements, 0x10 bytes (sizeof)   
/*0x160*/     struct _EX_PUSH_LOCK PortObjectLock;                                 // 7 elements, 0x8 bytes (sizeof)    
/*0x168*/     struct _ALPC_COMPLETION_LIST* CompletionList;                                                             
/*0x170*/     struct _CALLBACK_OBJECT* CallbackObject;                                                                  
/*0x178*/     VOID*        CallbackContext;                                                                             
/*0x180*/     struct _LIST_ENTRY CanceledQueue;                                    // 2 elements, 0x10 bytes (sizeof)   
/*0x190*/     LONG32       SequenceNo;                                                                                  
/*0x194*/     LONG32       ReferenceNo;                                                                                 
/*0x198*/     struct _PALPC_PORT_REFERENCE_WAIT_BLOCK* ReferenceNoWait;                                                 
              union                                                                // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                                         
                  struct                                                           // 16 elements, 0x4 bytes (sizeof)   
                  {                                                                                                     
/*0x1A0*/             ULONG32      Initialized : 1;                                // 0 BitPosition                     
/*0x1A0*/             ULONG32      Type : 2;                                       // 1 BitPosition                     
/*0x1A0*/             ULONG32      ConnectionPending : 1;                          // 3 BitPosition                     
/*0x1A0*/             ULONG32      ConnectionRefused : 1;                          // 4 BitPosition                     
/*0x1A0*/             ULONG32      Disconnected : 1;                               // 5 BitPosition                     
/*0x1A0*/             ULONG32      Closed : 1;                                     // 6 BitPosition                     
/*0x1A0*/             ULONG32      NoFlushOnClose : 1;                             // 7 BitPosition                     
/*0x1A0*/             ULONG32      ReturnExtendedInfo : 1;                         // 8 BitPosition                     
/*0x1A0*/             ULONG32      Waitable : 1;                                   // 9 BitPosition                     
/*0x1A0*/             ULONG32      DynamicSecurity : 1;                            // 10 BitPosition                    
/*0x1A0*/             ULONG32      Wow64CompletionList : 1;                        // 11 BitPosition                    
/*0x1A0*/             ULONG32      Lpc : 1;                                        // 12 BitPosition                    
/*0x1A0*/             ULONG32      LpcToLpc : 1;                                   // 13 BitPosition                    
/*0x1A0*/             ULONG32      HasCompletionList : 1;                          // 14 BitPosition                    
/*0x1A0*/             ULONG32      HadCompletionList : 1;                          // 15 BitPosition                    
/*0x1A0*/             ULONG32      EnableCompletionList : 1;                       // 16 BitPosition                    
                  }s1;                                                                                                  
/*0x1A0*/         ULONG32      State;                                                                                   
              }u1;                                                                                                      
/*0x1A8*/     struct _ALPC_PORT* TargetQueuePort;                                                                       
/*0x1B0*/     struct _ALPC_PORT* TargetSequencePort;                                                                    
/*0x1B8*/     struct _KALPC_MESSAGE* CachedMessage;                                                                     
/*0x1C0*/     ULONG32      MainQueueLength;                                                                             
/*0x1C4*/     ULONG32      LargeMessageQueueLength;                                                                     
/*0x1C8*/     ULONG32      PendingQueueLength;                                                                          
/*0x1CC*/     ULONG32      DirectQueueLength;                                                                           
/*0x1D0*/     ULONG32      CanceledQueueLength;                                                                         
/*0x1D4*/     ULONG32      WaitQueueLength;                                                                             
          }ALPC_PORT, *PALPC_PORT;                                                                                      
                                                                                                                        
          typedef struct _ALPC_PROCESS_CONTEXT  // 3 elements, 0x20 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _EX_PUSH_LOCK Lock;        // 7 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _LIST_ENTRY ViewListHead;  // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     UINT64       PagedPoolQuotaCache;                                    
          }ALPC_PROCESS_CONTEXT, *PALPC_PROCESS_CONTEXT;                                   
                                                                                   
          typedef struct _ALPC_WORK_ON_BEHALF_TICKET // 2 elements, 0x8 bytes (sizeof) 
          {                                                                            
/*0x000*/     ULONG32      ThreadId;                                                   
/*0x004*/     ULONG32      ThreadCreationTimeLow;                                      
          }ALPC_WORK_ON_BEHALF_TICKET, *PALPC_WORK_ON_BEHALF_TICKET;                                  
                                                                                       
          typedef struct _AMD64_DBGKD_CONTROL_SET // 4 elements, 0x1C bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      TraceFlag;                                                
/*0x004*/     UINT64       Dr7;                                                      
/*0x00C*/     UINT64       CurrentSymbolStart;                                       
/*0x014*/     UINT64       CurrentSymbolEnd;                                         
          }AMD64_DBGKD_CONTROL_SET, *PAMD64_DBGKD_CONTROL_SET;                                   
                                                                                     
          typedef struct _ARBITER_ADD_RESERVED_PARAMETERS // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                 
/*0x000*/     struct _DEVICE_OBJECT* ReserveDevice;                                         
          }ARBITER_ADD_RESERVED_PARAMETERS, *PARBITER_ADD_RESERVED_PARAMETERS;                                  
                                                                                            
          typedef struct _ARBITER_ALLOCATION_STATE             // 12 elements, 0x50 bytes (sizeof) 
          {                                                                                        
/*0x000*/     UINT64       Start;                                                                  
/*0x008*/     UINT64       End;                                                                    
/*0x010*/     UINT64       CurrentMinimum;                                                         
/*0x018*/     UINT64       CurrentMaximum;                                                         
/*0x020*/     struct _ARBITER_LIST_ENTRY* Entry;                                                   
/*0x028*/     struct _ARBITER_ALTERNATIVE* CurrentAlternative;                                     
/*0x030*/     ULONG32      AlternativeCount;                                                       
/*0x034*/     UINT8        _PADDING0_[0x4];                                                        
/*0x038*/     struct _ARBITER_ALTERNATIVE* Alternatives;                                           
/*0x040*/     UINT16       Flags;                                                                  
/*0x042*/     UINT8        RangeAttributes;                                                        
/*0x043*/     UINT8        RangeAvailableAttributes;                                               
/*0x044*/     UINT8        _PADDING1_[0x4];                                                        
/*0x048*/     UINT64       WorkSpace;                                                              
          }ARBITER_ALLOCATION_STATE, *PARBITER_ALLOCATION_STATE;                                    
                                                                                                   
          typedef struct _ARBITER_ALTERNATIVE             // 8 elements, 0x40 bytes (sizeof) 
          {                                                                                  
/*0x000*/     UINT64       Minimum;                                                          
/*0x008*/     UINT64       Maximum;                                                          
/*0x010*/     UINT64       Length;                                                           
/*0x018*/     UINT64       Alignment;                                                        
/*0x020*/     LONG32       Priority;                                                         
/*0x024*/     ULONG32      Flags;                                                            
/*0x028*/     struct _IO_RESOURCE_DESCRIPTOR* Descriptor;                                    
/*0x030*/     ULONG32      Reserved[3];                                                      
/*0x03C*/     UINT8        _PADDING0_[0x4];                                                  
          }ARBITER_ALTERNATIVE, *PARBITER_ALTERNATIVE;                                       
                                                                                             
          typedef struct _ARBITER_BOOT_ALLOCATION_PARAMETERS // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _LIST_ENTRY* ArbitrationList;                                             
          }ARBITER_BOOT_ALLOCATION_PARAMETERS, *PARBITER_BOOT_ALLOCATION_PARAMETERS;                                  
                                                                                               
          typedef struct _ARBITER_CONFLICT_INFO    // 3 elements, 0x18 bytes (sizeof) 
          {                                                                           
/*0x000*/     struct _DEVICE_OBJECT* OwningObject;                                    
/*0x008*/     UINT64       Start;                                                     
/*0x010*/     UINT64       End;                                                       
          }ARBITER_CONFLICT_INFO, *PARBITER_CONFLICT_INFO;                                   
                                                                                      
          typedef struct _ARBITER_ORDERING_LIST    // 3 elements, 0x10 bytes (sizeof) 
          {                                                                           
/*0x000*/     UINT16       Count;                                                     
/*0x002*/     UINT16       Maximum;                                                   
/*0x004*/     UINT8        _PADDING0_[0x4];                                           
/*0x008*/     struct _ARBITER_ORDERING* Orderings;                                    
          }ARBITER_ORDERING_LIST, *PARBITER_ORDERING_LIST;                                   
                                                                                      
          typedef struct _ARBITER_INSTANCE                                                                       // 40 elements, 0x150 bytes (sizeof) 
          {                                                                                                                                           
/*0x000*/     ULONG32      Signature;                                                                                                                 
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                                                           
/*0x008*/     struct _KEVENT* MutexEvent;                                                                                                             
/*0x010*/     WCHAR*       Name;                                                                                                                      
/*0x018*/     WCHAR*       OrderingName;                                                                                                              
/*0x020*/     INT32        ResourceType;                                                                                                              
/*0x024*/     UINT8        _PADDING1_[0x4];                                                                                                           
/*0x028*/     struct _RTL_RANGE_LIST* Allocation;                                                                                                     
/*0x030*/     struct _RTL_RANGE_LIST* PossibleAllocation;                                                                                             
/*0x038*/     struct _ARBITER_ORDERING_LIST OrderingList;                                                        // 3 elements, 0x10 bytes (sizeof)   
/*0x048*/     struct _ARBITER_ORDERING_LIST ReservedList;                                                        // 3 elements, 0x10 bytes (sizeof)   
/*0x058*/     LONG32       ReferenceCount;                                                                                                            
/*0x05C*/     UINT8        _PADDING2_[0x4];                                                                                                           
/*0x060*/     struct _ARBITER_INTERFACE* Interface;                                                                                                   
/*0x068*/     ULONG32      AllocationStackMaxSize;                                                                                                    
/*0x06C*/     UINT8        _PADDING3_[0x4];                                                                                                           
/*0x070*/     struct _ARBITER_ALLOCATION_STATE* AllocationStack;                                                                                      
/*0x078*/     FUNCT_0091_3774_UnpackRequirement* UnpackRequirement;                                                                                   
/*0x080*/     FUNCT_0091_377B_PackResource* PackResource;                                                                                             
/*0x088*/     FUNCT_0091_3780_UnpackResource* UnpackResource;                                                                                         
/*0x090*/     FUNCT_0091_3785_ScoreRequirement* ScoreRequirement;                                                                                     
/*0x098*/     FUNCT_0091_3788_TestAllocation* TestAllocation;                                                                                         
/*0x0A0*/     FUNCT_0091_378E_RetestAllocation* RetestAllocation;                                                                                     
/*0x0A8*/     FUNCT_0091_3793_CommitAllocation_RollbackAllocation* CommitAllocation;                                                                  
/*0x0B0*/     FUNCT_0091_3793_CommitAllocation_RollbackAllocation* RollbackAllocation;                                                                
/*0x0B8*/     FUNCT_0091_3796_BootAllocation* BootAllocation;                                                                                         
/*0x0C0*/     FUNCT_0091_379B_QueryArbitrate* QueryArbitrate;                                                                                         
/*0x0C8*/     FUNCT_0091_37A0_QueryConflict* QueryConflict;                                                                                           
/*0x0D0*/     FUNCT_0091_37A5_AddReserved* AddReserved;                                                                                               
/*0x0D8*/     FUNCT_0091_37AA_StartArbiter* StartArbiter;                                                                                             
/*0x0E0*/     FUNCT_0091_37AE_PreprocessEntry_AllocateEntry* PreprocessEntry;                                                                         
/*0x0E8*/     FUNCT_0091_37AE_PreprocessEntry_AllocateEntry* AllocateEntry;                                                                           
/*0x0F0*/     FUNCT_009A_37B2_GetNextAllocationRange_FindSuitableRange_OverrideConflict* GetNextAllocationRange;                                      
/*0x0F8*/     FUNCT_009A_37B2_GetNextAllocationRange_FindSuitableRange_OverrideConflict* FindSuitableRange;                                           
/*0x100*/     FUNCT_00DF_37B4_AddAllocation_BacktrackAllocation* AddAllocation;                                                                       
/*0x108*/     FUNCT_00DF_37B4_AddAllocation_BacktrackAllocation* BacktrackAllocation;                                                                 
/*0x110*/     FUNCT_009A_37B2_GetNextAllocationRange_FindSuitableRange_OverrideConflict* OverrideConflict;                                            
/*0x118*/     FUNCT_0091_37B6_InitializeRangeList* InitializeRangeList;                                                                               
/*0x120*/     UINT8        TransactionInProgress;                                                                                                     
/*0x121*/     UINT8        _PADDING4_[0x7];                                                                                                           
/*0x128*/     struct _KEVENT* TransactionEvent;                                                                                                       
/*0x130*/     VOID*        Extension;                                                                                                                 
/*0x138*/     struct _DEVICE_OBJECT* BusDeviceObject;                                                                                                 
/*0x140*/     VOID*        ConflictCallbackContext;                                                                                                   
/*0x148*/     FUNCT_009A_37BC_ConflictCallback* ConflictCallback;                                                                                     
          }ARBITER_INSTANCE, *PARBITER_INSTANCE;                                                                                                      
                                                                                                                                                      
          typedef struct _ARBITER_INTERFACE                                                                                                                                                                                                                  // 7 elements, 0x30 bytes (sizeof) 
          {                                                                                                                                                                                                                                                                                     
/*0x000*/     UINT16       Size;                                                                                                                                                                                                                                                                
/*0x002*/     UINT16       Version;                                                                                                                                                                                                                                                             
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                                                                                                                                                                                                     
/*0x008*/     VOID*        Context;                                                                                                                                                                                                                                                             
/*0x010*/     FUNCT_00DF_0868_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure_DevicePowerRequired_DevicePowerNotRequired_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead_DisableCallback* InterfaceReference;                                      
/*0x018*/     FUNCT_00DF_0868_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure_DevicePowerRequired_DevicePowerNotRequired_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead_DisableCallback* InterfaceDereference;                                    
/*0x020*/     FUNCT_0091_3713_ArbiterHandler* ArbiterHandler;                                                                                                                                                                                                                                   
/*0x028*/     ULONG32      Flags;                                                                                                                                                                                                                                                               
/*0x02C*/     UINT8        _PADDING1_[0x4];                                                                                                                                                                                                                                                     
          }ARBITER_INTERFACE, *PARBITER_INTERFACE;                                                                                                                                                                                                                                              
                                                                                                                                                                                                                                                                                                
          typedef struct _ARBITER_LIST_ENTRY                       // 13 elements, 0x60 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _LIST_ENTRY ListEntry;                        // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/     ULONG32      AlternativeCount;                                                           
/*0x014*/     UINT8        _PADDING0_[0x4];                                                            
/*0x018*/     struct _IO_RESOURCE_DESCRIPTOR* Alternatives;                                            
/*0x020*/     struct _DEVICE_OBJECT* PhysicalDeviceObject;                                             
/*0x028*/     enum _ARBITER_REQUEST_SOURCE RequestSource;                                              
/*0x02C*/     ULONG32      Flags;                                                                      
/*0x030*/     INT64        WorkSpace;                                                                  
/*0x038*/     enum _INTERFACE_TYPE InterfaceType;                                                      
/*0x03C*/     ULONG32      SlotNumber;                                                                 
/*0x040*/     ULONG32      BusNumber;                                                                  
/*0x044*/     UINT8        _PADDING1_[0x4];                                                            
/*0x048*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* Assignment;                                      
/*0x050*/     struct _IO_RESOURCE_DESCRIPTOR* SelectedAlternative;                                     
/*0x058*/     enum _ARBITER_RESULT Result;                                                             
/*0x05C*/     UINT8        _PADDING2_[0x4];                                                            
          }ARBITER_LIST_ENTRY, *PARBITER_LIST_ENTRY;                                                   
                                                                                                       
          typedef struct _ARBITER_ORDERING // 2 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     UINT64       Start;                                             
/*0x008*/     UINT64       End;                                               
          }ARBITER_ORDERING, *PARBITER_ORDERING;                                   
                                                                              
          typedef struct _ARBITER_TEST_ALLOCATION_PARAMETERS        // 3 elements, 0x18 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _LIST_ENTRY* ArbitrationList;                                                     
/*0x008*/     ULONG32      AllocateFromCount;                                                          
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                            
/*0x010*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                                    
          }ARBITER_TEST_ALLOCATION_PARAMETERS, *PARBITER_TEST_ALLOCATION_PARAMETERS;                                   
                                                                                                       
          typedef struct _ARBITER_RETEST_ALLOCATION_PARAMETERS      // 3 elements, 0x18 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _LIST_ENTRY* ArbitrationList;                                                     
/*0x008*/     ULONG32      AllocateFromCount;                                                          
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                            
/*0x010*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                                    
          }ARBITER_RETEST_ALLOCATION_PARAMETERS, *PARBITER_RETEST_ALLOCATION_PARAMETERS;                                   
                                                                                                       
          typedef struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                              
/*0x000*/     struct _CM_PARTIAL_RESOURCE_LIST** AllocatedResources;                                     
          }ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS, *PARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS;                                  
                                                                                                         
          typedef struct _ARBITER_QUERY_CONFLICT_PARAMETERS        // 4 elements, 0x20 bytes (sizeof) 
          {                                                                                           
/*0x000*/     struct _DEVICE_OBJECT* PhysicalDeviceObject;                                            
/*0x008*/     struct _IO_RESOURCE_DESCRIPTOR* ConflictingResource;                                    
/*0x010*/     ULONG32*     ConflictCount;                                                             
/*0x018*/     struct _ARBITER_CONFLICT_INFO** Conflicts;                                              
          }ARBITER_QUERY_CONFLICT_PARAMETERS, *PARBITER_QUERY_CONFLICT_PARAMETERS;                                   
                                                                                                      
          typedef struct _ARBITER_QUERY_ARBITRATE_PARAMETERS // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _LIST_ENTRY* ArbitrationList;                                             
          }ARBITER_QUERY_ARBITRATE_PARAMETERS, *PARBITER_QUERY_ARBITRATE_PARAMETERS;                                  
                                                                                               
          typedef struct _ARBITER_PARAMETERS                                                    // 1 elements, 0x20 bytes (sizeof) 
          {                                                                                                                        
              union                                                                             // 7 elements, 0x20 bytes (sizeof) 
              {                                                                                                                    
/*0x000*/         struct _ARBITER_TEST_ALLOCATION_PARAMETERS TestAllocation;                    // 3 elements, 0x18 bytes (sizeof) 
/*0x000*/         struct _ARBITER_RETEST_ALLOCATION_PARAMETERS RetestAllocation;                // 3 elements, 0x18 bytes (sizeof) 
/*0x000*/         struct _ARBITER_BOOT_ALLOCATION_PARAMETERS BootAllocation;                    // 1 elements, 0x8 bytes (sizeof)  
/*0x000*/         struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS QueryAllocatedResources; // 1 elements, 0x8 bytes (sizeof)  
/*0x000*/         struct _ARBITER_QUERY_CONFLICT_PARAMETERS QueryConflict;                      // 4 elements, 0x20 bytes (sizeof) 
/*0x000*/         struct _ARBITER_QUERY_ARBITRATE_PARAMETERS QueryArbitrate;                    // 1 elements, 0x8 bytes (sizeof)  
/*0x000*/         struct _ARBITER_ADD_RESERVED_PARAMETERS AddReserved;                          // 1 elements, 0x8 bytes (sizeof)  
              }Parameters;                                                                                                         
          }ARBITER_PARAMETERS, *PARBITER_PARAMETERS;                                                                               
                                                                                                                                   
          typedef struct _ARM_DBGKD_CONTROL_SET // 3 elements, 0xC bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      Continue;                                              
/*0x004*/     ULONG32      CurrentSymbolStart;                                    
/*0x008*/     ULONG32      CurrentSymbolEnd;                                      
          }ARM_DBGKD_CONTROL_SET, *PARM_DBGKD_CONTROL_SET;                                  
                                                                                  
          typedef struct _ARM64_DBGKD_CONTROL_SET // 4 elements, 0x18 bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      Continue;                                                 
/*0x004*/     ULONG32      TraceFlag;                                                
/*0x008*/     UINT64       CurrentSymbolStart;                                       
/*0x010*/     UINT64       CurrentSymbolEnd;                                         
          }ARM64_DBGKD_CONTROL_SET, *PARM64_DBGKD_CONTROL_SET;                                   
                                                                                     
          typedef struct _ARMCE_DBGKD_CONTROL_SET // 3 elements, 0xC bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      Continue;                                                
/*0x004*/     ULONG32      CurrentSymbolStart;                                      
/*0x008*/     ULONG32      CurrentSymbolEnd;                                        
          }ARMCE_DBGKD_CONTROL_SET, *PARMCE_DBGKD_CONTROL_SET;                                  
                                                                                    
typedef struct _ASSEMBLY_STORAGE_MAP // 0 elements, 0x0 bytes (sizeof) 
{                                                                      
}ASSEMBLY_STORAGE_MAP, *PASSEMBLY_STORAGE_MAP;                                  
                                                                       
          typedef struct _ASYNC_READ_THREAD_STATS // 1 elements, 0x194 bytes (sizeof) 
          {                                                                           
/*0x000*/     ULONG32      CurrentLoad[101];                                          
          }ASYNC_READ_THREAD_STATS, *PASYNC_READ_THREAD_STATS;                                    
                                                                                      
          typedef struct _SID_AND_ATTRIBUTES_HASH  // 3 elements, 0x110 bytes (sizeof) 
          {                                                                            
/*0x000*/     ULONG32      SidCount;                                                   
/*0x004*/     UINT8        _PADDING0_[0x4];                                            
/*0x008*/     struct _SID_AND_ATTRIBUTES* SidAttr;                                     
/*0x010*/     UINT64       Hash[32];                                                   
          }SID_AND_ATTRIBUTES_HASH, *PSID_AND_ATTRIBUTES_HASH;                                    
                                                                                       
          typedef struct _AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION                                       // 10 elements, 0x260 bytes (sizeof) 
          {                                                                                                                                 
/*0x000*/     ULONG32      DeviceGroupsCount;                                                                                               
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                                                 
/*0x008*/     struct _SID_AND_ATTRIBUTES* pDeviceGroups;                                                                                    
/*0x010*/     ULONG32      RestrictedDeviceGroupsCount;                                                                                     
/*0x014*/     UINT8        _PADDING1_[0x4];                                                                                                 
/*0x018*/     struct _SID_AND_ATTRIBUTES* pRestrictedDeviceGroups;                                                                          
/*0x020*/     struct _SID_AND_ATTRIBUTES_HASH DeviceGroupsHash;                                        // 3 elements, 0x110 bytes (sizeof)  
/*0x130*/     struct _SID_AND_ATTRIBUTES_HASH RestrictedDeviceGroupsHash;                              // 3 elements, 0x110 bytes (sizeof)  
/*0x240*/     struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pUserSecurityAttributes;                                                  
/*0x248*/     struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pDeviceSecurityAttributes;                                                
/*0x250*/     struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pRestrictedUserSecurityAttributes;                                        
/*0x258*/     struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION* pRestrictedDeviceSecurityAttributes;                                      
          }AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION, *PAUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION;                                                
                                                                                                                                            
          typedef struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION // 4 elements, 0x30 bytes (sizeof) 
          {                                                                                             
/*0x000*/     ULONG32      SecurityAttributeCount;                                                      
/*0x004*/     UINT8        _PADDING0_[0x4];                                                             
/*0x008*/     struct _LIST_ENTRY SecurityAttributesList;             // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     ULONG32      WorkingSecurityAttributeCount;                                               
/*0x01C*/     UINT8        _PADDING1_[0x4];                                                             
/*0x020*/     struct _LIST_ENTRY WorkingSecurityAttributesList;      // 2 elements, 0x10 bytes (sizeof) 
          }AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION, *PAUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION;                                   
                                                                                                        
          typedef struct _GENERIC_MAPPING  // 4 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     ULONG32      GenericRead;                                       
/*0x004*/     ULONG32      GenericWrite;                                      
/*0x008*/     ULONG32      GenericExecute;                                    
/*0x00C*/     ULONG32      GenericAll;                                        
          }GENERIC_MAPPING, *PGENERIC_MAPPING;                                   
                                                                              
          typedef struct _AUX_ACCESS_DATA                                                                              // 12 elements, 0xE0 bytes (sizeof) 
          {                                                                                                                                                
/*0x000*/     struct _PRIVILEGE_SET* PrivilegesUsed;                                                                                                       
/*0x008*/     struct _GENERIC_MAPPING GenericMapping;                                                                  // 4 elements, 0x10 bytes (sizeof)  
/*0x018*/     ULONG32      AccessesToAudit;                                                                                                                
/*0x01C*/     ULONG32      MaximumAuditMask;                                                                                                               
/*0x020*/     struct _GUID TransactionId;                                                                              // 4 elements, 0x10 bytes (sizeof)  
/*0x030*/     VOID*        NewSecurityDescriptor;                                                                                                          
/*0x038*/     VOID*        ExistingSecurityDescriptor;                                                                                                     
/*0x040*/     VOID*        ParentSecurityDescriptor;                                                                                                       
/*0x048*/     FUNCT_00DF_00DE_CleanupGroupCancelCallback_DeRefSecurityDescriptor_PostRoutine* DeRefSecurityDescriptor;                                     
/*0x050*/     VOID*        SDLock;                                                                                                                         
/*0x058*/     struct _ACCESS_REASONS AccessReasons;                                                                    // 1 elements, 0x80 bytes (sizeof)  
/*0x0D8*/     UINT8        GenerateStagingEvents;                                                                                                          
/*0x0D9*/     UINT8        _PADDING0_[0x7];                                                                                                                
          }AUX_ACCESS_DATA, *PAUX_ACCESS_DATA;                                                                                                             
                                                                                                                                                           
          typedef struct _BATTERY_REPORTING_SCALE // 2 elements, 0x8 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      Granularity;                                             
/*0x004*/     ULONG32      Capacity;                                                
          }BATTERY_REPORTING_SCALE, *PBATTERY_REPORTING_SCALE;                                  
                                                                                    
          typedef struct _BITMAP_RANGE      // 6 elements, 0x30 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _LIST_ENTRY Links;     // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     INT64        BasePage;                                           
/*0x018*/     ULONG32      FirstDirtyPage;                                     
/*0x01C*/     ULONG32      LastDirtyPage;                                      
/*0x020*/     ULONG32      DirtyPages;                                         
/*0x024*/     UINT8        _PADDING0_[0x4];                                    
/*0x028*/     ULONG32*     Bitmap;                                             
          }BITMAP_RANGE, *PBITMAP_RANGE;                                       
                                                                               
          typedef struct _SLIST_ENTRY       // 1 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _SLIST_ENTRY* Next;                                       
/*0x008*/     UINT8        _PADDING0_[0x8];                                    
          }SLIST_ENTRY, *PSLIST_ENTRY;                                         
                                                                               
          typedef struct _BLOB                         // 7 elements, 0x30 bytes (sizeof) 
          {                                                                               
              union                                    // 2 elements, 0x10 bytes (sizeof) 
              {                                                                           
/*0x000*/         struct _LIST_ENTRY ResourceList;     // 2 elements, 0x10 bytes (sizeof) 
/*0x000*/         struct _SLIST_ENTRY FreeListEntry;   // 1 elements, 0x10 bytes (sizeof) 
              };                                                                          
              union                                    // 2 elements, 0x1 bytes (sizeof)  
              {                                                                           
                  struct                               // 4 elements, 0x1 bytes (sizeof)  
                  {                                                                       
/*0x010*/             UINT8        ReferenceCache : 1; // 0 BitPosition                   
/*0x010*/             UINT8        Lookaside : 1;      // 1 BitPosition                   
/*0x010*/             UINT8        Initializing : 1;   // 2 BitPosition                   
/*0x010*/             UINT8        Deleted : 1;        // 3 BitPosition                   
                  }s1;                                                                    
/*0x010*/         UINT8        Flags;                                                     
              }u1;                                                                        
/*0x011*/     UINT8        ResourceId;                                                    
/*0x012*/     INT16        CachedReferences;                                              
/*0x014*/     UINT8        _PADDING0_[0x4];                                               
/*0x018*/     INT64        ReferenceCount;                                                
/*0x020*/     struct _EX_PUSH_LOCK Lock;               // 7 elements, 0x8 bytes (sizeof)  
/*0x028*/     UINT8        _PADDING1_[0x8];                                               
          }BLOB, *PBLOB;                                                                  
                                                                                          
          typedef struct _BLOB_COUNTERS    // 2 elements, 0x8 bytes (sizeof) 
          {                                                                  
/*0x000*/     ULONG32      CreatedObjects;                                   
/*0x004*/     ULONG32      DeletedObjects;                                   
          }BLOB_COUNTERS, *PBLOB_COUNTERS;                                   
                                                                             
          typedef struct _BLOB_TYPE                                                                                                                                                                                                                     // 8 elements, 0x30 bytes (sizeof) 
          {                                                                                                                                                                                                                                                                                
/*0x000*/     enum _BLOB_ID ResourceId;                                                                                                                                                                                                                                                    
/*0x004*/     ULONG32      PoolTag;                                                                                                                                                                                                                                                        
/*0x008*/     ULONG32      LookasideIndex;                                                                                                                                                                                                                                                 
/*0x00C*/     ULONG32      Flags;                                                                                                                                                                                                                                                          
/*0x010*/     struct _BLOB_COUNTERS* Counters;                                                                                                                                                                                                                                             
/*0x018*/     FUNCT_00DF_0868_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure_DevicePowerRequired_DevicePowerNotRequired_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead_DisableCallback* DeleteProcedure;                                    
/*0x020*/     FUNCT_0091_2C15_DestroyProcedure* DestroyProcedure;                                                                                                                                                                                                                          
/*0x028*/     UINT64       UsualSize;                                                                                                                                                                                                                                                      
          }BLOB_TYPE, *PBLOB_TYPE;                                                                                                                                                                                                                                                         
                                                                                                                                                                                                                                                                                           
          typedef struct _BUS_EXTENSION_LIST          // 2 elements, 0x10 bytes (sizeof) 
          {                                                                              
/*0x000*/     VOID*        Next;                                                         
/*0x008*/     struct _PI_BUS_EXTENSION* BusExtension;                                    
          }BUS_EXTENSION_LIST, *PBUS_EXTENSION_LIST;                                     
                                                                                         
          typedef struct _CACHE_DESCRIPTOR     // 5 elements, 0xC bytes (sizeof) 
          {                                                                      
/*0x000*/     UINT8        Level;                                                
/*0x001*/     UINT8        Associativity;                                        
/*0x002*/     UINT16       LineSize;                                             
/*0x004*/     ULONG32      Size;                                                 
/*0x008*/     enum _PROCESSOR_CACHE_TYPE Type;                                   
          }CACHE_DESCRIPTOR, *PCACHE_DESCRIPTOR;                                  
                                                                                 
          typedef struct _CACHE_MANAGER_CALLBACKS                                                                                                                                                                                                            // 4 elements, 0x20 bytes (sizeof) 
          {                                                                                                                                                                                                                                                                                     
/*0x000*/     FUNCT_009A_2A10_AcquireForLazyWrite_AcquireForReadAhead* AcquireForLazyWrite;                                                                                                                                                                                                     
/*0x008*/     FUNCT_00DF_0868_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure_DevicePowerRequired_DevicePowerNotRequired_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead_DisableCallback* ReleaseFromLazyWrite;                                    
/*0x010*/     FUNCT_009A_2A10_AcquireForLazyWrite_AcquireForReadAhead* AcquireForReadAhead;                                                                                                                                                                                                     
/*0x018*/     FUNCT_00DF_0868_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure_DevicePowerRequired_DevicePowerNotRequired_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead_DisableCallback* ReleaseFromReadAhead;                                    
          }CACHE_MANAGER_CALLBACKS, *PCACHE_MANAGER_CALLBACKS;                                                                                                                                                                                                                                  
                                                                                                                                                                                                                                                                                                
          typedef struct _DISPATCHER_HEADER                                // 57 elements, 0x18 bytes (sizeof) 
          {                                                                                                    
              union                                                        // 8 elements, 0x4 bytes (sizeof)   
              {                                                                                                
/*0x000*/         LONG32       Lock;                                                                           
/*0x000*/         LONG32       LockNV;                                                                         
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        Type;                                                                       
/*0x001*/             UINT8        Signalling;                                                                 
/*0x002*/             UINT8        Size;                                                                       
/*0x003*/             UINT8        Reserved1;                                                                  
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        TimerType;                                                                  
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x001*/                 UINT8        TimerControlFlags;                                                      
                          struct                                           // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x001*/                     UINT8        Absolute : 1;                   // 0 BitPosition                    
/*0x001*/                     UINT8        Wake : 1;                       // 1 BitPosition                    
/*0x001*/                     UINT8        EncodedTolerableDelay : 6;      // 2 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x002*/             UINT8        Hand;                                                                       
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x003*/                 UINT8        TimerMiscFlags;                                                         
                          struct                                           // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x003*/                     UINT8        Index : 6;                      // 0 BitPosition                    
/*0x003*/                     UINT8        Inserted : 1;                   // 6 BitPosition                    
/*0x003*/                     UINT8        Expired : 1;                    // 7 BitPosition                    
                          };                                                                                   
                      };                                                                                       
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        Timer2Type;                                                                 
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x001*/                 UINT8        Timer2Flags;                                                            
                          struct                                           // 7 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x001*/                     UINT8        Timer2Inserted : 1;             // 0 BitPosition                    
/*0x001*/                     UINT8        Timer2Expiring : 1;             // 1 BitPosition                    
/*0x001*/                     UINT8        Timer2CancelPending : 1;        // 2 BitPosition                    
/*0x001*/                     UINT8        Timer2SetPending : 1;           // 3 BitPosition                    
/*0x001*/                     UINT8        Timer2Running : 1;              // 4 BitPosition                    
/*0x001*/                     UINT8        Timer2Disabled : 1;             // 5 BitPosition                    
/*0x001*/                     UINT8        Timer2ReservedFlags : 2;        // 6 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x002*/             UINT8        Timer2ComponentId;                                                          
/*0x003*/             UINT8        Timer2RelativeId;                                                           
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        QueueType;                                                                  
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x001*/                 UINT8        QueueControlFlags;                                                      
                          struct                                           // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x001*/                     UINT8        Abandoned : 1;                  // 0 BitPosition                    
/*0x001*/                     UINT8        DisableIncrement : 1;           // 1 BitPosition                    
/*0x001*/                     UINT8        QueueReservedControlFlags : 6;  // 2 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x002*/             UINT8        QueueSize;                                                                  
/*0x003*/             UINT8        QueueReserved;                                                              
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        ThreadType;                                                                 
/*0x001*/             UINT8        ThreadReserved;                                                             
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x002*/                 UINT8        ThreadControlFlags;                                                     
                          struct                                           // 7 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x002*/                     UINT8        CycleProfiling : 1;             // 0 BitPosition                    
/*0x002*/                     UINT8        CounterProfiling : 1;           // 1 BitPosition                    
/*0x002*/                     UINT8        GroupScheduling : 1;            // 2 BitPosition                    
/*0x002*/                     UINT8        AffinitySet : 1;                // 3 BitPosition                    
/*0x002*/                     UINT8        Tagged : 1;                     // 4 BitPosition                    
/*0x002*/                     UINT8        EnergyProfiling : 1;            // 5 BitPosition                    
/*0x002*/                     UINT8        ThreadReservedControlFlags : 2; // 6 BitPosition                    
                          };                                                                                   
                      };                                                                                       
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x003*/                 UINT8        DebugActive;                                                            
                          struct                                           // 6 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x003*/                     UINT8        ActiveDR7 : 1;                  // 0 BitPosition                    
/*0x003*/                     UINT8        Instrumented : 1;               // 1 BitPosition                    
/*0x003*/                     UINT8        Minimal : 1;                    // 2 BitPosition                    
/*0x003*/                     UINT8        Reserved4 : 3;                  // 3 BitPosition                    
/*0x003*/                     UINT8        UmsScheduled : 1;               // 6 BitPosition                    
/*0x003*/                     UINT8        UmsPrimary : 1;                 // 7 BitPosition                    
                          };                                                                                   
                      };                                                                                       
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        MutantType;                                                                 
/*0x001*/             UINT8        MutantSize;                                                                 
/*0x002*/             UINT8        DpcActive;                                                                  
/*0x003*/             UINT8        MutantReserved;                                                             
                  };                                                                                           
              };                                                                                               
/*0x004*/     LONG32       SignalState;                                                                        
/*0x008*/     struct _LIST_ENTRY WaitListHead;                             // 2 elements, 0x10 bytes (sizeof)  
          }DISPATCHER_HEADER, *PDISPATCHER_HEADER;                                                             
                                                                                                               
          typedef struct _KEVENT                // 1 elements, 0x18 bytes (sizeof)  
          {                                                                         
/*0x000*/     struct _DISPATCHER_HEADER Header; // 57 elements, 0x18 bytes (sizeof) 
          }KEVENT, *PKEVENT;                                                        
                                                                                    
          typedef struct _CACHE_UNINITIALIZE_EVENT    // 2 elements, 0x20 bytes (sizeof) 
          {                                                                              
/*0x000*/     struct _CACHE_UNINITIALIZE_EVENT* Next;                                    
/*0x008*/     struct _KEVENT Event;                   // 1 elements, 0x18 bytes (sizeof) 
          }CACHE_UNINITIALIZE_EVENT, *PCACHE_UNINITIALIZE_EVENT;                                   
                                                                                         
          typedef struct _CACHED_CHILD_LIST              // 3 elements, 0x10 bytes (sizeof) 
          {                                                                                 
/*0x000*/     ULONG32      Count;                                                           
/*0x004*/     UINT8        _PADDING0_[0x4];                                                 
              union                                      // 2 elements, 0x8 bytes (sizeof)  
              {                                                                             
/*0x008*/         UINT64       ValueList;                                                   
/*0x008*/         struct _CM_KEY_CONTROL_BLOCK* RealKcb;                                    
              };                                                                            
          }CACHED_CHILD_LIST, *PCACHED_CHILD_LIST;                                          
                                                                                            
          typedef union _SLIST_HEADER              // 3 elements, 0x10 bytes (sizeof) 
          {                                                                           
              struct                               // 2 elements, 0x10 bytes (sizeof) 
              {                                                                       
/*0x000*/         UINT64       Alignment;                                             
/*0x008*/         UINT64       Region;                                                
              };                                                                      
              struct                               // 4 elements, 0x10 bytes (sizeof) 
              {                                                                       
                  struct                           // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x000*/             UINT64       Depth : 16;     // 0 BitPosition                   
/*0x000*/             UINT64       Sequence : 48;  // 16 BitPosition                  
                  };                                                                  
                  struct                           // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x008*/             UINT64       Reserved : 4;   // 0 BitPosition                   
/*0x008*/             UINT64       NextEntry : 60; // 4 BitPosition                   
                  };                                                                  
              }HeaderX64;                                                             
          }SLIST_HEADER, *PSLIST_HEADER;                                              
                                                                                      
          typedef struct _CACHED_KSTACK_LIST // 5 elements, 0x20 bytes (sizeof) 
          {                                                                     
/*0x000*/     union _SLIST_HEADER SListHead; // 3 elements, 0x10 bytes (sizeof) 
/*0x010*/     LONG32       MinimumFree;                                         
/*0x014*/     ULONG32      Misses;                                              
/*0x018*/     ULONG32      MissesLast;                                          
/*0x01C*/     ULONG32      AllStacksInUse;                                      
          }CACHED_KSTACK_LIST, *PCACHED_KSTACK_LIST;                                   
                                                                                
          typedef struct _CALL_HASH_ENTRY   // 4 elements, 0x28 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _LIST_ENTRY ListEntry; // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     VOID*        CallersAddress;                                     
/*0x018*/     VOID*        CallersCaller;                                      
/*0x020*/     ULONG32      CallCount;                                          
/*0x024*/     UINT8        _PADDING0_[0x4];                                    
          }CALL_HASH_ENTRY, *PCALL_HASH_ENTRY;                                   
                                                                               
          typedef struct _CALL_PERFORMANCE_DATA // 2 elements, 0x408 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT64       SpinLock;                                                
/*0x008*/     struct _LIST_ENTRY HashTable[64];                                     
          }CALL_PERFORMANCE_DATA, *PCALL_PERFORMANCE_DATA;                                    
                                                                                    
typedef struct _CALLBACK_OBJECT // 0 elements, 0x0 bytes (sizeof) 
{                                                                 
}CALLBACK_OBJECT, *PCALLBACK_OBJECT;                                  
                                                                  
          typedef struct _CC_ASYNC_READ_CONTEXT                                                   // 5 elements, 0x20 bytes (sizeof) 
          {                                                                                                                          
/*0x000*/     FUNCT_009A_091F_IdleIsHalted_IdleInitiateWake_CompletionRoutine* CompletionRoutine;                                    
/*0x008*/     VOID*        Context;                                                                                                  
/*0x010*/     struct _MDL* Mdl;                                                                                                      
/*0x018*/     CHAR         RequestorMode;                                                                                            
/*0x019*/     UINT8        _PADDING0_[0x3];                                                                                          
/*0x01C*/     ULONG32      NestingLevel;                                                                                             
          }CC_ASYNC_READ_CONTEXT, *PCC_ASYNC_READ_CONTEXT;                                                                           
                                                                                                                                     
          typedef struct _DIRTY_PAGE_STATISTICS         // 3 elements, 0x18 bytes (sizeof) 
          {                                                                                
/*0x000*/     UINT64       DirtyPages;                                                     
/*0x008*/     UINT64       DirtyPagesLastScan;                                             
/*0x010*/     ULONG32      DirtyPagesScheduledLastScan;                                    
/*0x014*/     UINT8        _PADDING0_[0x4];                                                
          }DIRTY_PAGE_STATISTICS, *PDIRTY_PAGE_STATISTICS;                                   
                                                                                           
          typedef struct _CC_EXTERNAL_CACHE_INFO                 // 3 elements, 0x30 bytes (sizeof) 
          {                                                                                         
/*0x000*/     FUNCT_00DF_2AC1_Callback* Callback;                                                   
/*0x008*/     struct _DIRTY_PAGE_STATISTICS DirtyPageStatistics; // 3 elements, 0x18 bytes (sizeof) 
/*0x020*/     struct _LIST_ENTRY Links;                          // 2 elements, 0x10 bytes (sizeof) 
          }CC_EXTERNAL_CACHE_INFO, *PCC_EXTERNAL_CACHE_INFO;                                        
                                                                                                    
          typedef struct _SHARED_CACHE_MAP_LIST_CURSOR // 2 elements, 0x18 bytes (sizeof) 
          {                                                                               
/*0x000*/     struct _LIST_ENTRY SharedCacheMapLinks;  // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     ULONG32      Flags;                                                         
/*0x014*/     UINT8        _PADDING0_[0x4];                                               
          }SHARED_CACHE_MAP_LIST_CURSOR, *PSHARED_CACHE_MAP_LIST_CURSOR;                                   
                                                                                          
          typedef struct _KDPC                                  // 11 elements, 0x40 bytes (sizeof) 
          {                                                                                         
              union                                             // 2 elements, 0x8 bytes (sizeof)   
              {                                                                                     
/*0x000*/         ULONG32      TargetInfoAsUlong;                                                   
                  struct                                        // 3 elements, 0x8 bytes (sizeof)   
                  {                                                                                 
/*0x000*/             UINT8        Type;                                                            
/*0x001*/             UINT8        Importance;                                                      
/*0x002*/             UINT16       Number;                                                          
/*0x004*/             UINT8        _PADDING0_[0x4];                                                 
                  };                                                                                
              };                                                                                    
/*0x008*/     struct _SINGLE_LIST_ENTRY DpcListEntry;           // 1 elements, 0x8 bytes (sizeof)   
/*0x010*/     UINT64       ProcessorHistory;                                                        
/*0x018*/     FUNCT_00DF_05FE_DeferredRoutine* DeferredRoutine;                                     
/*0x020*/     VOID*        DeferredContext;                                                         
/*0x028*/     VOID*        SystemArgument1;                                                         
