// #################################################################################
// Generated by Symbol Type Viewer 32Bit/64Bit - Version 1.0.0.6 beta
// http://www.syseclabs.com
// Coding by Lionel d'Hauenens
// #################################################################################
// Image         : 32bit
// ImageName     : windows\X86\10.0.14393.0\ntdll.dll
// LoadedPdbName : symbols\ntdll.pdb\9C2F26EADC594422A432498BD05FCF2E1\ntdll.pdb

#ifdef __cplusplus
extern "C" {
#endif

//////////////////
//   C Define   //
//////////////////

#define VOID void
#define STDCALL __stdcall
#define FASTCALL __fastcall
#define CDECL __cdecl
#define THISCALL __thiscall
#define NEAR 
#define FAR 
//---------------------------------------------------------------------

//////////////////
// C Basic Type //
//////////////////

typedef signed char INT8;
typedef signed char CHAR;
typedef signed short INT16;
typedef signed int INT32;
typedef signed int BOOL;
typedef signed __int64 INT64;
typedef signed __int64 LONG64;
typedef signed long LONG32;
typedef unsigned char UINT8;
typedef unsigned char BYTE;
typedef unsigned short UINT16;
typedef unsigned short WCHAR;
typedef unsigned int UINT32;
typedef unsigned __int64 UINT64;
typedef unsigned __int64 ULONG64;
typedef unsigned long ULONG32;
typedef float FLOAT32;
typedef double FLOAT64;
typedef struct {unsigned short W[5];} FLOAT80;
typedef struct { __int64 LowPart;__int64 HighPart;} FLOAT128;
typedef double DATE;
typedef signed long HRESULT;
typedef union { struct {unsigned long Lo; long Hi;}; __int64 int64;} CURRENCY;
typedef wchar_t OLECHAR;
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Enum types

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE  // 3 elements, 0x4 bytes
{
    StandardDesign  = 0 /*0x0*/,
    NEC98x86        = 1 /*0x1*/,
    EndAlternatives = 2 /*0x2*/
}ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef enum _BUS_QUERY_ID_TYPE  // 6 elements, 0x4 bytes
{
    BusQueryDeviceID           = 0 /*0x0*/,
    BusQueryHardwareIDs        = 1 /*0x1*/,
    BusQueryCompatibleIDs      = 2 /*0x2*/,
    BusQueryInstanceID         = 3 /*0x3*/,
    BusQueryDeviceSerialNumber = 4 /*0x4*/,
    BusQueryContainerID        = 5 /*0x5*/
}BUS_QUERY_ID_TYPE, *PBUS_QUERY_ID_TYPE;

typedef enum _CPU_VENDORS  // 9 elements, 0x4 bytes
{
    CPU_NONE      = 0 /*0x0*/,
    CPU_INTEL     = 1 /*0x1*/,
    CPU_AMD       = 2 /*0x2*/,
    CPU_CYRIX     = 3 /*0x3*/,
    CPU_TRANSMETA = 4 /*0x4*/,
    CPU_VIA       = 5 /*0x5*/,
    CPU_CENTAUR   = 5 /*0x5*/,
    CPU_RISE      = 6 /*0x6*/,
    CPU_UNKNOWN   = 7 /*0x7*/
}CPU_VENDORS, *PCPU_VENDORS;

typedef enum _DEVICE_POWER_STATE  // 6 elements, 0x4 bytes
{
    PowerDeviceUnspecified = 0 /*0x0*/,
    PowerDeviceD0          = 1 /*0x1*/,
    PowerDeviceD1          = 2 /*0x2*/,
    PowerDeviceD2          = 3 /*0x3*/,
    PowerDeviceD3          = 4 /*0x4*/,
    PowerDeviceMaximum     = 5 /*0x5*/
}DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_RELATION_TYPE  // 7 elements, 0x4 bytes
{
    BusRelations         = 0 /*0x0*/,
    EjectionRelations    = 1 /*0x1*/,
    PowerRelations       = 2 /*0x2*/,
    RemovalRelations     = 3 /*0x3*/,
    TargetDeviceRelation = 4 /*0x4*/,
    SingleBusRelations   = 5 /*0x5*/,
    TransportRelations   = 6 /*0x6*/
}DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _DEVICE_TEXT_TYPE  // 2 elements, 0x4 bytes
{
    DeviceTextDescription         = 0 /*0x0*/,
    DeviceTextLocationInformation = 1 /*0x1*/
}DEVICE_TEXT_TYPE, *PDEVICE_TEXT_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE  // 6 elements, 0x4 bytes
{
    DeviceUsageTypeUndefined   = 0 /*0x0*/,
    DeviceUsageTypePaging      = 1 /*0x1*/,
    DeviceUsageTypeHibernation = 2 /*0x2*/,
    DeviceUsageTypeDumpFile    = 3 /*0x3*/,
    DeviceUsageTypeBoot        = 4 /*0x4*/,
    DeviceUsageTypePostDisplay = 5 /*0x5*/
}DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum _DEVICE_WAKE_DEPTH  // 7 elements, 0x4 bytes
{
    DeviceWakeDepthNotWakeable = 0 /*0x0*/,
    DeviceWakeDepthD0          = 1 /*0x1*/,
    DeviceWakeDepthD1          = 2 /*0x2*/,
    DeviceWakeDepthD2          = 3 /*0x3*/,
    DeviceWakeDepthD3hot       = 4 /*0x4*/,
    DeviceWakeDepthD3cold      = 5 /*0x5*/,
    DeviceWakeDepthMaximum     = 6 /*0x6*/
}DEVICE_WAKE_DEPTH, *PDEVICE_WAKE_DEPTH;

typedef enum _DISPLAYCONFIG_SCANLINE_ORDERING  // 6 elements, 0x4 bytes
{
    DISPLAYCONFIG_SCANLINE_ORDERING_UNSPECIFIED                = 0 /*0x0*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_PROGRESSIVE                = 1 /*0x1*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED                 = 2 /*0x2*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_UPPERFIELDFIRST = 2 /*0x2*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_LOWERFIELDFIRST = 3 /*0x3*/,
    DISPLAYCONFIG_SCANLINE_ORDERING_FORCE_UINT32               = -1 /*0xFF*/
}DISPLAYCONFIG_SCANLINE_ORDERING, *PDISPLAYCONFIG_SCANLINE_ORDERING;

typedef enum _EVENT_TYPE  // 2 elements, 0x4 bytes
{
    NotificationEvent    = 0 /*0x0*/,
    SynchronizationEvent = 1 /*0x1*/
}EVENT_TYPE, *PEVENT_TYPE;

typedef enum _EX_BALANCE_OBJECT  // 4 elements, 0x4 bytes
{
    ExTimerExpiration       = 0 /*0x0*/,
    ExThreadSetManagerEvent = 1 /*0x1*/,
    ExThreadReaperEvent     = 2 /*0x2*/,
    ExMaximumBalanceObject  = 3 /*0x3*/
}EX_BALANCE_OBJECT, *PEX_BALANCE_OBJECT;

typedef enum _EX_GEN_RANDOM_DOMAIN  // 4 elements, 0x4 bytes
{
    ExGenRandomDomainKernel      = 0 /*0x0*/,
    ExGenRandomDomainFirst       = 0 /*0x0*/,
    ExGenRandomDomainUserVisible = 1 /*0x1*/,
    ExGenRandomDomainMax         = 2 /*0x2*/
}EX_GEN_RANDOM_DOMAIN, *PEX_GEN_RANDOM_DOMAIN;

typedef enum _EXCEPTION_DISPOSITION  // 4 elements, 0x4 bytes
{
    ExceptionContinueExecution = 0 /*0x0*/,
    ExceptionContinueSearch    = 1 /*0x1*/,
    ExceptionNestedException   = 2 /*0x2*/,
    ExceptionCollidedUnwind    = 3 /*0x3*/
}EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _EXQUEUEINDEX  // 4 elements, 0x4 bytes
{
    ExPoolUntrusted = 0 /*0x0*/,
    IoPoolUntrusted = 1 /*0x1*/,
    ExPoolTrusted   = 2 /*0x2*/,
    ExPoolMax       = 8 /*0x8*/
}EXQUEUEINDEX, *PEXQUEUEINDEX;

typedef enum _FILE_INFORMATION_CLASS  // 67 elements, 0x4 bytes
{
    FileDirectoryInformation                 = 1 /*0x1*/,
    FileFullDirectoryInformation             = 2 /*0x2*/,
    FileBothDirectoryInformation             = 3 /*0x3*/,
    FileBasicInformation                     = 4 /*0x4*/,
    FileStandardInformation                  = 5 /*0x5*/,
    FileInternalInformation                  = 6 /*0x6*/,
    FileEaInformation                        = 7 /*0x7*/,
    FileAccessInformation                    = 8 /*0x8*/,
    FileNameInformation                      = 9 /*0x9*/,
    FileRenameInformation                    = 10 /*0xA*/,
    FileLinkInformation                      = 11 /*0xB*/,
    FileNamesInformation                     = 12 /*0xC*/,
    FileDispositionInformation               = 13 /*0xD*/,
    FilePositionInformation                  = 14 /*0xE*/,
    FileFullEaInformation                    = 15 /*0xF*/,
    FileModeInformation                      = 16 /*0x10*/,
    FileAlignmentInformation                 = 17 /*0x11*/,
    FileAllInformation                       = 18 /*0x12*/,
    FileAllocationInformation                = 19 /*0x13*/,
    FileEndOfFileInformation                 = 20 /*0x14*/,
    FileAlternateNameInformation             = 21 /*0x15*/,
    FileStreamInformation                    = 22 /*0x16*/,
    FilePipeInformation                      = 23 /*0x17*/,
    FilePipeLocalInformation                 = 24 /*0x18*/,
    FilePipeRemoteInformation                = 25 /*0x19*/,
    FileMailslotQueryInformation             = 26 /*0x1A*/,
    FileMailslotSetInformation               = 27 /*0x1B*/,
    FileCompressionInformation               = 28 /*0x1C*/,
    FileObjectIdInformation                  = 29 /*0x1D*/,
    FileCompletionInformation                = 30 /*0x1E*/,
    FileMoveClusterInformation               = 31 /*0x1F*/,
    FileQuotaInformation                     = 32 /*0x20*/,
    FileReparsePointInformation              = 33 /*0x21*/,
    FileNetworkOpenInformation               = 34 /*0x22*/,
    FileAttributeTagInformation              = 35 /*0x23*/,
    FileTrackingInformation                  = 36 /*0x24*/,
    FileIdBothDirectoryInformation           = 37 /*0x25*/,
    FileIdFullDirectoryInformation           = 38 /*0x26*/,
    FileValidDataLengthInformation           = 39 /*0x27*/,
    FileShortNameInformation                 = 40 /*0x28*/,
    FileIoCompletionNotificationInformation  = 41 /*0x29*/,
    FileIoStatusBlockRangeInformation        = 42 /*0x2A*/,
    FileIoPriorityHintInformation            = 43 /*0x2B*/,
    FileSfioReserveInformation               = 44 /*0x2C*/,
    FileSfioVolumeInformation                = 45 /*0x2D*/,
    FileHardLinkInformation                  = 46 /*0x2E*/,
    FileProcessIdsUsingFileInformation       = 47 /*0x2F*/,
    FileNormalizedNameInformation            = 48 /*0x30*/,
    FileNetworkPhysicalNameInformation       = 49 /*0x31*/,
    FileIdGlobalTxDirectoryInformation       = 50 /*0x32*/,
    FileIsRemoteDeviceInformation            = 51 /*0x33*/,
    FileUnusedInformation                    = 52 /*0x34*/,
    FileNumaNodeInformation                  = 53 /*0x35*/,
    FileStandardLinkInformation              = 54 /*0x36*/,
    FileRemoteProtocolInformation            = 55 /*0x37*/,
    FileRenameInformationBypassAccessCheck   = 56 /*0x38*/,
    FileLinkInformationBypassAccessCheck     = 57 /*0x39*/,
    FileVolumeNameInformation                = 58 /*0x3A*/,
    FileIdInformation                        = 59 /*0x3B*/,
    FileIdExtdDirectoryInformation           = 60 /*0x3C*/,
    FileReplaceCompletionInformation         = 61 /*0x3D*/,
    FileHardLinkFullIdInformation            = 62 /*0x3E*/,
    FileIdExtdBothDirectoryInformation       = 63 /*0x3F*/,
    FileDispositionInformationEx             = 64 /*0x40*/,
    FileRenameInformationEx                  = 65 /*0x41*/,
    FileRenameInformationExBypassAccessCheck = 66 /*0x42*/,
    FileMaximumInformation                   = 67 /*0x43*/
}FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FS_FILTER_SECTION_SYNC_TYPE  // 2 elements, 0x4 bytes
{
    SyncTypeOther         = 0 /*0x0*/,
    SyncTypeCreateSection = 1 /*0x1*/
}FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

typedef enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE  // 2 elements, 0x4 bytes
{
    NotifyTypeCreate  = 0 /*0x0*/,
    NotifyTypeRetired = 1 /*0x1*/
}FS_FILTER_STREAM_FO_NOTIFICATION_TYPE, *PFS_FILTER_STREAM_FO_NOTIFICATION_TYPE;

typedef enum _FSINFOCLASS  // 14 elements, 0x4 bytes
{
    FileFsVolumeInformation       = 1 /*0x1*/,
    FileFsLabelInformation        = 2 /*0x2*/,
    FileFsSizeInformation         = 3 /*0x3*/,
    FileFsDeviceInformation       = 4 /*0x4*/,
    FileFsAttributeInformation    = 5 /*0x5*/,
    FileFsControlInformation      = 6 /*0x6*/,
    FileFsFullSizeInformation     = 7 /*0x7*/,
    FileFsObjectIdInformation     = 8 /*0x8*/,
    FileFsDriverPathInformation   = 9 /*0x9*/,
    FileFsVolumeFlagsInformation  = 10 /*0xA*/,
    FileFsSectorSizeInformation   = 11 /*0xB*/,
    FileFsDataCopyInformation     = 12 /*0xC*/,
    FileFsMetadataSizeInformation = 13 /*0xD*/,
    FileFsMaximumInformation      = 14 /*0xE*/
}FSINFOCLASS, *PFSINFOCLASS;

typedef enum _HAL_APIC_DESTINATION_MODE  // 4 elements, 0x4 bytes
{
    ApicDestinationModePhysical         = 1 /*0x1*/,
    ApicDestinationModeLogicalFlat      = 2 /*0x2*/,
    ApicDestinationModeLogicalClustered = 3 /*0x3*/,
    ApicDestinationModeUnknown          = 4 /*0x4*/
}HAL_APIC_DESTINATION_MODE, *PHAL_APIC_DESTINATION_MODE;

typedef enum _HARDWARE_COUNTER_TYPE  // 2 elements, 0x4 bytes
{
    PMCCounter             = 0 /*0x0*/,
    MaxHardwareCounterType = 1 /*0x1*/
}HARDWARE_COUNTER_TYPE, *PHARDWARE_COUNTER_TYPE;

typedef enum _HEAP_FAILURE_TYPE  // 18 elements, 0x4 bytes
{
    heap_failure_internal                      = 0 /*0x0*/,
    heap_failure_unknown                       = 1 /*0x1*/,
    heap_failure_generic                       = 2 /*0x2*/,
    heap_failure_entry_corruption              = 3 /*0x3*/,
    heap_failure_multiple_entries_corruption   = 4 /*0x4*/,
    heap_failure_virtual_block_corruption      = 5 /*0x5*/,
    heap_failure_buffer_overrun                = 6 /*0x6*/,
    heap_failure_buffer_underrun               = 7 /*0x7*/,
    heap_failure_block_not_busy                = 8 /*0x8*/,
    heap_failure_invalid_argument              = 9 /*0x9*/,
    heap_failure_usage_after_free              = 10 /*0xA*/,
    heap_failure_cross_heap_operation          = 11 /*0xB*/,
    heap_failure_freelists_corruption          = 12 /*0xC*/,
    heap_failure_listentry_corruption          = 13 /*0xD*/,
    heap_failure_lfh_bitmap_mismatch           = 14 /*0xE*/,
    heap_failure_segment_lfh_bitmap_corruption = 15 /*0xF*/,
    heap_failure_segment_lfh_double_free       = 16 /*0x10*/,
    heap_failure_vs_subsegment_corruption      = 17 /*0x11*/
}HEAP_FAILURE_TYPE, *PHEAP_FAILURE_TYPE;

typedef enum _HEAP_LFH_LOCKMODE  // 3 elements, 0x4 bytes
{
    HeapLockNotHeld   = 0 /*0x0*/,
    HeapLockShared    = 1 /*0x1*/,
    HeapLockExclusive = 2 /*0x2*/
}HEAP_LFH_LOCKMODE, *PHEAP_LFH_LOCKMODE;

typedef enum _INTERFACE_TYPE  // 20 elements, 0x4 bytes
{
    InterfaceTypeUndefined = -1 /*0xFF*/,
    Internal               = 0 /*0x0*/,
    Isa                    = 1 /*0x1*/,
    Eisa                   = 2 /*0x2*/,
    MicroChannel           = 3 /*0x3*/,
    TurboChannel           = 4 /*0x4*/,
    PCIBus                 = 5 /*0x5*/,
    VMEBus                 = 6 /*0x6*/,
    NuBus                  = 7 /*0x7*/,
    PCMCIABus              = 8 /*0x8*/,
    CBus                   = 9 /*0x9*/,
    MPIBus                 = 10 /*0xA*/,
    MPSABus                = 11 /*0xB*/,
    ProcessorInternal      = 12 /*0xC*/,
    InternalPowerBus       = 13 /*0xD*/,
    PNPISABus              = 14 /*0xE*/,
    PNPBus                 = 15 /*0xF*/,
    Vmcs                   = 16 /*0x10*/,
    ACPIBus                = 17 /*0x11*/,
    MaximumInterfaceType   = 18 /*0x12*/
}INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _INTERRUPT_CONNECTION_TYPE  // 4 elements, 0x4 bytes
{
    InterruptTypeControllerInput = 0 /*0x0*/,
    InterruptTypeXapicMessage    = 1 /*0x1*/,
    InterruptTypeHypertransport  = 2 /*0x2*/,
    InterruptTypeMessageRequest  = 3 /*0x3*/
}INTERRUPT_CONNECTION_TYPE, *PINTERRUPT_CONNECTION_TYPE;

typedef enum _IO_ALLOCATION_ACTION  // 3 elements, 0x4 bytes
{
    KeepObject                    = 1 /*0x1*/,
    DeallocateObject              = 2 /*0x2*/,
    DeallocateObjectKeepRegisters = 3 /*0x3*/
}IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _IO_PRIORITY_HINT  // 6 elements, 0x4 bytes
{
    IoPriorityVeryLow  = 0 /*0x0*/,
    IoPriorityLow      = 1 /*0x1*/,
    IoPriorityNormal   = 2 /*0x2*/,
    IoPriorityHigh     = 3 /*0x3*/,
    IoPriorityCritical = 4 /*0x4*/,
    MaxIoPriorityTypes = 5 /*0x5*/
}IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

typedef enum _IO_RATE_CONTROL_TYPE  // 16 elements, 0x4 bytes
{
    IoRateControlTypeCapMin                         = 0 /*0x0*/,
    IoRateControlTypeIopsCap                        = 0 /*0x0*/,
    IoRateControlTypeBandwidthCap                   = 1 /*0x1*/,
    IoRateControlTypeTimePercentCap                 = 2 /*0x2*/,
    IoRateControlTypeCapMax                         = 2 /*0x2*/,
    IoRateControlTypeReservationMin                 = 3 /*0x3*/,
    IoRateControlTypeIopsReservation                = 3 /*0x3*/,
    IoRateControlTypeBandwidthReservation           = 4 /*0x4*/,
    IoRateControlTypeTimePercentReservation         = 5 /*0x5*/,
    IoRateControlTypeReservationMax                 = 5 /*0x5*/,
    IoRateControlTypeCriticalReservationMin         = 6 /*0x6*/,
    IoRateControlTypeIopsCriticalReservation        = 6 /*0x6*/,
    IoRateControlTypeBandwidthCriticalReservation   = 7 /*0x7*/,
    IoRateControlTypeTimePercentCriticalReservation = 8 /*0x8*/,
    IoRateControlTypeCriticalReservationMax         = 8 /*0x8*/,
    IoRateControlTypeMax                            = 9 /*0x9*/
}IO_RATE_CONTROL_TYPE, *PIO_RATE_CONTROL_TYPE;

typedef enum _IRQ_PRIORITY  // 4 elements, 0x4 bytes
{
    IrqPriorityUndefined = 0 /*0x0*/,
    IrqPriorityLow       = 1 /*0x1*/,
    IrqPriorityNormal    = 2 /*0x2*/,
    IrqPriorityHigh      = 3 /*0x3*/
}IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef enum _JOB_OBJECT_IO_RATE_CONTROL_FLAGS  // 3 elements, 0x4 bytes
{
    JOB_OBJECT_IO_RATE_CONTROL_ENABLE            = 1 /*0x1*/,
    JOB_OBJECT_IO_RATE_CONTROL_STANDALONE_VOLUME = 2 /*0x2*/,
    JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS       = 3 /*0x3*/
}JOB_OBJECT_IO_RATE_CONTROL_FLAGS, *PJOB_OBJECT_IO_RATE_CONTROL_FLAGS;

typedef enum _JOB_OBJECT_NET_RATE_CONTROL_FLAGS  // 4 elements, 0x4 bytes
{
    JOB_OBJECT_NET_RATE_CONTROL_ENABLE        = 1 /*0x1*/,
    JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2 /*0x2*/,
    JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG      = 4 /*0x4*/,
    JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS   = 7 /*0x7*/
}JOB_OBJECT_NET_RATE_CONTROL_FLAGS, *PJOB_OBJECT_NET_RATE_CONTROL_FLAGS;

typedef enum _JOBOBJECTINFOCLASS  // 63 elements, 0x4 bytes
{
    JobObjectBasicAccountingInformation         = 1 /*0x1*/,
    JobObjectBasicLimitInformation              = 2 /*0x2*/,
    JobObjectBasicProcessIdList                 = 3 /*0x3*/,
    JobObjectBasicUIRestrictions                = 4 /*0x4*/,
    JobObjectSecurityLimitInformation           = 5 /*0x5*/,
    JobObjectEndOfJobTimeInformation            = 6 /*0x6*/,
    JobObjectAssociateCompletionPortInformation = 7 /*0x7*/,
    JobObjectBasicAndIoAccountingInformation    = 8 /*0x8*/,
    JobObjectExtendedLimitInformation           = 9 /*0x9*/,
    JobObjectJobSetInformation                  = 10 /*0xA*/,
    JobObjectGroupInformation                   = 11 /*0xB*/,
    JobObjectNotificationLimitInformation       = 12 /*0xC*/,
    JobObjectLimitViolationInformation          = 13 /*0xD*/,
    JobObjectGroupInformationEx                 = 14 /*0xE*/,
    JobObjectCpuRateControlInformation          = 15 /*0xF*/,
    JobObjectCompletionFilter                   = 16 /*0x10*/,
    JobObjectCompletionCounter                  = 17 /*0x11*/,
    JobObjectFreezeInformation                  = 18 /*0x12*/,
    JobObjectExtendedAccountingInformation      = 19 /*0x13*/,
    JobObjectWakeInformation                    = 20 /*0x14*/,
    JobObjectBackgroundInformation              = 21 /*0x15*/,
    JobObjectSchedulingRankBiasInformation      = 22 /*0x16*/,
    JobObjectTimerVirtualizationInformation     = 23 /*0x17*/,
    JobObjectCycleTimeNotification              = 24 /*0x18*/,
    JobObjectClearEvent                         = 25 /*0x19*/,
    JobObjectInterferenceInformation            = 26 /*0x1A*/,
    JobObjectClearPeakJobMemoryUsed             = 27 /*0x1B*/,
    JobObjectMemoryUsageInformation             = 28 /*0x1C*/,
    JobObjectSharedCommit                       = 29 /*0x1D*/,
    JobObjectContainerId                        = 30 /*0x1E*/,
    JobObjectIoRateControlInformation           = 31 /*0x1F*/,
    JobObjectSiloRootDirectory                  = 37 /*0x25*/,
    JobObjectServerSiloBasicInformation         = 38 /*0x26*/,
    JobObjectServerSiloUserSharedData           = 39 /*0x27*/,
    JobObjectServerSiloInitialize               = 40 /*0x28*/,
    JobObjectServerSiloRunningState             = 41 /*0x29*/,
    JobObjectIoAttribution                      = 42 /*0x2A*/,
    JobObjectReserved1Information               = 18 /*0x12*/,
    JobObjectReserved2Information               = 19 /*0x13*/,
    JobObjectReserved3Information               = 20 /*0x14*/,
    JobObjectReserved4Information               = 21 /*0x15*/,
    JobObjectReserved5Information               = 22 /*0x16*/,
    JobObjectReserved6Information               = 23 /*0x17*/,
    JobObjectReserved7Information               = 24 /*0x18*/,
    JobObjectReserved8Information               = 25 /*0x19*/,
    JobObjectReserved9Information               = 26 /*0x1A*/,
    JobObjectReserved10Information              = 27 /*0x1B*/,
    JobObjectReserved11Information              = 28 /*0x1C*/,
    JobObjectReserved12Information              = 29 /*0x1D*/,
    JobObjectReserved13Information              = 30 /*0x1E*/,
    JobObjectReserved14Information              = 31 /*0x1F*/,
    JobObjectNetRateControlInformation          = 32 /*0x20*/,
    JobObjectNotificationLimitInformation2      = 33 /*0x21*/,
    JobObjectLimitViolationInformation2         = 34 /*0x22*/,
    JobObjectCreateSilo                         = 35 /*0x23*/,
    JobObjectSiloBasicInformation               = 36 /*0x24*/,
    JobObjectReserved15Information              = 37 /*0x25*/,
    JobObjectReserved16Information              = 38 /*0x26*/,
    JobObjectReserved17Information              = 39 /*0x27*/,
    JobObjectReserved18Information              = 40 /*0x28*/,
    JobObjectReserved19Information              = 41 /*0x29*/,
    JobObjectReserved20Information              = 42 /*0x2A*/,
    MaxJobObjectInfoClass                       = 43 /*0x2B*/
}JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

typedef enum _KHETERO_CPU_POLICY  // 11 elements, 0x4 bytes
{
    KHeteroCpuPolicyAll         = 0 /*0x0*/,
    KHeteroCpuPolicyLarge       = 1 /*0x1*/,
    KHeteroCpuPolicyLargeOrIdle = 2 /*0x2*/,
    KHeteroCpuPolicySmall       = 3 /*0x3*/,
    KHeteroCpuPolicySmallOrIdle = 4 /*0x4*/,
    KHeteroCpuPolicyDynamic     = 5 /*0x5*/,
    KHeteroCpuPolicyStaticMax   = 5 /*0x5*/,
    KHeteroCpuPolicyBiasedSmall = 6 /*0x6*/,
    KHeteroCpuPolicyBiasedLarge = 7 /*0x7*/,
    KHeteroCpuPolicyDefault     = 8 /*0x8*/,
    KHeteroCpuPolicyMax         = 9 /*0x9*/
}KHETERO_CPU_POLICY, *PKHETERO_CPU_POLICY;

typedef enum _KINTERRUPT_MODE  // 2 elements, 0x4 bytes
{
    LevelSensitive = 0 /*0x0*/,
    Latched        = 1 /*0x1*/
}KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _KINTERRUPT_POLARITY  // 8 elements, 0x4 bytes
{
    InterruptPolarityUnknown       = 0 /*0x0*/,
    InterruptActiveHigh            = 1 /*0x1*/,
    InterruptRisingEdge            = 1 /*0x1*/,
    InterruptActiveLow             = 2 /*0x2*/,
    InterruptFallingEdge           = 2 /*0x2*/,
    InterruptActiveBoth            = 3 /*0x3*/,
    InterruptActiveBothTriggerLow  = 3 /*0x3*/,
    InterruptActiveBothTriggerHigh = 4 /*0x4*/
}KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

typedef enum _KOBJECTS  // 28 elements, 0x4 bytes
{
    EventNotificationObject     = 0 /*0x0*/,
    EventSynchronizationObject  = 1 /*0x1*/,
    MutantObject                = 2 /*0x2*/,
    ProcessObject               = 3 /*0x3*/,
    QueueObject                 = 4 /*0x4*/,
    SemaphoreObject             = 5 /*0x5*/,
    ThreadObject                = 6 /*0x6*/,
    GateObject                  = 7 /*0x7*/,
    TimerNotificationObject     = 8 /*0x8*/,
    TimerSynchronizationObject  = 9 /*0x9*/,
    Spare2Object                = 10 /*0xA*/,
    Spare3Object                = 11 /*0xB*/,
    Spare4Object                = 12 /*0xC*/,
    Spare5Object                = 13 /*0xD*/,
    Spare6Object                = 14 /*0xE*/,
    Spare7Object                = 15 /*0xF*/,
    Spare8Object                = 16 /*0x10*/,
    ProfileCallbackObject       = 17 /*0x11*/,
    ApcObject                   = 18 /*0x12*/,
    DpcObject                   = 19 /*0x13*/,
    DeviceQueueObject           = 20 /*0x14*/,
    PriQueueObject              = 21 /*0x15*/,
    InterruptObject             = 22 /*0x16*/,
    ProfileObject               = 23 /*0x17*/,
    Timer2NotificationObject    = 24 /*0x18*/,
    Timer2SynchronizationObject = 25 /*0x19*/,
    ThreadedDpcObject           = 26 /*0x1A*/,
    MaximumKernelObject         = 27 /*0x1B*/
}KOBJECTS, *PKOBJECTS;

typedef enum _KPROCESS_STATE  // 8 elements, 0x4 bytes
{
    ProcessInMemory      = 0 /*0x0*/,
    ProcessOutOfMemory   = 1 /*0x1*/,
    ProcessInTransition  = 2 /*0x2*/,
    ProcessOutTransition = 3 /*0x3*/,
    ProcessInSwap        = 4 /*0x4*/,
    ProcessOutSwap       = 5 /*0x5*/,
    ProcessRetryOutSwap  = 6 /*0x6*/,
    ProcessAllSwapStates = 7 /*0x7*/
}KPROCESS_STATE, *PKPROCESS_STATE;

typedef enum _KSPIN_LOCK_QUEUE_NUMBER  // 18 elements, 0x4 bytes
{
    LockQueueUnusedSpare0     = 0 /*0x0*/,
    LockQueueUnusedSpare1     = 1 /*0x1*/,
    LockQueueUnusedSpare2     = 2 /*0x2*/,
    LockQueueUnusedSpare3     = 3 /*0x3*/,
    LockQueueVacbLock         = 4 /*0x4*/,
    LockQueueMasterLock       = 5 /*0x5*/,
    LockQueueNonPagedPoolLock = 6 /*0x6*/,
    LockQueueIoCancelLock     = 7 /*0x7*/,
    LockQueueWorkQueueLock    = 8 /*0x8*/,
    LockQueueIoVpbLock        = 9 /*0x9*/,
    LockQueueIoDatabaseLock   = 10 /*0xA*/,
    LockQueueIoCompletionLock = 11 /*0xB*/,
    LockQueueNtfsStructLock   = 12 /*0xC*/,
    LockQueueAfdWorkQueueLock = 13 /*0xD*/,
    LockQueueBcbLock          = 14 /*0xE*/,
    LockQueueUnusedSpare15    = 15 /*0xF*/,
    LockQueueUnusedSpare16    = 16 /*0x10*/,
    LockQueueMaximumLock      = 17 /*0x11*/
}KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

typedef enum _KTHREAD_TAG  // 3 elements, 0x4 bytes
{
    KThreadTagNone           = 0 /*0x0*/,
    KThreadTagMediaBuffering = 1 /*0x1*/,
    KThreadTagMax            = 2 /*0x2*/
}KTHREAD_TAG, *PKTHREAD_TAG;

typedef enum _KWAIT_BLOCK_STATE  // 8 elements, 0x4 bytes
{
    WaitBlockBypassStart           = 0 /*0x0*/,
    WaitBlockBypassComplete        = 1 /*0x1*/,
    WaitBlockSuspendBypassStart    = 2 /*0x2*/,
    WaitBlockSuspendBypassComplete = 3 /*0x3*/,
    WaitBlockActive                = 4 /*0x4*/,
    WaitBlockInactive              = 5 /*0x5*/,
    WaitBlockSuspended             = 6 /*0x6*/,
    WaitBlockAllStates             = 7 /*0x7*/
}KWAIT_BLOCK_STATE, *PKWAIT_BLOCK_STATE;

typedef enum _KWAIT_STATE  // 10 elements, 0x4 bytes
{
    WaitInProgress        = 0 /*0x0*/,
    WaitCommitted         = 1 /*0x1*/,
    WaitAborted           = 2 /*0x2*/,
    WaitSuspendInProgress = 3 /*0x3*/,
    WaitSuspended         = 4 /*0x4*/,
    WaitResumeInProgress  = 5 /*0x5*/,
    WaitResumeAborted     = 6 /*0x6*/,
    WaitFirstSuspendState = 3 /*0x3*/,
    WaitLastSuspendState  = 6 /*0x6*/,
    MaximumWaitState      = 7 /*0x7*/
}KWAIT_STATE, *PKWAIT_STATE;

typedef enum _LDR_DDAG_STATE  // 15 elements, 0x4 bytes
{
    LdrModulesMerged                 = -5 /*0xFB*/,
    LdrModulesInitError              = -4 /*0xFC*/,
    LdrModulesSnapError              = -3 /*0xFD*/,
    LdrModulesUnloaded               = -2 /*0xFE*/,
    LdrModulesUnloading              = -1 /*0xFF*/,
    LdrModulesPlaceHolder            = 0 /*0x0*/,
    LdrModulesMapping                = 1 /*0x1*/,
    LdrModulesMapped                 = 2 /*0x2*/,
    LdrModulesWaitingForDependencies = 3 /*0x3*/,
    LdrModulesSnapping               = 4 /*0x4*/,
    LdrModulesSnapped                = 5 /*0x5*/,
    LdrModulesCondensed              = 6 /*0x6*/,
    LdrModulesReadyToInit            = 7 /*0x7*/,
    LdrModulesInitializing           = 8 /*0x8*/,
    LdrModulesReadyToRun             = 9 /*0x9*/
}LDR_DDAG_STATE, *PLDR_DDAG_STATE;

typedef enum _LDR_DLL_LOAD_REASON  // 8 elements, 0x4 bytes
{
    LoadReasonStaticDependency           = 0 /*0x0*/,
    LoadReasonStaticForwarderDependency  = 1 /*0x1*/,
    LoadReasonDynamicForwarderDependency = 2 /*0x2*/,
    LoadReasonDelayloadDependency        = 3 /*0x3*/,
    LoadReasonDynamicLoad                = 4 /*0x4*/,
    LoadReasonAsImageLoad                = 5 /*0x5*/,
    LoadReasonAsDataLoad                 = 6 /*0x6*/,
    LoadReasonUnknown                    = -1 /*0xFF*/
}LDR_DLL_LOAD_REASON, *PLDR_DLL_LOAD_REASON;

typedef enum _LSA_FOREST_TRUST_RECORD_TYPE  // 4 elements, 0x4 bytes
{
    ForestTrustTopLevelName   = 0 /*0x0*/,
    ForestTrustTopLevelNameEx = 1 /*0x1*/,
    ForestTrustDomainInfo     = 2 /*0x2*/,
    ForestTrustRecordTypeLast = 2 /*0x2*/
}LSA_FOREST_TRUST_RECORD_TYPE, *PLSA_FOREST_TRUST_RECORD_TYPE;

typedef enum _MCA_EXCEPTION_TYPE  // 2 elements, 0x4 bytes
{
    HAL_MCE_RECORD = 0 /*0x0*/,
    HAL_MCA_RECORD = 1 /*0x1*/
}MCA_EXCEPTION_TYPE, *PMCA_EXCEPTION_TYPE;

typedef enum _MEMORY_CACHING_TYPE  // 8 elements, 0x4 bytes
{
    MmNonCached              = 0 /*0x0*/,
    MmCached                 = 1 /*0x1*/,
    MmWriteCombined          = 2 /*0x2*/,
    MmHardwareCoherentCached = 3 /*0x3*/,
    MmNonCachedUnordered     = 4 /*0x4*/,
    MmUSWCCached             = 5 /*0x5*/,
    MmMaximumCacheType       = 6 /*0x6*/,
    MmNotMapped              = -1 /*0xFF*/
}MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG  // 1 elements, 0x4 bytes
{
    MmFrameBufferCached = 2 /*0x2*/
}MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _MM_PAGE_ACCESS_TYPE  // 4 elements, 0x4 bytes
{
    MmPteAccessType         = 0 /*0x0*/,
    MmCcReadAheadType       = 1 /*0x1*/,
    MmPfnRepurposeType      = 2 /*0x2*/,
    MmMaximumPageAccessType = 3 /*0x3*/
}MM_PAGE_ACCESS_TYPE, *PMM_PAGE_ACCESS_TYPE;

typedef enum _MODE  // 3 elements, 0x4 bytes
{
    KernelMode  = 0 /*0x0*/,
    UserMode    = 1 /*0x1*/,
    MaximumMode = 2 /*0x2*/
}MODE, *PMODE;

typedef enum _NT_PRODUCT_TYPE  // 3 elements, 0x4 bytes
{
    NtProductWinNt    = 1 /*0x1*/,
    NtProductLanManNt = 2 /*0x2*/,
    NtProductServer   = 3 /*0x3*/
}NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _OB_OPEN_REASON  // 5 elements, 0x4 bytes
{
    ObCreateHandle    = 0 /*0x0*/,
    ObOpenHandle      = 1 /*0x1*/,
    ObDuplicateHandle = 2 /*0x2*/,
    ObInheritHandle   = 3 /*0x3*/,
    ObMaxOpenReason   = 4 /*0x4*/
}OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _PERFINFO_KERNELMEMORY_USAGE_TYPE  // 2 elements, 0x4 bytes
{
    PerfInfoMemUsagePfnMetadata = 0 /*0x0*/,
    PerfInfoMemUsageMax         = 1 /*0x1*/
}PERFINFO_KERNELMEMORY_USAGE_TYPE, *PPERFINFO_KERNELMEMORY_USAGE_TYPE;

typedef enum _PERFINFO_MM_STAT  // 4 elements, 0x4 bytes
{
    PerfInfoMMStatNotUsed              = 0 /*0x0*/,
    PerfInfoMMStatAggregatePageCombine = 1 /*0x1*/,
    PerfInfoMMStatIterationPageCombine = 2 /*0x2*/,
    PerfInfoMMStatMax                  = 3 /*0x3*/
}PERFINFO_MM_STAT, *PPERFINFO_MM_STAT;

typedef enum _PF_FILE_ACCESS_TYPE  // 3 elements, 0x4 bytes
{
    PfFileAccessTypeRead  = 0 /*0x0*/,
    PfFileAccessTypeWrite = 1 /*0x1*/,
    PfFileAccessTypeMax   = 2 /*0x2*/
}PF_FILE_ACCESS_TYPE, *PPF_FILE_ACCESS_TYPE;

typedef enum _POOL_TYPE  // 23 elements, 0x4 bytes
{
    NonPagedPool                         = 0 /*0x0*/,
    NonPagedPoolExecute                  = 0 /*0x0*/,
    PagedPool                            = 1 /*0x1*/,
    NonPagedPoolMustSucceed              = 2 /*0x2*/,
    DontUseThisType                      = 3 /*0x3*/,
    NonPagedPoolCacheAligned             = 4 /*0x4*/,
    PagedPoolCacheAligned                = 5 /*0x5*/,
    NonPagedPoolCacheAlignedMustS        = 6 /*0x6*/,
    MaxPoolType                          = 7 /*0x7*/,
    NonPagedPoolBase                     = 0 /*0x0*/,
    NonPagedPoolBaseMustSucceed          = 2 /*0x2*/,
    NonPagedPoolBaseCacheAligned         = 4 /*0x4*/,
    NonPagedPoolBaseCacheAlignedMustS    = 6 /*0x6*/,
    NonPagedPoolSession                  = 32 /*0x20*/,
    PagedPoolSession                     = 33 /*0x21*/,
    NonPagedPoolMustSucceedSession       = 34 /*0x22*/,
    DontUseThisTypeSession               = 35 /*0x23*/,
    NonPagedPoolCacheAlignedSession      = 36 /*0x24*/,
    PagedPoolCacheAlignedSession         = 37 /*0x25*/,
    NonPagedPoolCacheAlignedMustSSession = 38 /*0x26*/,
    NonPagedPoolNx                       = 512 /*0x200*/,
    NonPagedPoolNxCacheAligned           = 516 /*0x204*/,
    NonPagedPoolSessionNx                = 544 /*0x220*/
}POOL_TYPE, *PPOOL_TYPE;

typedef enum _POWER_ACTION  // 9 elements, 0x4 bytes
{
    PowerActionNone          = 0 /*0x0*/,
    PowerActionReserved      = 1 /*0x1*/,
    PowerActionSleep         = 2 /*0x2*/,
    PowerActionHibernate     = 3 /*0x3*/,
    PowerActionShutdown      = 4 /*0x4*/,
    PowerActionShutdownReset = 5 /*0x5*/,
    PowerActionShutdownOff   = 6 /*0x6*/,
    PowerActionWarmEject     = 7 /*0x7*/,
    PowerActionDisplayOff    = 8 /*0x8*/
}POWER_ACTION, *PPOWER_ACTION;

typedef enum _POWER_STATE_TYPE  // 2 elements, 0x4 bytes
{
    SystemPowerState = 0 /*0x0*/,
    DevicePowerState = 1 /*0x1*/
}POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER  // 10 elements, 0x4 bytes
{
    LookasideSmallIrpList      = 0 /*0x0*/,
    LookasideMediumIrpList     = 1 /*0x1*/,
    LookasideLargeIrpList      = 2 /*0x2*/,
    LookasideMdlList           = 3 /*0x3*/,
    LookasideCreateInfoList    = 4 /*0x4*/,
    LookasideNameBufferList    = 5 /*0x5*/,
    LookasideTwilightList      = 6 /*0x6*/,
    LookasideCompletionList    = 7 /*0x7*/,
    LookasideScratchBufferList = 8 /*0x8*/,
    LookasideMaximumList       = 9 /*0x9*/
}PP_NPAGED_LOOKASIDE_NUMBER, *PPP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _PPM_IDLE_BUCKET_TIME_TYPE  // 3 elements, 0x4 bytes
{
    PpmIdleBucketTimeInQpc   = 0 /*0x0*/,
    PpmIdleBucketTimeIn100ns = 1 /*0x1*/,
    PpmIdleBucketTimeMaximum = 2 /*0x2*/
}PPM_IDLE_BUCKET_TIME_TYPE, *PPPM_IDLE_BUCKET_TIME_TYPE;

typedef enum _PROC_HYPERVISOR_STATE  // 4 elements, 0x4 bytes
{
    ProcHypervisorNone       = 0 /*0x0*/,
    ProcHypervisorPresent    = 1 /*0x1*/,
    ProcHypervisorPower      = 2 /*0x2*/,
    ProcHypervisorHvCounters = 3 /*0x3*/
}PROC_HYPERVISOR_STATE, *PPROC_HYPERVISOR_STATE;

typedef enum _PROCESS_SECTION_TYPE  // 5 elements, 0x4 bytes
{
    ProcessSectionData           = 0 /*0x0*/,
    ProcessSectionImage          = 1 /*0x1*/,
    ProcessSectionImageNx        = 2 /*0x2*/,
    ProcessSectionPagefileBacked = 3 /*0x3*/,
    ProcessSectionMax            = 4 /*0x4*/
}PROCESS_SECTION_TYPE, *PPROCESS_SECTION_TYPE;

typedef enum _PROCESS_VA_TYPE  // 4 elements, 0x4 bytes
{
    ProcessVAImage   = 0 /*0x0*/,
    ProcessVASection = 1 /*0x1*/,
    ProcessVAPrivate = 2 /*0x2*/,
    ProcessVAMax     = 3 /*0x3*/
}PROCESS_VA_TYPE, *PPROCESS_VA_TYPE;

typedef enum _PROCESSOR_CACHE_TYPE  // 4 elements, 0x4 bytes
{
    CacheUnified     = 0 /*0x0*/,
    CacheInstruction = 1 /*0x1*/,
    CacheData        = 2 /*0x2*/,
    CacheTrace       = 3 /*0x3*/
}PROCESSOR_CACHE_TYPE, *PPROCESSOR_CACHE_TYPE;

typedef enum _PS_PROTECTED_SIGNER  // 9 elements, 0x4 bytes
{
    PsProtectedSignerNone         = 0 /*0x0*/,
    PsProtectedSignerAuthenticode = 1 /*0x1*/,
    PsProtectedSignerCodeGen      = 2 /*0x2*/,
    PsProtectedSignerAntimalware  = 3 /*0x3*/,
    PsProtectedSignerLsa          = 4 /*0x4*/,
    PsProtectedSignerWindows      = 5 /*0x5*/,
    PsProtectedSignerWinTcb       = 6 /*0x6*/,
    PsProtectedSignerWinSystem    = 7 /*0x7*/,
    PsProtectedSignerMax          = 8 /*0x8*/
}PS_PROTECTED_SIGNER, *PPS_PROTECTED_SIGNER;

typedef enum _PS_RESOURCE_TYPE  // 5 elements, 0x4 bytes
{
    PsResourceNonPagedPool = 0 /*0x0*/,
    PsResourcePagedPool    = 1 /*0x1*/,
    PsResourcePageFile     = 2 /*0x2*/,
    PsResourceWorkingSet   = 3 /*0x3*/,
    PsResourceMax          = 4 /*0x4*/
}PS_RESOURCE_TYPE, *PPS_RESOURCE_TYPE;

typedef enum _PS_WAKE_REASON  // 6 elements, 0x4 bytes
{
    PsWakeReasonUser              = 0 /*0x0*/,
    PsWakeReasonExecutionRequired = 1 /*0x1*/,
    PsWakeReasonKernel            = 2 /*0x2*/,
    PsWakeReasonInstrumentation   = 3 /*0x3*/,
    PsWakeReasonPreserveProcess   = 4 /*0x4*/,
    PsMaxWakeReasons              = 5 /*0x5*/
}PS_WAKE_REASON, *PPS_WAKE_REASON;

typedef enum _REG_NOTIFY_CLASS  // 61 elements, 0x4 bytes
{
    RegNtDeleteKey                    = 0 /*0x0*/,
    RegNtPreDeleteKey                 = 0 /*0x0*/,
    RegNtSetValueKey                  = 1 /*0x1*/,
    RegNtPreSetValueKey               = 1 /*0x1*/,
    RegNtDeleteValueKey               = 2 /*0x2*/,
    RegNtPreDeleteValueKey            = 2 /*0x2*/,
    RegNtSetInformationKey            = 3 /*0x3*/,
    RegNtPreSetInformationKey         = 3 /*0x3*/,
    RegNtRenameKey                    = 4 /*0x4*/,
    RegNtPreRenameKey                 = 4 /*0x4*/,
    RegNtEnumerateKey                 = 5 /*0x5*/,
    RegNtPreEnumerateKey              = 5 /*0x5*/,
    RegNtEnumerateValueKey            = 6 /*0x6*/,
    RegNtPreEnumerateValueKey         = 6 /*0x6*/,
    RegNtQueryKey                     = 7 /*0x7*/,
    RegNtPreQueryKey                  = 7 /*0x7*/,
    RegNtQueryValueKey                = 8 /*0x8*/,
    RegNtPreQueryValueKey             = 8 /*0x8*/,
    RegNtQueryMultipleValueKey        = 9 /*0x9*/,
    RegNtPreQueryMultipleValueKey     = 9 /*0x9*/,
    RegNtPreCreateKey                 = 10 /*0xA*/,
    RegNtPostCreateKey                = 11 /*0xB*/,
    RegNtPreOpenKey                   = 12 /*0xC*/,
    RegNtPostOpenKey                  = 13 /*0xD*/,
    RegNtKeyHandleClose               = 14 /*0xE*/,
    RegNtPreKeyHandleClose            = 14 /*0xE*/,
    RegNtPostDeleteKey                = 15 /*0xF*/,
    RegNtPostSetValueKey              = 16 /*0x10*/,
    RegNtPostDeleteValueKey           = 17 /*0x11*/,
    RegNtPostSetInformationKey        = 18 /*0x12*/,
    RegNtPostRenameKey                = 19 /*0x13*/,
    RegNtPostEnumerateKey             = 20 /*0x14*/,
    RegNtPostEnumerateValueKey        = 21 /*0x15*/,
    RegNtPostQueryKey                 = 22 /*0x16*/,
    RegNtPostQueryValueKey            = 23 /*0x17*/,
    RegNtPostQueryMultipleValueKey    = 24 /*0x18*/,
    RegNtPostKeyHandleClose           = 25 /*0x19*/,
    RegNtPreCreateKeyEx               = 26 /*0x1A*/,
    RegNtPostCreateKeyEx              = 27 /*0x1B*/,
    RegNtPreOpenKeyEx                 = 28 /*0x1C*/,
    RegNtPostOpenKeyEx                = 29 /*0x1D*/,
    RegNtPreFlushKey                  = 30 /*0x1E*/,
    RegNtPostFlushKey                 = 31 /*0x1F*/,
    RegNtPreLoadKey                   = 32 /*0x20*/,
    RegNtPostLoadKey                  = 33 /*0x21*/,
    RegNtPreUnLoadKey                 = 34 /*0x22*/,
    RegNtPostUnLoadKey                = 35 /*0x23*/,
    RegNtPreQueryKeySecurity          = 36 /*0x24*/,
    RegNtPostQueryKeySecurity         = 37 /*0x25*/,
    RegNtPreSetKeySecurity            = 38 /*0x26*/,
    RegNtPostSetKeySecurity           = 39 /*0x27*/,
    RegNtCallbackObjectContextCleanup = 40 /*0x28*/,
    RegNtPreRestoreKey                = 41 /*0x29*/,
    RegNtPostRestoreKey               = 42 /*0x2A*/,
    RegNtPreSaveKey                   = 43 /*0x2B*/,
    RegNtPostSaveKey                  = 44 /*0x2C*/,
    RegNtPreReplaceKey                = 45 /*0x2D*/,
    RegNtPostReplaceKey               = 46 /*0x2E*/,
    RegNtPreQueryKeyName              = 47 /*0x2F*/,
    RegNtPostQueryKeyName             = 48 /*0x30*/,
    MaxRegNtNotifyClass               = 49 /*0x31*/
}REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef enum _ReplacesCorHdrNumericDefines  // 25 elements, 0x4 bytes
{
    COMIMAGE_FLAGS_ILONLY                      = 1 /*0x1*/,
    COMIMAGE_FLAGS_32BITREQUIRED               = 2 /*0x2*/,
    COMIMAGE_FLAGS_IL_LIBRARY                  = 4 /*0x4*/,
    COMIMAGE_FLAGS_STRONGNAMESIGNED            = 8 /*0x8*/,
    COMIMAGE_FLAGS_NATIVE_ENTRYPOINT           = 16 /*0x10*/,
    COMIMAGE_FLAGS_TRACKDEBUGDATA              = 65536 /*0x10000*/,
    COMIMAGE_FLAGS_32BITPREFERRED              = 131072 /*0x20000*/,
    COR_VERSION_MAJOR_V2                       = 2 /*0x2*/,
    COR_VERSION_MAJOR                          = 2 /*0x2*/,
    COR_VERSION_MINOR                          = 5 /*0x5*/,
    COR_DELETED_NAME_LENGTH                    = 8 /*0x8*/,
    COR_VTABLEGAP_NAME_LENGTH                  = 8 /*0x8*/,
    NATIVE_TYPE_MAX_CB                         = 1 /*0x1*/,
    COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE       = 255 /*0xFF*/,
    IMAGE_COR_MIH_METHODRVA                    = 1 /*0x1*/,
    IMAGE_COR_MIH_EHRVA                        = 2 /*0x2*/,
    IMAGE_COR_MIH_BASICBLOCK                   = 8 /*0x8*/,
    COR_VTABLE_32BIT                           = 1 /*0x1*/,
    COR_VTABLE_64BIT                           = 2 /*0x2*/,
    COR_VTABLE_FROM_UNMANAGED                  = 4 /*0x4*/,
    COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8 /*0x8*/,
    COR_VTABLE_CALL_MOST_DERIVED               = 16 /*0x10*/,
    IMAGE_COR_EATJ_THUNK_SIZE                  = 32 /*0x20*/,
    MAX_CLASS_NAME                             = 1024 /*0x400*/,
    MAX_PACKAGE_NAME                           = 1024 /*0x400*/
}ReplacesCorHdrNumericDefines, *PReplacesCorHdrNumericDefines;

typedef enum _RTL_GENERIC_COMPARE_RESULTS  // 3 elements, 0x4 bytes
{
    GenericLessThan    = 0 /*0x0*/,
    GenericGreaterThan = 1 /*0x1*/,
    GenericEqual       = 2 /*0x2*/
}RTL_GENERIC_COMPARE_RESULTS, *PRTL_GENERIC_COMPARE_RESULTS;

typedef enum _SE_WS_APPX_SIGNATURE_ORIGIN  // 5 elements, 0x4 bytes
{
    SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0 /*0x0*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN       = 1 /*0x1*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE      = 2 /*0x2*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS       = 3 /*0x3*/,
    SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE    = 4 /*0x4*/
}SE_WS_APPX_SIGNATURE_ORIGIN, *PSE_WS_APPX_SIGNATURE_ORIGIN;

typedef enum _SECURITY_IMPERSONATION_LEVEL  // 4 elements, 0x4 bytes
{
    SecurityAnonymous      = 0 /*0x0*/,
    SecurityIdentification = 1 /*0x1*/,
    SecurityImpersonation  = 2 /*0x2*/,
    SecurityDelegation     = 3 /*0x3*/
}SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _SECURITY_OPERATION_CODE  // 4 elements, 0x4 bytes
{
    SetSecurityDescriptor    = 0 /*0x0*/,
    QuerySecurityDescriptor  = 1 /*0x1*/,
    DeleteSecurityDescriptor = 2 /*0x2*/,
    AssignSecurityDescriptor = 3 /*0x3*/
}SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _SERVERSILO_STATE  // 5 elements, 0x4 bytes
{
    SERVERSILO_INITING       = 0 /*0x0*/,
    SERVERSILO_STARTED       = 1 /*0x1*/,
    SERVERSILO_SHUTTING_DOWN = 2 /*0x2*/,
    SERVERSILO_TERMINATING   = 3 /*0x3*/,
    SERVERSILO_TERMINATED    = 4 /*0x4*/
}SERVERSILO_STATE, *PSERVERSILO_STATE;

typedef enum _SYSTEM_POWER_STATE  // 8 elements, 0x4 bytes
{
    PowerSystemUnspecified = 0 /*0x0*/,
    PowerSystemWorking     = 1 /*0x1*/,
    PowerSystemSleeping1   = 2 /*0x2*/,
    PowerSystemSleeping2   = 3 /*0x3*/,
    PowerSystemSleeping3   = 4 /*0x4*/,
    PowerSystemHibernate   = 5 /*0x5*/,
    PowerSystemShutdown    = 6 /*0x6*/,
    PowerSystemMaximum     = 7 /*0x7*/
}SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _TP_CALLBACK_PRIORITY  // 5 elements, 0x4 bytes
{
    TP_CALLBACK_PRIORITY_HIGH    = 0 /*0x0*/,
    TP_CALLBACK_PRIORITY_NORMAL  = 1 /*0x1*/,
    TP_CALLBACK_PRIORITY_LOW     = 2 /*0x2*/,
    TP_CALLBACK_PRIORITY_INVALID = 3 /*0x3*/,
    TP_CALLBACK_PRIORITY_COUNT   = 3 /*0x3*/
}TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef enum _TRACE_INFORMATION_CLASS  // 18 elements, 0x4 bytes
{
    TraceIdClass                   = 0 /*0x0*/,
    TraceHandleClass               = 1 /*0x1*/,
    TraceEnableFlagsClass          = 2 /*0x2*/,
    TraceEnableLevelClass          = 3 /*0x3*/,
    GlobalLoggerHandleClass        = 4 /*0x4*/,
    EventLoggerHandleClass         = 5 /*0x5*/,
    AllLoggerHandlesClass          = 6 /*0x6*/,
    TraceHandleByNameClass         = 7 /*0x7*/,
    LoggerEventsLostClass          = 8 /*0x8*/,
    TraceSessionSettingsClass      = 9 /*0x9*/,
    LoggerEventsLoggedClass        = 10 /*0xA*/,
    DiskIoNotifyRoutinesClass      = 11 /*0xB*/,
    TraceInformationClassReserved1 = 12 /*0xC*/,
    AllPossibleNotifyRoutinesClass = 12 /*0xC*/,
    FltIoNotifyRoutinesClass       = 13 /*0xD*/,
    TraceInformationClassReserved2 = 14 /*0xE*/,
    WdfNotifyRoutinesClass         = 15 /*0xF*/,
    MaxTraceInformationClass       = 16 /*0x10*/
}TRACE_INFORMATION_CLASS, *PTRACE_INFORMATION_CLASS;

typedef enum _USER_ACTIVITY_PRESENCE  // 5 elements, 0x4 bytes
{
    PowerUserPresent    = 0 /*0x0*/,
    PowerUserNotPresent = 1 /*0x1*/,
    PowerUserInactive   = 2 /*0x2*/,
    PowerUserMaximum    = 3 /*0x3*/,
    PowerUserInvalid    = 3 /*0x3*/
}USER_ACTIVITY_PRESENCE, *PUSER_ACTIVITY_PRESENCE;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT  // 9 elements, 0x4 bytes
{
    WheaDataFormatIPFSalRecord = 0 /*0x0*/,
    WheaDataFormatXPFMCA       = 1 /*0x1*/,
    WheaDataFormatMemory       = 2 /*0x2*/,
    WheaDataFormatPCIExpress   = 3 /*0x3*/,
    WheaDataFormatNMIPort      = 4 /*0x4*/,
    WheaDataFormatPCIXBus      = 5 /*0x5*/,
    WheaDataFormatPCIXDevice   = 6 /*0x6*/,
    WheaDataFormatGeneric      = 7 /*0x7*/,
    WheaDataFormatMax          = 8 /*0x8*/
}WHEA_ERROR_PACKET_DATA_FORMAT, *PWHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _WHEA_ERROR_SEVERITY  // 4 elements, 0x4 bytes
{
    WheaErrSevRecoverable   = 0 /*0x0*/,
    WheaErrSevFatal         = 1 /*0x1*/,
    WheaErrSevCorrected     = 2 /*0x2*/,
    WheaErrSevInformational = 3 /*0x3*/
}WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_SOURCE_TYPE  // 15 elements, 0x4 bytes
{
    WheaErrSrcTypeMCE          = 0 /*0x0*/,
    WheaErrSrcTypeCMC          = 1 /*0x1*/,
    WheaErrSrcTypeCPE          = 2 /*0x2*/,
    WheaErrSrcTypeNMI          = 3 /*0x3*/,
    WheaErrSrcTypePCIe         = 4 /*0x4*/,
    WheaErrSrcTypeGeneric      = 5 /*0x5*/,
    WheaErrSrcTypeINIT         = 6 /*0x6*/,
    WheaErrSrcTypeBOOT         = 7 /*0x7*/,
    WheaErrSrcTypeSCIGeneric   = 8 /*0x8*/,
    WheaErrSrcTypeIPFMCA       = 9 /*0x9*/,
    WheaErrSrcTypeIPFCMC       = 10 /*0xA*/,
    WheaErrSrcTypeIPFCPE       = 11 /*0xB*/,
    WheaErrSrcTypeGenericV2    = 12 /*0xC*/,
    WheaErrSrcTypeSCIGenericV2 = 13 /*0xD*/,
    WheaErrSrcTypeMax          = 14 /*0xE*/
}WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_TYPE  // 7 elements, 0x4 bytes
{
    WheaErrTypeProcessor  = 0 /*0x0*/,
    WheaErrTypeMemory     = 1 /*0x1*/,
    WheaErrTypePCIExpress = 2 /*0x2*/,
    WheaErrTypeNMI        = 3 /*0x3*/,
    WheaErrTypePCIXBus    = 4 /*0x4*/,
    WheaErrTypePCIXDevice = 5 /*0x5*/,
    WheaErrTypeGeneric    = 6 /*0x6*/
}WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef enum _WORKING_SET_TYPE  // 7 elements, 0x4 bytes
{
    WorkingSetTypeUser        = 0 /*0x0*/,
    WorkingSetTypeSession     = 1 /*0x1*/,
    WorkingSetTypeSystemTypes = 2 /*0x2*/,
    WorkingSetTypeSystemCache = 2 /*0x2*/,
    WorkingSetTypePagedPool   = 3 /*0x3*/,
    WorkingSetTypeSystemPtes  = 4 /*0x4*/,
    WorkingSetTypeMaximum     = 5 /*0x5*/
}WORKING_SET_TYPE, *PWORKING_SET_TYPE;

typedef enum _WOW64_SHARED_INFORMATION  // 9 elements, 0x4 bytes
{
    SharedNtdll32LdrInitializeThunk                  = 0 /*0x0*/,
    SharedNtdll32KiUserExceptionDispatcher           = 1 /*0x1*/,
    SharedNtdll32KiUserApcDispatcher                 = 2 /*0x2*/,
    SharedNtdll32KiUserCallbackDispatcher            = 3 /*0x3*/,
    SharedNtdll32RtlUserThreadStart                  = 4 /*0x4*/,
    SharedNtdll32pQueryProcessDebugInformationRemote = 5 /*0x5*/,
    SharedNtdll32BaseAddress                         = 6 /*0x6*/,
    SharedNtdll32LdrSystemDllInitBlock               = 7 /*0x7*/,
    Wow64SharedPageEntriesCount                      = 8 /*0x8*/
}WOW64_SHARED_INFORMATION, *PWOW64_SHARED_INFORMATION;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Information about structure types

typedef struct _ACCESS_REASONS;
typedef struct _ACCESS_STATE;
typedef struct _ACL;
typedef struct _ACTIVATION_CONTEXT;
typedef struct _ACTIVATION_CONTEXT_DATA;
typedef struct _ACTIVATION_CONTEXT_STACK;
typedef struct _ALPC_PROCESS_CONTEXT;
typedef struct _ASSEMBLY_STORAGE_MAP;
typedef struct _AUX_ACCESS_DATA;
typedef struct _BATTERY_REPORTING_SCALE;
typedef struct _CACHE_DESCRIPTOR;
typedef struct _CLIENT_ID;
typedef struct _CLIENT_ID32;
typedef struct _CLIENT_ID64;
typedef struct _CM_FULL_RESOURCE_DESCRIPTOR;
typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR;
typedef struct _CM_PARTIAL_RESOURCE_LIST;
typedef struct _CM_RESOURCE_LIST;
typedef struct _COMPRESSED_DATA_INFO;
typedef struct _CONTEXT;
typedef struct _COUNTER_READING;
typedef union _CPU_INFO;
typedef struct _CURDIR;
typedef struct _DESCRIPTOR;
typedef struct _DEVICE_CAPABILITIES;
typedef struct _DEVICE_MAP;
typedef struct _DEVICE_OBJECT;
typedef struct _DEVICE_OBJECT_POWER_EXTENSION;
typedef struct _DEVOBJ_EXTENSION;
typedef struct _DISPATCHER_HEADER;
typedef struct _DPH_BLOCK_INFORMATION;
typedef struct _DPH_HEAP_BLOCK;
typedef struct _DPH_HEAP_ROOT;
typedef struct _DRIVER_EXTENSION;
typedef struct _DRIVER_OBJECT;
typedef struct _ECP_LIST;
typedef struct _EJOB;
typedef struct _ENODE;
typedef struct _EPROCESS;
typedef struct _EPROCESS_QUOTA_BLOCK;
typedef struct _EPROCESS_VALUES;
typedef struct _ERESOURCE;
typedef struct _ESERVERSILO_GLOBALS;
typedef struct _ETHREAD;
typedef struct _ETW_BUFFER_CONTEXT;
typedef struct _ETW_SILODRIVERSTATE;
typedef struct _EVENT_DATA_DESCRIPTOR;
typedef struct _EVENT_DESCRIPTOR;
typedef struct _EVENT_HEADER;
typedef struct _EVENT_HEADER_EXTENDED_DATA_ITEM;
typedef struct _EVENT_RECORD;
typedef struct _EX_FAST_REF;
typedef struct _EX_PUSH_LOCK;
typedef struct _EX_RUNDOWN_REF;
typedef struct _EX_WORK_QUEUE;
typedef struct _EXCEPTION_POINTERS;
typedef struct _EXCEPTION_RECORD;
typedef struct _EXCEPTION_REGISTRATION_RECORD;
typedef struct _EXHANDLE;
typedef struct _EXT_DELETE_PARAMETERS;
typedef struct _EXT_SET_PARAMETERS_V0;
typedef struct _FAST_IO_DISPATCH;
typedef struct _FAST_MUTEX;
typedef struct _FILE_BASIC_INFORMATION;
typedef struct _FILE_GET_QUOTA_INFORMATION;
typedef struct _FILE_NETWORK_OPEN_INFORMATION;
typedef struct _FILE_OBJECT;
typedef struct _FILE_STANDARD_INFORMATION;
typedef struct _FILESYSTEM_DISK_COUNTERS;
typedef struct _flags;
typedef struct _FLOATING_SAVE_AREA;
typedef struct _FLS_CALLBACK_INFO;
typedef struct _FS_FILTER_CALLBACK_DATA;
typedef struct _FS_FILTER_CALLBACKS;
typedef union _FS_FILTER_PARAMETERS;
typedef struct _FS_FILTER_SECTION_SYNC_OUTPUT;
typedef struct _GDI_TEB_BATCH;
typedef struct _GDI_TEB_BATCH32;
typedef struct _GDI_TEB_BATCH64;
typedef struct _GENERAL_LOOKASIDE;
typedef struct _GENERAL_LOOKASIDE_POOL;
typedef struct _GENERIC_MAPPING;
typedef struct _GROUP_AFFINITY;
typedef struct _GUID;
typedef struct _HANDLE_TABLE;
typedef union _HANDLE_TABLE_ENTRY;
typedef struct _HANDLE_TABLE_ENTRY_INFO;
typedef struct _HANDLE_TABLE_FREE_LIST;
typedef struct _HANDLE_TRACE_DB_ENTRY;
typedef struct _HANDLE_TRACE_DEBUG_INFO;
typedef struct _HEAP;
typedef struct _HEAP_BUCKET;
typedef union _HEAP_BUCKET_COUNTERS;
typedef union _HEAP_BUCKET_RUN_INFO;
typedef struct _HEAP_COUNTERS;
typedef struct _HEAP_DESCRIPTOR_KEY;
typedef struct _HEAP_ENTRY;
typedef struct _HEAP_ENTRY_EXTRA;
typedef struct _HEAP_EXTENDED_ENTRY;
typedef struct _HEAP_FAILURE_INFORMATION;
typedef struct _HEAP_FREE_ENTRY;
typedef struct _HEAP_GLOBAL_APPCOMPAT_FLAGS;
typedef struct _HEAP_LARGE_ALLOC_DATA;
typedef struct _HEAP_LFH_AFFINITY_SLOT;
typedef struct _HEAP_LFH_BUCKET;
typedef struct _HEAP_LFH_CONTEXT;
typedef struct _HEAP_LFH_MEM_POLICIES;
typedef union _HEAP_LFH_ONDEMAND_POINTER;
typedef struct _HEAP_LFH_SUBSEGMENT;
typedef struct _HEAP_LFH_SUBSEGMENT_CACHE;
typedef union _HEAP_LFH_SUBSEGMENT_DELAY_FREE;
typedef struct _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS;
typedef struct _HEAP_LFH_SUBSEGMENT_OWNER;
typedef struct _HEAP_LFH_UNUSED_BYTES_INFO;
typedef struct _HEAP_LIST_LOOKUP;
typedef struct _HEAP_LOCAL_DATA;
typedef struct _HEAP_LOCAL_SEGMENT_INFO;
typedef struct _HEAP_LOCK;
typedef struct _HEAP_PAGE_RANGE_DESCRIPTOR;
typedef struct _HEAP_PAGE_SEGMENT;
typedef struct _HEAP_PSEUDO_TAG_ENTRY;
typedef struct _HEAP_SEGMENT;
typedef struct _HEAP_SUBALLOCATOR_CALLBACKS;
typedef struct _HEAP_SUBSEGMENT;
typedef struct _HEAP_TAG_ENTRY;
typedef struct _HEAP_TUNING_PARAMETERS;
typedef struct _HEAP_UCR_DESCRIPTOR;
typedef struct _HEAP_UNPACKED_ENTRY;
typedef struct _HEAP_USERDATA_HEADER;
typedef struct _HEAP_USERDATA_OFFSETS;
typedef struct _HEAP_VIRTUAL_ALLOC_ENTRY;
typedef struct _HEAP_VS_CHUNK_FREE_HEADER;
typedef struct _HEAP_VS_CHUNK_HEADER;
typedef union _HEAP_VS_CHUNK_HEADER_SIZE;
typedef struct _HEAP_VS_CONTEXT;
typedef struct _HEAP_VS_SUBSEGMENT;
typedef struct _HEAP_VS_UNUSED_BYTES_INFO;
typedef struct _IMAGE_DATA_DIRECTORY;
typedef struct _IMAGE_DOS_HEADER;
typedef struct _IMAGE_FILE_HEADER;
typedef struct _IMAGE_NT_HEADERS;
typedef struct _IMAGE_OPTIONAL_HEADER;
typedef struct _INITIAL_PRIVILEGE_SET;
typedef struct _INTERFACE;
typedef struct _INTERLOCK_SEQ;
typedef struct _INTERRUPT_CONNECTION_DATA;
typedef struct _INTERRUPT_HT_INTR_INFO;
typedef struct _INTERRUPT_REMAPPING_INFO;
typedef struct _INTERRUPT_VECTOR_DATA;
typedef struct _IO_CLIENT_EXTENSION;
typedef struct _IO_COMPLETION_CONTEXT;
typedef struct _IO_DRIVER_CREATE_CONTEXT;
typedef struct _IO_MINI_COMPLETION_PACKET_USER;
typedef struct _IO_PRIORITY_INFO;
typedef struct _IO_RESOURCE_DESCRIPTOR;
typedef struct _IO_RESOURCE_LIST;
typedef struct _IO_RESOURCE_REQUIREMENTS_LIST;
typedef struct _IO_SECURITY_CONTEXT;
typedef struct _IO_STACK_LOCATION;
typedef struct _IO_STATUS_BLOCK;
typedef struct _IO_TIMER;
typedef struct _IOP_IRP_STACK_PROFILER;
typedef struct _IRP;
typedef struct _ISRDPCSTATS;
typedef struct _JOB_ACCESS_STATE;
typedef struct _JOB_CPU_RATE_CONTROL;
typedef struct _JOB_NET_RATE_CONTROL;
typedef struct _JOB_NOTIFICATION_INFORMATION;
typedef struct _JOBOBJECT_WAKE_FILTER;
typedef struct _KAFFINITY_EX;
typedef struct _KAPC;
typedef struct _KAPC_STATE;
typedef struct _KDEVICE_QUEUE;
typedef struct _KDEVICE_QUEUE_ENTRY;
typedef struct _KDPC;
typedef struct _KDPC_DATA;
typedef struct _KDPC_LIST;
typedef struct _KENTROPY_TIMING_STATE;
typedef struct _KERNEL_STACK_SEGMENT;
typedef struct _KEVENT;
typedef union _KEXECUTE_OPTIONS;
typedef struct _KGATE;
typedef struct _KGDTENTRY;
typedef struct _KHETERO_PROCESSOR_SET;
typedef struct _KIDTENTRY;
typedef struct _KiIoAccessMap;
typedef struct _KINTERRUPT;
typedef struct _KLOCK_ENTRY;
typedef struct _KLOCK_ENTRY_LOCK_STATE;
typedef struct _KNODE;
typedef struct _KPCR;
typedef struct _KPRCB;
typedef struct _KPRIQUEUE;
typedef struct _KPROCESS;
typedef struct _KPROCESSOR_STATE;
typedef struct _KQUEUE;
typedef struct _KREQUEST_PACKET;
typedef struct _KSCB;
typedef struct _KSCHEDULING_GROUP;
typedef struct _KSCHEDULING_GROUP_POLICY;
typedef struct _KSEMAPHORE;
typedef struct _KSHARED_READY_QUEUE;
typedef struct _KSPECIAL_REGISTERS;
typedef struct _KSPIN_LOCK_QUEUE;
typedef struct _KSTACK_CONTROL;
typedef union _KSTACK_COUNT;
typedef struct _KSYSTEM_TIME;
typedef struct _KTHREAD;
typedef struct _KTHREAD_COUNTERS;
typedef struct _KTIMER;
typedef struct _KTIMER_EXPIRATION_TRACE;
typedef struct _KTIMER_TABLE;
typedef struct _KTIMER_TABLE_ENTRY;
typedef struct _KTRAP_FRAME;
typedef struct _KTSS;
typedef struct _KUSER_SHARED_DATA;
typedef struct _KWAIT_BLOCK;
typedef struct _KWAIT_CHAIN;
typedef union _KWAIT_STATUS_REGISTER;
typedef union _LARGE_INTEGER;
typedef struct _LDR_DATA_TABLE_ENTRY;
typedef struct _LDR_DDAG_NODE;
typedef struct _LDR_SERVICE_TAG_RECORD;
typedef struct _LDRP_CSLIST;
typedef struct _LDRP_LOAD_CONTEXT;
typedef struct _LFH_BLOCK_ZONE;
typedef struct _LFH_HEAP;
typedef union _LFH_RANDOM_DATA;
typedef struct _LIST_ENTRY;
typedef struct _LIST_ENTRY32;
typedef struct _LIST_ENTRY64;
typedef struct _LOOKASIDE_LIST_EX;
typedef struct _LUID;
typedef struct _LUID_AND_ATTRIBUTES;
typedef struct _M128A;
typedef struct _MAILSLOT_CREATE_PARAMETERS;
typedef struct _MCA_EXCEPTION;
typedef union _MCI_ADDR;
typedef union _MCI_STATS;
typedef struct _MDL;
typedef struct _MM_DRIVER_VERIFIER_DATA;
typedef struct _MM_PAGE_ACCESS_INFO;
typedef union _MM_PAGE_ACCESS_INFO_FLAGS;
typedef struct _MM_PAGE_ACCESS_INFO_HEADER;
typedef struct _MM_SESSION_SPACE;
typedef struct _MMSUPPORT_FLAGS;
typedef struct _MMSUPPORT_FULL;
typedef struct _MMSUPPORT_INSTANCE;
typedef struct _MMSUPPORT_SHARED;
typedef struct _MMWSL_INSTANCE;
typedef struct _NAMED_PIPE_CREATE_PARAMETERS;
typedef struct _NPAGED_LOOKASIDE_LIST;
typedef struct _NT_TIB;
typedef struct _NT_TIB32;
typedef struct _NT_TIB64;
typedef struct _OB_EXTENDED_PARSE_PARAMETERS;
typedef struct _OBJECT_DIRECTORY;
typedef struct _OBJECT_DIRECTORY_ENTRY;
typedef struct _OBJECT_DUMP_CONTROL;
typedef struct _OBJECT_HANDLE_INFORMATION;
typedef struct _OBJECT_NAME_INFORMATION;
typedef struct _OBJECT_NAMESPACE_LOOKUPTABLE;
typedef struct _OBJECT_TYPE;
typedef struct _OBJECT_TYPE_INITIALIZER;
typedef struct _OBP_SILODRIVERSTATE;
typedef struct _OBP_SYSTEM_DOS_DEVICE_STATE;
typedef struct _OWNER_ENTRY;
typedef struct _PAGED_LOOKASIDE_LIST;
typedef struct _PAGEFAULT_HISTORY;
typedef struct _PEB;
typedef struct _PEB_LDR_DATA;
typedef struct _PEB32;
typedef struct _PEBS_DS_SAVE_AREA;
typedef struct _PERFINFO_GROUPMASK;
typedef struct _PERFINFO_PPM_STATE_SELECTION;
typedef struct _PF_KERNEL_GLOBALS;
typedef struct _PO_DIAG_STACK_RECORD;
typedef struct _POWER_SEQUENCE;
typedef union _POWER_STATE;
typedef struct _PP_LOOKASIDE_LIST;
typedef struct _PPM_CONCURRENCY_ACCOUNTING;
typedef struct _PPM_COORDINATED_SELECTION;
typedef struct _PPM_FFH_THROTTLE_STATE_INFO;
typedef struct _PPM_IDLE_STATE;
typedef struct _PPM_IDLE_STATES;
typedef union _PPM_IDLE_SYNCHRONIZATION_STATE;
typedef struct _PPM_SELECTION_DEPENDENCY;
typedef struct _PPM_SELECTION_MENU;
typedef struct _PPM_SELECTION_MENU_ENTRY;
typedef struct _PPM_SELECTION_STATISTICS;
typedef struct _PPM_VETO_ACCOUNTING;
typedef struct _PPM_VETO_ENTRY;
typedef struct _PRIVILEGE_SET;
typedef struct _PROC_FEEDBACK;
typedef struct _PROC_FEEDBACK_COUNTER;
typedef struct _PROC_IDLE_ACCOUNTING;
typedef struct _PROC_IDLE_POLICY;
typedef struct _PROC_IDLE_SNAP;
typedef struct _PROC_IDLE_STATE_ACCOUNTING;
typedef struct _PROC_IDLE_STATE_BUCKET;
typedef struct _PROC_PERF_CHECK;
typedef struct _PROC_PERF_CHECK_SNAP;
typedef struct _PROC_PERF_CONSTRAINT;
typedef struct _PROC_PERF_DOMAIN;
typedef struct _PROC_PERF_HISTORY;
typedef struct _PROC_PERF_HISTORY_ENTRY;
typedef struct _PROC_PERF_LOAD;
typedef struct _PROCESS_DISK_COUNTERS;
typedef struct _PROCESS_ENERGY_VALUES;
typedef struct _PROCESSOR_IDLE_CONSTRAINTS;
typedef struct _PROCESSOR_IDLE_DEPENDENCY;
typedef struct _PROCESSOR_IDLE_PREPARE_INFO;
typedef struct _PROCESSOR_NUMBER;
typedef struct _PROCESSOR_POWER_STATE;
typedef struct _PROCESSOR_PROFILE_CONTROL_AREA;
typedef union _PS_CLIENT_SECURITY_CONTEXT;
typedef struct _PS_IO_CONTROL_ENTRY;
typedef struct _PS_PROPERTY_SET;
typedef struct _PS_PROTECTION;
typedef union _PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS;
typedef struct _PS_TRUSTLET_ATTRIBUTE_DATA;
typedef struct _PS_TRUSTLET_ATTRIBUTE_HEADER;
typedef struct _PS_TRUSTLET_ATTRIBUTE_TYPE;
typedef struct _PS_TRUSTLET_CREATE_ATTRIBUTES;
typedef struct _PS_TRUSTLET_TKSESSION_ID;
typedef struct _PS_WAKE_INFORMATION;
typedef struct _PSP_STORAGE;
typedef struct _QUAD;
typedef struct _REQUEST_MAILBOX;
typedef struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME;
typedef struct _RTL_AVL_TABLE;
typedef struct _RTL_AVL_TREE;
typedef struct _RTL_BALANCED_LINKS;
typedef struct _RTL_BALANCED_NODE;
typedef struct _RTL_BITMAP;
typedef struct _RTL_CHASH_ENTRY;
typedef struct _RTL_CHASH_TABLE;
typedef struct _RTL_CRITICAL_SECTION;
typedef struct _RTL_CRITICAL_SECTION_DEBUG;
typedef struct _RTL_DRIVE_LETTER_CURDIR;
typedef struct _RTL_DYNAMIC_HASH_TABLE;
typedef struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENTRY;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR;
typedef struct _RTL_HASH_ENTRY;
typedef struct _RTL_HASH_TABLE;
typedef struct _RTL_HASH_TABLE_ITERATOR;
typedef struct _RTL_HEAP_WALK_ENTRY;
typedef struct _RTL_RB_TREE;
typedef union _RTL_RUN_ONCE;
typedef struct _RTL_SPARSE_BITMAP_CTX;
typedef struct _RTL_SPARSE_BITMAP_RANGE;
typedef struct _RTL_SPLAY_LINKS;
typedef struct _RTL_SRWLOCK;
typedef struct _RTL_STACK_DATABASE_LOCK;
typedef struct _RTL_STACK_TRACE_ENTRY;
typedef struct _RTL_STACKDB_CONTEXT;
typedef struct _RTL_STD_LIST_ENTRY;
typedef struct _RTL_STD_LIST_HEAD;
typedef struct _RTL_TRACE_BLOCK;
typedef struct _RTL_TRACE_DATABASE;
typedef struct _RTL_TRACE_SEGMENT;
typedef struct _RTL_USER_PROCESS_PARAMETERS;
typedef struct _RTLP_HEAP_FEATURES;
typedef struct _SCSI_REQUEST_BLOCK;
typedef struct _SE_AUDIT_PROCESS_CREATION_INFO;
typedef struct _SECTION_OBJECT_POINTERS;
typedef struct _SECURITY_DESCRIPTOR;
typedef struct _SECURITY_QUALITY_OF_SERVICE;
typedef struct _SECURITY_SUBJECT_CONTEXT;
typedef struct _SEGMENT_HEAP;
typedef struct _SEGMENT_HEAP_EXTRA;
typedef struct _SEP_LOGON_SESSION_REFERENCES;
typedef struct _SEP_RM_LSA_CONNECTION_STATE;
typedef struct _SEP_SILOSTATE;
typedef struct _SID;
typedef struct _SID_IDENTIFIER_AUTHORITY;
typedef struct _SILO_USER_SHARED_DATA;
typedef struct _SINGLE_LIST_ENTRY;
typedef union _SLIST_HEADER;
typedef struct _STACK_TRACE_DATABASE;
typedef struct _STRING;
typedef struct _STRING32;
typedef struct _STRING64;
typedef struct _SYNCH_COUNTERS;
typedef struct _SYSTEM_POWER_CAPABILITIES;
typedef struct _SYSTEM_POWER_STATE_CONTEXT;
typedef struct _TEB;
typedef struct _TEB_ACTIVE_FRAME;
typedef struct _TEB_ACTIVE_FRAME_CONTEXT;
typedef struct _TEB32;
typedef struct _TEB64;
typedef struct _TERMINATION_PORT;
typedef struct _THREAD_ENERGY_VALUES;
typedef struct _THREAD_PERFORMANCE_DATA;
typedef struct _TP_CALLBACK_ENVIRON_V3;
typedef struct _TP_CALLBACK_INSTANCE;
typedef struct _TP_CLEANUP_GROUP;
typedef struct _TP_POOL;
typedef struct _TRUSTLET_COLLABORATION_ID;
typedef struct _TRUSTLET_MAILBOX_KEY;
typedef struct _TXN_PARAMETER_BLOCK;
typedef union _ULARGE_INTEGER;
typedef struct _UNICODE_STRING;
typedef struct _USER_MEMORY_CACHE_ENTRY;
typedef struct _VPB;
typedef struct _WAIT_CONTEXT_BLOCK;
typedef union _WHEA_ERROR_PACKET_FLAGS;
typedef struct _WHEA_ERROR_PACKET_V2;
typedef struct _WHEA_ERROR_RECORD;
typedef struct _WHEA_ERROR_RECORD_HEADER;
typedef union _WHEA_ERROR_RECORD_HEADER_FLAGS;
typedef union _WHEA_ERROR_RECORD_HEADER_VALIDBITS;
typedef struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;
typedef union _WHEA_PERSISTENCE_INFO;
typedef union _WHEA_REVISION;
typedef union _WHEA_TIMESTAMP;
typedef struct _WNF_LOCK;
typedef struct _WNF_SCOPE_MAP;
typedef struct _WNF_SILODRIVERSTATE;
typedef struct _WNF_STATE_NAME;
typedef struct _WORK_QUEUE_ITEM;
typedef struct _XSAVE_AREA;
typedef struct _XSAVE_AREA_HEADER;
typedef struct _XSAVE_FORMAT;
typedef struct _XSTATE_CONFIGURATION;
typedef struct _XSTATE_CONTEXT;
typedef struct _XSTATE_FEATURE;
typedef struct _XSTATE_SAVE;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Function types

typedef VOID (NEAR STDCALL FUNCT_00C8_00C7_CleanupGroupCancelCallback_DeRefSecurityDescriptor_Free) (VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00C8_00CF_FinalizationCallback) (struct _TP_CALLBACK_INSTANCE*, VOID*);
typedef enum _EXCEPTION_DISPOSITION (NEAR STDCALL FUNCT_0162_0161_Handler) (struct _EXCEPTION_RECORD*, VOID*, struct _CONTEXT*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00C8_0269_PostProcessInitRoutine_DispatchAddress) ();
typedef VOID (NEAR STDCALL FUNCT_00C8_056B_DeferredRoutine) (struct _KDPC*, VOID*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00C8_06A0_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00C8_0697_KernelRoutine) (struct _KAPC*, FUNCT_00C8_06A0_NormalRoutine**, VOID**, VOID**, VOID**);
typedef VOID (NEAR STDCALL FUNCT_00C8_06A0_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00C8_06A5_RundownRoutine) (struct _KAPC*);
typedef VOID* (NEAR STDCALL FUNCT_00CB_0759_AllocateEx) (enum _POOL_TYPE, ULONG32, ULONG32, struct _LOOKASIDE_LIST_EX*);
typedef VOID* (NEAR STDCALL FUNCT_00CB_0763_Allocate) (enum _POOL_TYPE, ULONG32, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00C8_0768_FreeEx) (VOID*, struct _LOOKASIDE_LIST_EX*);
typedef VOID (NEAR STDCALL FUNCT_00C8_076C_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure_FreeRoutine) (VOID*);
typedef VOID (NEAR STDCALL FUNCT_00C8_0772_WorkerRoutine) (VOID*, VOID*, VOID*, VOID*);
typedef VOID (NEAR FASTCALL FUNCT_00C8_07E7_IdlePrepare) (struct _PROCESSOR_IDLE_PREPARE_INFO*);
typedef LONG32 (NEAR FASTCALL FUNCT_0078_0807_IdlePreExecute_IdleExecute) (VOID*, ULONG32, ULONG32, ULONG32, ULONG32*);
typedef ULONG32 (NEAR FASTCALL FUNCT_0009_080F_IdlePreselect) (VOID*, struct _PROCESSOR_IDLE_CONSTRAINTS*);
typedef ULONG32 (NEAR FASTCALL FUNCT_0009_0814_IdleTest) (VOID*, ULONG32, ULONG32);
typedef ULONG32 (NEAR FASTCALL FUNCT_0009_0819_IdleAvailabilityCheck) (VOID*, ULONG32);
typedef VOID (NEAR FASTCALL FUNCT_00C8_081D_IdleComplete) (VOID*, ULONG32, ULONG32, ULONG32, ULONG32*);
typedef VOID (NEAR FASTCALL FUNCT_00C8_081F_IdleCancel) (VOID*, ULONG32);
typedef UINT8 (NEAR FASTCALL FUNCT_0081_0821_IdleIsHalted_IdleInitiateWake) (VOID*);
typedef VOID (NEAR FASTCALL FUNCT_00C8_08B7_InstantaneousRead) (ULONG32, ULONG32*);
typedef VOID (NEAR FASTCALL FUNCT_00C8_08BB_DifferentialRead) (ULONG32, UINT8, UINT64*, UINT64*);
typedef VOID (NEAR FASTCALL FUNCT_00C8_0923_GetFFHThrottleState) (UINT64*);
typedef VOID (NEAR FASTCALL FUNCT_00C8_0926_TimeWindowHandler_BoostPolicyHandler_BoostModeHandler_EnergyPerfPreferenceHandler_AutonomousActivityWindowHandler_AutonomousModeHandler) (ULONG32, ULONG32);
typedef VOID (NEAR FASTCALL FUNCT_00C8_092A_ReinitializeHandler) (ULONG32);
typedef ULONG32 (NEAR FASTCALL FUNCT_0009_092D_PerfSelectionHandler) (ULONG32, ULONG32, ULONG32, ULONG32, ULONG32, ULONG32*, UINT64*);
typedef VOID (NEAR FASTCALL FUNCT_00C8_0936_PerfControlHandler) (ULONG32, UINT64, ULONG32, ULONG32, ULONG32, UINT8, UINT8, UINT8);
typedef UINT8 (NEAR STDCALL FUNCT_0081_09E1_ServiceRoutine) (struct _KINTERRUPT*, VOID*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_09E5_MessageServiceRoutine) (struct _KINTERRUPT*, VOID*, ULONG32);
typedef LONG32 (NEAR STDCALL FUNCT_0078_0C01_AddDevice) (struct _DRIVER_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0078_0C19_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter) (struct _FS_FILTER_CALLBACK_DATA*, VOID**);
typedef VOID (NEAR STDCALL FUNCT_00C8_0C9C_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter) (struct _FS_FILTER_CALLBACK_DATA*, LONG32, VOID*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0CC0_FastIoCheckIfPossible) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0CCB_FastIoRead_FastIoWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, VOID*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0CD5_FastIoQueryBasicInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_BASIC_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0CE3_FastIoQueryStandardInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_STANDARD_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0CF1_FastIoLock) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, UINT8, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00C8_0E85_MiniPacketCallback) (struct _IO_MINI_COMPLETION_PACKET_USER*, VOID*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0FB6_FastIoUnlockSingle) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0FBF_FastIoUnlockAll) (struct _FILE_OBJECT*, struct _EPROCESS*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0FC5_FastIoUnlockAllByKey) (struct _FILE_OBJECT*, VOID*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0FCC_FastIoDeviceControl) (struct _FILE_OBJECT*, UINT8, VOID*, ULONG32, VOID*, ULONG32, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00C8_0FD7_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection) (struct _FILE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00C8_0FDA_FastIoDetachDevice) (struct _DEVICE_OBJECT*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0FDE_FastIoQueryNetworkOpenInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0078_0FEE_AcquireForModWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _ERESOURCE**, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_0FF4_MdlRead_PrepareMdlWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_1008_MdlReadComplete_MdlReadCompleteCompressed) (struct _FILE_OBJECT*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_100D_MdlWriteComplete_MdlWriteCompleteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_1013_FastIoReadCompressed_FastIoWriteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, VOID*, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _COMPRESSED_DATA_INFO*, ULONG32, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_0081_1028_FastIoQueryOpen) (struct _IRP*, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00C8_104F_UserApcRoutine) (VOID*, struct _IO_STATUS_BLOCK*, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00C8_1054_DriverStartIo_CancelRoutine) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef LONG32 (NEAR STDCALL FUNCT_0078_1300_CompletionRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*);
typedef LONG32 (NEAR STDCALL FUNCT_0078_1305_ReleaseForModWrite) (struct _FILE_OBJECT*, struct _ERESOURCE*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0078_130A_AcquireForCcFlush_ReleaseForCcFlush) (struct _FILE_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0078_130E_DriverInit) (struct _DRIVER_OBJECT*, struct _UNICODE_STRING*);
typedef VOID (NEAR STDCALL FUNCT_00C8_1312_DriverUnload) (struct _DRIVER_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0078_1316_MajorFunction) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef VOID (NEAR STDCALL FUNCT_00C8_1320_TimerRoutine) (struct _DEVICE_OBJECT*, VOID*);
typedef enum _IO_ALLOCATION_ACTION (NEAR STDCALL FUNCT_1336_1335_DeviceRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00C8_13AC_DumpProcedure) (VOID*, struct _OBJECT_DUMP_CONTROL*);
typedef LONG32 (NEAR STDCALL FUNCT_0078_13B4_OpenProcedure) (enum _OB_OPEN_REASON, CHAR, struct _EPROCESS*, VOID*, ULONG32*, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00C8_13C2_CloseProcedure) (struct _EPROCESS*, VOID*, ULONG32, ULONG32);
typedef LONG32 (NEAR STDCALL FUNCT_0078_13C8_ParseProcedure) (VOID*, VOID*, struct _ACCESS_STATE*, CHAR, ULONG32, struct _UNICODE_STRING*, struct _UNICODE_STRING*, VOID*, struct _SECURITY_QUALITY_OF_SERVICE*, VOID**);
typedef LONG32 (NEAR STDCALL FUNCT_0078_13D4_ParseProcedureEx) (VOID*, VOID*, struct _ACCESS_STATE*, CHAR, ULONG32, struct _UNICODE_STRING*, struct _UNICODE_STRING*, VOID*, struct _SECURITY_QUALITY_OF_SERVICE*, struct _OB_EXTENDED_PARSE_PARAMETERS*, VOID**);
typedef LONG32 (NEAR STDCALL FUNCT_0078_13E6_SecurityProcedure) (VOID*, enum _SECURITY_OPERATION_CODE, ULONG32*, VOID*, ULONG32*, VOID**, enum _POOL_TYPE, struct _GENERIC_MAPPING*, CHAR);
typedef LONG32 (NEAR STDCALL FUNCT_0078_13F7_QueryNameProcedure) (VOID*, UINT8, struct _OBJECT_NAME_INFORMATION*, ULONG32, ULONG32*, CHAR);
typedef UINT8 (NEAR STDCALL FUNCT_0081_13FF_OkayToCloseProcedure) (struct _EPROCESS*, VOID*, VOID*, CHAR);
typedef LONG32 (NEAR STDCALL FUNCT_0078_15D2_CommitRoutine) (VOID*, VOID**, ULONG32*);
typedef VOID* (NEAR STDCALL FUNCT_00CB_178E_Allocate) (ULONG32, VOID*);
typedef VOID* (NEAR STDCALL FUNCT_00CB_1809_AllocateRoutine) (ULONG32);
typedef ULONG32 (NEAR STDCALL FUNCT_0009_1A0D_HashFunction) (ULONG32, VOID**);
typedef enum _RTL_GENERIC_COMPARE_RESULTS (NEAR STDCALL FUNCT_1C1C_1C1B_CompareRoutine) (struct _RTL_AVL_TABLE*, VOID*, VOID*);
typedef VOID* (NEAR STDCALL FUNCT_00CB_1C25_AllocateRoutine) (struct _RTL_AVL_TABLE*, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00C8_1C29_FreeRoutine) (struct _RTL_AVL_TABLE*, VOID*);

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Structure types

          typedef struct _ACCESS_REASONS // 1 elements, 0x80 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      Data[32];                                        
          }ACCESS_REASONS, *PACCESS_REASONS;                                   
                                                                            
          typedef struct _LUID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     ULONG32      LowPart;                                    
/*0x004*/     LONG32       HighPart;                                   
          }LUID, *PLUID;                                               
                                                                       
          typedef struct _SECURITY_SUBJECT_CONTEXT                   // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                             
/*0x000*/     VOID*        ClientToken;                                                                 
/*0x004*/     enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                                    
/*0x008*/     VOID*        PrimaryToken;                                                                
/*0x00C*/     VOID*        ProcessAuditId;                                                              
          }SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT;                                        
                                                                                                        
          typedef struct _LUID_AND_ATTRIBUTES // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _LUID Luid;              // 2 elements, 0x8 bytes (sizeof) 
/*0x008*/     ULONG32      Attributes;                                          
          }LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES;                                  
                                                                                
          typedef struct _INITIAL_PRIVILEGE_SET         // 3 elements, 0x2C bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[3];                                    
          }INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET;                                   
                                                                                           
          typedef struct _PRIVILEGE_SET                 // 3 elements, 0x14 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[1];                                    
          }PRIVILEGE_SET, *PPRIVILEGE_SET;                                                 
                                                                                           
          typedef struct _UNICODE_STRING  // 3 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     UINT16       Length;                                          
/*0x002*/     UINT16       MaximumLength;                                   
/*0x004*/     WCHAR*       Buffer;                                          
          }UNICODE_STRING, *PUNICODE_STRING;                                  
                                                                            
          typedef struct _ACCESS_STATE                                 // 16 elements, 0x74 bytes (sizeof) 
          {                                                                                                
/*0x000*/     struct _LUID OperationID;                                // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     UINT8        SecurityEvaluated;                                                              
/*0x009*/     UINT8        GenerateAudit;                                                                  
/*0x00A*/     UINT8        GenerateOnClose;                                                                
/*0x00B*/     UINT8        PrivilegesAllocated;                                                            
/*0x00C*/     ULONG32      Flags;                                                                          
/*0x010*/     ULONG32      RemainingDesiredAccess;                                                         
/*0x014*/     ULONG32      PreviouslyGrantedAccess;                                                        
/*0x018*/     ULONG32      OriginalDesiredAccess;                                                          
/*0x01C*/     struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext; // 4 elements, 0x10 bytes (sizeof)  
/*0x02C*/     VOID*        SecurityDescriptor;                                                             
/*0x030*/     VOID*        AuxData;                                                                        
              union                                                    // 2 elements, 0x2C bytes (sizeof)  
              {                                                                                            
/*0x034*/         struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;   // 3 elements, 0x2C bytes (sizeof)  
/*0x034*/         struct _PRIVILEGE_SET PrivilegeSet;                  // 3 elements, 0x14 bytes (sizeof)  
              }Privileges;                                                                                 
/*0x060*/     UINT8        AuditPrivileges;                                                                
/*0x061*/     UINT8        _PADDING0_[0x3];                                                                
/*0x064*/     struct _UNICODE_STRING ObjectName;                       // 3 elements, 0x8 bytes (sizeof)   
/*0x06C*/     struct _UNICODE_STRING ObjectTypeName;                   // 3 elements, 0x8 bytes (sizeof)   
          }ACCESS_STATE, *PACCESS_STATE;                                                                   
                                                                                                           
          typedef struct _ACL           // 5 elements, 0x8 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT8        AclRevision;                                   
/*0x001*/     UINT8        Sbz1;                                          
/*0x002*/     UINT16       AclSize;                                       
/*0x004*/     UINT16       AceCount;                                      
/*0x006*/     UINT16       Sbz2;                                          
          }ACL, *PACL;                                                    
                                                                          
typedef struct _ACTIVATION_CONTEXT // 0 elements, 0x0 bytes (sizeof) 
{                                                                    
}ACTIVATION_CONTEXT, *PACTIVATION_CONTEXT;                                  
                                                                     
typedef struct _ACTIVATION_CONTEXT_DATA // 0 elements, 0x0 bytes (sizeof) 
{                                                                         
}ACTIVATION_CONTEXT_DATA, *PACTIVATION_CONTEXT_DATA;                                  
                                                                          
          typedef struct _LIST_ENTRY     // 2 elements, 0x8 bytes (sizeof) 
          {                                                                
/*0x000*/     struct _LIST_ENTRY* Flink;                                   
/*0x004*/     struct _LIST_ENTRY* Blink;                                   
          }LIST_ENTRY, *PLIST_ENTRY;                                       
                                                                           
          typedef struct _ACTIVATION_CONTEXT_STACK                     // 5 elements, 0x18 bytes (sizeof) 
          {                                                                                               
/*0x000*/     struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;                                    
/*0x004*/     struct _LIST_ENTRY FrameListCache;                       // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     ULONG32      Flags;                                                                         
/*0x010*/     ULONG32      NextCookieSequenceNumber;                                                      
/*0x014*/     ULONG32      StackId;                                                                       
          }ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK;                                          
                                                                                                          
          typedef struct _EX_PUSH_LOCK                 // 7 elements, 0x4 bytes (sizeof) 
          {                                                                              
              union                                    // 3 elements, 0x4 bytes (sizeof) 
              {                                                                          
                  struct                               // 5 elements, 0x4 bytes (sizeof) 
                  {                                                                      
/*0x000*/             ULONG32      Locked : 1;         // 0 BitPosition                  
/*0x000*/             ULONG32      Waiting : 1;        // 1 BitPosition                  
/*0x000*/             ULONG32      Waking : 1;         // 2 BitPosition                  
/*0x000*/             ULONG32      MultipleShared : 1; // 3 BitPosition                  
/*0x000*/             ULONG32      Shared : 28;        // 4 BitPosition                  
                  };                                                                     
/*0x000*/         ULONG32      Value;                                                    
/*0x000*/         VOID*        Ptr;                                                      
              };                                                                         
          }EX_PUSH_LOCK, *PEX_PUSH_LOCK;                                                 
                                                                                         
          typedef struct _ALPC_PROCESS_CONTEXT  // 3 elements, 0x10 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _EX_PUSH_LOCK Lock;        // 7 elements, 0x4 bytes (sizeof)  
/*0x004*/     struct _LIST_ENTRY ViewListHead;  // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     ULONG32      PagedPoolQuotaCache;                                    
          }ALPC_PROCESS_CONTEXT, *PALPC_PROCESS_CONTEXT;                                   
                                                                                   
typedef struct _ASSEMBLY_STORAGE_MAP // 0 elements, 0x0 bytes (sizeof) 
{                                                                      
}ASSEMBLY_STORAGE_MAP, *PASSEMBLY_STORAGE_MAP;                                  
                                                                       
          typedef struct _GENERIC_MAPPING  // 4 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     ULONG32      GenericRead;                                       
/*0x004*/     ULONG32      GenericWrite;                                      
/*0x008*/     ULONG32      GenericExecute;                                    
/*0x00C*/     ULONG32      GenericAll;                                        
          }GENERIC_MAPPING, *PGENERIC_MAPPING;                                   
                                                                              
          typedef struct _GUID       // 4 elements, 0x10 bytes (sizeof) 
          {                                                             
/*0x000*/     ULONG32      Data1;                                       
/*0x004*/     UINT16       Data2;                                       
/*0x006*/     UINT16       Data3;                                       
/*0x008*/     UINT8        Data4[8];                                    
          }GUID, *PGUID;                                                
                                                                        
          typedef struct _AUX_ACCESS_DATA                                                                       // 12 elements, 0xC4 bytes (sizeof) 
          {                                                                                                                                         
/*0x000*/     struct _PRIVILEGE_SET* PrivilegesUsed;                                                                                                
/*0x004*/     struct _GENERIC_MAPPING GenericMapping;                                                           // 4 elements, 0x10 bytes (sizeof)  
/*0x014*/     ULONG32      AccessesToAudit;                                                                                                         
/*0x018*/     ULONG32      MaximumAuditMask;                                                                                                        
/*0x01C*/     struct _GUID TransactionId;                                                                       // 4 elements, 0x10 bytes (sizeof)  
/*0x02C*/     VOID*        NewSecurityDescriptor;                                                                                                   
/*0x030*/     VOID*        ExistingSecurityDescriptor;                                                                                              
/*0x034*/     VOID*        ParentSecurityDescriptor;                                                                                                
/*0x038*/     FUNCT_00C8_00C7_CleanupGroupCancelCallback_DeRefSecurityDescriptor_Free* DeRefSecurityDescriptor;                                     
/*0x03C*/     VOID*        SDLock;                                                                                                                  
/*0x040*/     struct _ACCESS_REASONS AccessReasons;                                                             // 1 elements, 0x80 bytes (sizeof)  
/*0x0C0*/     UINT8        GenerateStagingEvents;                                                                                                   
/*0x0C1*/     UINT8        _PADDING0_[0x3];                                                                                                         
          }AUX_ACCESS_DATA, *PAUX_ACCESS_DATA;                                                                                                      
                                                                                                                                                    
          typedef struct _BATTERY_REPORTING_SCALE // 2 elements, 0x8 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      Granularity;                                             
/*0x004*/     ULONG32      Capacity;                                                
          }BATTERY_REPORTING_SCALE, *PBATTERY_REPORTING_SCALE;                                  
                                                                                    
          typedef struct _CACHE_DESCRIPTOR     // 5 elements, 0xC bytes (sizeof) 
          {                                                                      
/*0x000*/     UINT8        Level;                                                
/*0x001*/     UINT8        Associativity;                                        
/*0x002*/     UINT16       LineSize;                                             
/*0x004*/     ULONG32      Size;                                                 
/*0x008*/     enum _PROCESSOR_CACHE_TYPE Type;                                   
          }CACHE_DESCRIPTOR, *PCACHE_DESCRIPTOR;                                  
                                                                                 
          typedef struct _CLIENT_ID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     VOID*        UniqueProcess;                                   
/*0x004*/     VOID*        UniqueThread;                                    
          }CLIENT_ID, *PCLIENT_ID;                                          
                                                                            
          typedef struct _CLIENT_ID32     // 2 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      UniqueProcess;                                   
/*0x004*/     ULONG32      UniqueThread;                                    
          }CLIENT_ID32, *PCLIENT_ID32;                                      
                                                                            
          typedef struct _CLIENT_ID64     // 2 elements, 0x10 bytes (sizeof) 
          {                                                                  
/*0x000*/     UINT64       UniqueProcess;                                    
/*0x008*/     UINT64       UniqueThread;                                     
          }CLIENT_ID64, *PCLIENT_ID64;                                       
                                                                             
          typedef union _LARGE_INTEGER   // 4 elements, 0x8 bytes (sizeof) 
          {                                                                
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              };                                                           
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              }u;                                                          
/*0x000*/     INT64        QuadPart;                                       
          }LARGE_INTEGER, *PLARGE_INTEGER;                                  
                                                                           
          typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                 
/*0x000*/     UINT8        Type;                                                            
/*0x001*/     UINT8        ShareDisposition;                                                
/*0x002*/     UINT16       Flags;                                                           
              union                                      // 14 elements, 0xC bytes (sizeof) 
              {                                                                             
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length;                                                  
                  }Generic;                                                                 
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length;                                                  
                  }Port;                                                                    
                  struct                                 // 4 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             UINT16       Level;                                                   
/*0x006*/             UINT16       Group;                                                   
/*0x008*/             ULONG32      Vector;                                                  
/*0x00C*/             ULONG32      Affinity;                                                
                  }Interrupt;                                                               
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
                      union                              // 2 elements, 0xC bytes (sizeof)  
                      {                                                                     
                          struct                         // 4 elements, 0xC bytes (sizeof)  
                          {                                                                 
/*0x004*/                     UINT16       Group;                                           
/*0x006*/                     UINT16       MessageCount;                                    
/*0x008*/                     ULONG32      Vector;                                          
/*0x00C*/                     ULONG32      Affinity;                                        
                          }Raw;                                                             
                          struct                         // 4 elements, 0xC bytes (sizeof)  
                          {                                                                 
/*0x004*/                     UINT16       Level;                                           
/*0x006*/                     UINT16       Group;                                           
/*0x008*/                     ULONG32      Vector;                                          
/*0x00C*/                     ULONG32      Affinity;                                        
                          }Translated;                                                      
                      };                                                                    
                  }MessageInterrupt;                                                        
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length;                                                  
                  }Memory;                                                                  
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Channel;                                                 
/*0x008*/             ULONG32      Port;                                                    
/*0x00C*/             ULONG32      Reserved1;                                               
                  }Dma;                                                                     
                  struct                                 // 6 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Channel;                                                 
/*0x008*/             ULONG32      RequestLine;                                             
/*0x00C*/             UINT8        TransferWidth;                                           
/*0x00D*/             UINT8        Reserved1;                                               
/*0x00E*/             UINT8        Reserved2;                                               
/*0x00F*/             UINT8        Reserved3;                                               
                  }DmaV3;                                                                   
                  struct                                 // 1 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Data[3];                                                 
                  }DevicePrivate;                                                           
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Start;                                                   
/*0x008*/             ULONG32      Length;                                                  
/*0x00C*/             ULONG32      Reserved;                                                
                  }BusNumber;                                                               
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      DataSize;                                                
/*0x008*/             ULONG32      Reserved1;                                               
/*0x00C*/             ULONG32      Reserved2;                                               
                  }DeviceSpecificData;                                                      
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length40;                                                
                  }Memory40;                                                                
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length48;                                                
                  }Memory48;                                                                
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length64;                                                
                  }Memory64;                                                                
                  struct                                 // 6 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             UINT8        Class;                                                   
/*0x005*/             UINT8        Type;                                                    
/*0x006*/             UINT8        Reserved1;                                               
/*0x007*/             UINT8        Reserved2;                                               
/*0x008*/             ULONG32      IdLowPart;                                               
/*0x00C*/             ULONG32      IdHighPart;                                              
                  }Connection;                                                              
              }u;                                                                           
          }CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR;                                   
                                                                                            
          typedef struct _CM_PARTIAL_RESOURCE_LIST                          // 4 elements, 0x18 bytes (sizeof) 
          {                                                                                                    
/*0x000*/     UINT16       Version;                                                                            
/*0x002*/     UINT16       Revision;                                                                           
/*0x004*/     ULONG32      Count;                                                                              
/*0x008*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];                                    
          }CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST;                                               
                                                                                                               
          typedef struct _CM_FULL_RESOURCE_DESCRIPTOR               // 3 elements, 0x20 bytes (sizeof) 
          {                                                                                            
/*0x000*/     enum _INTERFACE_TYPE InterfaceType;                                                      
/*0x004*/     ULONG32      BusNumber;                                                                  
/*0x008*/     struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList; // 4 elements, 0x18 bytes (sizeof) 
          }CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR;                                   
                                                                                                       
          typedef struct _CM_RESOURCE_LIST                 // 2 elements, 0x24 bytes (sizeof) 
          {                                                                                   
/*0x000*/     ULONG32      Count;                                                             
/*0x004*/     struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];                                    
          }CM_RESOURCE_LIST, *PCM_RESOURCE_LIST;                                              
                                                                                              
          typedef struct _COMPRESSED_DATA_INFO         // 7 elements, 0xC bytes (sizeof) 
          {                                                                              
/*0x000*/     UINT16       CompressionFormatAndEngine;                                   
/*0x002*/     UINT8        CompressionUnitShift;                                         
/*0x003*/     UINT8        ChunkShift;                                                   
/*0x004*/     UINT8        ClusterShift;                                                 
/*0x005*/     UINT8        Reserved;                                                     
/*0x006*/     UINT16       NumberOfChunks;                                               
/*0x008*/     ULONG32      CompressedChunkSizes[1];                                      
          }COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO;                                  
                                                                                         
          typedef struct _FLOATING_SAVE_AREA // 9 elements, 0x70 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      ControlWord;                                         
/*0x004*/     ULONG32      StatusWord;                                          
/*0x008*/     ULONG32      TagWord;                                             
/*0x00C*/     ULONG32      ErrorOffset;                                         
/*0x010*/     ULONG32      ErrorSelector;                                       
/*0x014*/     ULONG32      DataOffset;                                          
/*0x018*/     ULONG32      DataSelector;                                        
/*0x01C*/     UINT8        RegisterArea[80];                                    
/*0x06C*/     ULONG32      Spare0;                                              
          }FLOATING_SAVE_AREA, *PFLOATING_SAVE_AREA;                                   
                                                                                
          typedef struct _CONTEXT                   // 25 elements, 0x2CC bytes (sizeof) 
          {                                                                              
/*0x000*/     ULONG32      ContextFlags;                                                 
/*0x004*/     ULONG32      Dr0;                                                          
/*0x008*/     ULONG32      Dr1;                                                          
/*0x00C*/     ULONG32      Dr2;                                                          
/*0x010*/     ULONG32      Dr3;                                                          
/*0x014*/     ULONG32      Dr6;                                                          
/*0x018*/     ULONG32      Dr7;                                                          
/*0x01C*/     struct _FLOATING_SAVE_AREA FloatSave; // 9 elements, 0x70 bytes (sizeof)   
/*0x08C*/     ULONG32      SegGs;                                                        
/*0x090*/     ULONG32      SegFs;                                                        
/*0x094*/     ULONG32      SegEs;                                                        
/*0x098*/     ULONG32      SegDs;                                                        
/*0x09C*/     ULONG32      Edi;                                                          
/*0x0A0*/     ULONG32      Esi;                                                          
/*0x0A4*/     ULONG32      Ebx;                                                          
/*0x0A8*/     ULONG32      Edx;                                                          
/*0x0AC*/     ULONG32      Ecx;                                                          
/*0x0B0*/     ULONG32      Eax;                                                          
/*0x0B4*/     ULONG32      Ebp;                                                          
/*0x0B8*/     ULONG32      Eip;                                                          
/*0x0BC*/     ULONG32      SegCs;                                                        
/*0x0C0*/     ULONG32      EFlags;                                                       
/*0x0C4*/     ULONG32      Esp;                                                          
/*0x0C8*/     ULONG32      SegSs;                                                        
/*0x0CC*/     UINT8        ExtendedRegisters[512];                                       
          }CONTEXT, *PCONTEXT;                                                           
                                                                                         
          typedef struct _COUNTER_READING       // 4 elements, 0x18 bytes (sizeof) 
          {                                                                        
/*0x000*/     enum _HARDWARE_COUNTER_TYPE Type;                                    
/*0x004*/     ULONG32      Index;                                                  
/*0x008*/     UINT64       Start;                                                  
/*0x010*/     UINT64       Total;                                                  
          }COUNTER_READING, *PCOUNTER_READING;                                     
                                                                                   
          typedef union _CPU_INFO       // 5 elements, 0x10 bytes (sizeof) 
          {                                                                
/*0x000*/     UINT32       AsUINT32[4];                                    
              struct                    // 4 elements, 0x10 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      Eax;                                        
/*0x004*/         ULONG32      Ebx;                                        
/*0x008*/         ULONG32      Ecx;                                        
/*0x00C*/         ULONG32      Edx;                                        
              };                                                           
          }CPU_INFO, *PCPU_INFO;                                           
                                                                           
          typedef struct _CURDIR              // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _UNICODE_STRING DosPath; // 3 elements, 0x8 bytes (sizeof) 
/*0x008*/     VOID*        Handle;                                              
          }CURDIR, *PCURDIR;                                                    
                                                                                
          typedef struct _DESCRIPTOR // 3 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     UINT16       Pad;                                        
/*0x002*/     UINT16       Limit;                                      
/*0x004*/     ULONG32      Base;                                       
          }DESCRIPTOR, *PDESCRIPTOR;                                   
                                                                       
          typedef struct _DEVICE_CAPABILITIES          // 31 elements, 0x40 bytes (sizeof) 
          {                                                                                
/*0x000*/     UINT16       Size;                                                           
/*0x002*/     UINT16       Version;                                                        
              struct                                   // 21 elements, 0x4 bytes (sizeof)  
              {                                                                            
/*0x004*/         ULONG32      DeviceD1 : 1;           // 0 BitPosition                    
/*0x004*/         ULONG32      DeviceD2 : 1;           // 1 BitPosition                    
/*0x004*/         ULONG32      LockSupported : 1;      // 2 BitPosition                    
/*0x004*/         ULONG32      EjectSupported : 1;     // 3 BitPosition                    
/*0x004*/         ULONG32      Removable : 1;          // 4 BitPosition                    
/*0x004*/         ULONG32      DockDevice : 1;         // 5 BitPosition                    
/*0x004*/         ULONG32      UniqueID : 1;           // 6 BitPosition                    
/*0x004*/         ULONG32      SilentInstall : 1;      // 7 BitPosition                    
/*0x004*/         ULONG32      RawDeviceOK : 1;        // 8 BitPosition                    
/*0x004*/         ULONG32      SurpriseRemovalOK : 1;  // 9 BitPosition                    
/*0x004*/         ULONG32      WakeFromD0 : 1;         // 10 BitPosition                   
/*0x004*/         ULONG32      WakeFromD1 : 1;         // 11 BitPosition                   
/*0x004*/         ULONG32      WakeFromD2 : 1;         // 12 BitPosition                   
/*0x004*/         ULONG32      WakeFromD3 : 1;         // 13 BitPosition                   
/*0x004*/         ULONG32      HardwareDisabled : 1;   // 14 BitPosition                   
/*0x004*/         ULONG32      NonDynamic : 1;         // 15 BitPosition                   
/*0x004*/         ULONG32      WarmEjectSupported : 1; // 16 BitPosition                   
/*0x004*/         ULONG32      NoDisplayInUI : 1;      // 17 BitPosition                   
/*0x004*/         ULONG32      Reserved1 : 1;          // 18 BitPosition                   
/*0x004*/         ULONG32      WakeFromInterrupt : 1;  // 19 BitPosition                   
/*0x004*/         ULONG32      Reserved : 12;          // 20 BitPosition                   
              };                                                                           
/*0x008*/     ULONG32      Address;                                                        
/*0x00C*/     ULONG32      UINumber;                                                       
/*0x010*/     enum _DEVICE_POWER_STATE DeviceState[7];                                     
/*0x02C*/     enum _SYSTEM_POWER_STATE SystemWake;                                         
/*0x030*/     enum _DEVICE_POWER_STATE DeviceWake;                                         
/*0x034*/     ULONG32      D1Latency;                                                      
/*0x038*/     ULONG32      D2Latency;                                                      
/*0x03C*/     ULONG32      D3Latency;                                                      
          }DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES;                                     
                                                                                           
          typedef struct _DEVICE_MAP                               // 7 elements, 0x38 bytes (sizeof) 
          {                                                                                           
/*0x000*/     struct _OBJECT_DIRECTORY* DosDevicesDirectory;                                          
/*0x004*/     struct _OBJECT_DIRECTORY* GlobalDosDevicesDirectory;                                    
/*0x008*/     VOID*        DosDevicesDirectoryHandle;                                                 
/*0x00C*/     LONG32       ReferenceCount;                                                            
/*0x010*/     ULONG32      DriveMap;                                                                  
/*0x014*/     UINT8        DriveType[32];                                                             
/*0x034*/     struct _EJOB* ServerSilo;                                                               
          }DEVICE_MAP, *PDEVICE_MAP;                                                                  
                                                                                                      
          typedef struct _KDEVICE_QUEUE_ENTRY     // 3 elements, 0x10 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _LIST_ENTRY DeviceListEntry; // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     ULONG32      SortKey;                                                  
/*0x00C*/     UINT8        Inserted;                                                 
/*0x00D*/     UINT8        _PADDING0_[0x3];                                          
          }KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY;                                   
                                                                                     
          typedef struct _WAIT_CONTEXT_BLOCK                  // 13 elements, 0x28 bytes (sizeof) 
          {                                                                                       
              union                                           // 2 elements, 0x10 bytes (sizeof)  
              {                                                                                   
/*0x000*/         struct _KDEVICE_QUEUE_ENTRY WaitQueueEntry; // 3 elements, 0x10 bytes (sizeof)  
                  struct                                      // 3 elements, 0x10 bytes (sizeof)  
                  {                                                                               
/*0x000*/             struct _LIST_ENTRY DmaWaitEntry;        // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/             ULONG32      NumberOfChannels;                                              
                      struct                                  // 4 elements, 0x4 bytes (sizeof)   
                      {                                                                           
/*0x00C*/                 ULONG32      SyncCallback : 1;      // 0 BitPosition                    
/*0x00C*/                 ULONG32      DmaContext : 1;        // 1 BitPosition                    
/*0x00C*/                 ULONG32      ZeroMapRegisters : 1;  // 2 BitPosition                    
/*0x00C*/                 ULONG32      Reserved : 29;         // 3 BitPosition                    
                      };                                                                          
                  };                                                                              
              };                                                                                  
/*0x010*/     FUNCT_1336_1335_DeviceRoutine* DeviceRoutine;                                       
/*0x014*/     VOID*        DeviceContext;                                                         
/*0x018*/     ULONG32      NumberOfMapRegisters;                                                  
/*0x01C*/     VOID*        DeviceObject;                                                          
/*0x020*/     VOID*        CurrentIrp;                                                            
/*0x024*/     struct _KDPC* BufferChainingDpc;                                                    
          }WAIT_CONTEXT_BLOCK, *PWAIT_CONTEXT_BLOCK;                                              
                                                                                                  
          typedef struct _KDEVICE_QUEUE          // 5 elements, 0x14 bytes (sizeof) 
          {                                                                         
/*0x000*/     INT16        Type;                                                    
/*0x002*/     INT16        Size;                                                    
/*0x004*/     struct _LIST_ENTRY DeviceListHead; // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     ULONG32      Lock;                                                    
/*0x010*/     UINT8        Busy;                                                    
/*0x011*/     UINT8        _PADDING0_[0x3];                                         
          }KDEVICE_QUEUE, *PKDEVICE_QUEUE;                                          
                                                                                    
          typedef struct _SINGLE_LIST_ENTRY    // 1 elements, 0x4 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _SINGLE_LIST_ENTRY* Next;                                   
          }SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY;                                  
                                                                                 
          typedef struct _KDPC                                  // 11 elements, 0x20 bytes (sizeof) 
          {                                                                                         
              union                                             // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                     
/*0x000*/         ULONG32      TargetInfoAsUlong;                                                   
                  struct                                        // 3 elements, 0x4 bytes (sizeof)   
                  {                                                                                 
/*0x000*/             UINT8        Type;                                                            
/*0x001*/             UINT8        Importance;                                                      
/*0x002*/             UINT16       Number;                                                          
                  };                                                                                
              };                                                                                    
/*0x004*/     struct _SINGLE_LIST_ENTRY DpcListEntry;           // 1 elements, 0x4 bytes (sizeof)   
/*0x008*/     ULONG32      ProcessorHistory;                                                        
/*0x00C*/     FUNCT_00C8_056B_DeferredRoutine* DeferredRoutine;                                     
/*0x010*/     VOID*        DeferredContext;                                                         
/*0x014*/     VOID*        SystemArgument1;                                                         
/*0x018*/     VOID*        SystemArgument2;                                                         
/*0x01C*/     VOID*        DpcData;                                                                 
          }KDPC, *PKDPC;                                                                            
                                                                                                    
          typedef struct _DISPATCHER_HEADER                                // 53 elements, 0x10 bytes (sizeof) 
          {                                                                                                    
              union                                                        // 8 elements, 0x4 bytes (sizeof)   
              {                                                                                                
/*0x000*/         LONG32       Lock;                                                                           
/*0x000*/         LONG32       LockNV;                                                                         
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        Type;                                                                       
/*0x001*/             UINT8        Signalling;                                                                 
/*0x002*/             UINT8        Size;                                                                       
/*0x003*/             UINT8        Reserved1;                                                                  
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        TimerType;                                                                  
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x001*/                 UINT8        TimerControlFlags;                                                      
                          struct                                           // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x001*/                     UINT8        Absolute : 1;                   // 0 BitPosition                    
/*0x001*/                     UINT8        Wake : 1;                       // 1 BitPosition                    
/*0x001*/                     UINT8        EncodedTolerableDelay : 6;      // 2 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x002*/             UINT8        Hand;                                                                       
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x003*/                 UINT8        TimerMiscFlags;                                                         
                          struct                                           // 4 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x003*/                     UINT8        Index : 1;                      // 0 BitPosition                    
/*0x003*/                     UINT8        Processor : 5;                  // 1 BitPosition                    
/*0x003*/                     UINT8        Inserted : 1;                   // 6 BitPosition                    
/*0x003*/                     UINT8        Expired : 1;                    // 7 BitPosition                    
                          };                                                                                   
                      };                                                                                       
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        Timer2Type;                                                                 
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x001*/                 UINT8        Timer2Flags;                                                            
                          struct                                           // 7 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x001*/                     UINT8        Timer2Inserted : 1;             // 0 BitPosition                    
/*0x001*/                     UINT8        Timer2Expiring : 1;             // 1 BitPosition                    
/*0x001*/                     UINT8        Timer2CancelPending : 1;        // 2 BitPosition                    
/*0x001*/                     UINT8        Timer2SetPending : 1;           // 3 BitPosition                    
/*0x001*/                     UINT8        Timer2Running : 1;              // 4 BitPosition                    
/*0x001*/                     UINT8        Timer2Disabled : 1;             // 5 BitPosition                    
/*0x001*/                     UINT8        Timer2ReservedFlags : 2;        // 6 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x002*/             UINT8        Timer2Reserved1;                                                            
/*0x003*/             UINT8        Timer2Reserved2;                                                            
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        QueueType;                                                                  
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x001*/                 UINT8        QueueControlFlags;                                                      
                          struct                                           // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x001*/                     UINT8        Abandoned : 1;                  // 0 BitPosition                    
/*0x001*/                     UINT8        DisableIncrement : 1;           // 1 BitPosition                    
/*0x001*/                     UINT8        QueueReservedControlFlags : 6;  // 2 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x002*/             UINT8        QueueSize;                                                                  
/*0x003*/             UINT8        QueueReserved;                                                              
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        ThreadType;                                                                 
/*0x001*/             UINT8        ThreadReserved;                                                             
                      union                                                // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                        
/*0x002*/                 UINT8        ThreadControlFlags;                                                     
                          struct                                           // 8 elements, 0x1 bytes (sizeof)   
                          {                                                                                    
/*0x002*/                     UINT8        CycleProfiling : 1;             // 0 BitPosition                    
/*0x002*/                     UINT8        CounterProfiling : 1;           // 1 BitPosition                    
/*0x002*/                     UINT8        GroupScheduling : 1;            // 2 BitPosition                    
/*0x002*/                     UINT8        AffinitySet : 1;                // 3 BitPosition                    
/*0x002*/                     UINT8        Tagged : 1;                     // 4 BitPosition                    
/*0x002*/                     UINT8        EnergyProfiling : 1;            // 5 BitPosition                    
/*0x002*/                     UINT8        Instrumented : 1;               // 6 BitPosition                    
/*0x002*/                     UINT8        ThreadReservedControlFlags : 1; // 7 BitPosition                    
                          };                                                                                   
                      };                                                                                       
/*0x003*/             UINT8        DebugActive;                                                                
                  };                                                                                           
                  struct                                                   // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                            
/*0x000*/             UINT8        MutantType;                                                                 
/*0x001*/             UINT8        MutantSize;                                                                 
/*0x002*/             UINT8        DpcActive;                                                                  
/*0x003*/             UINT8        MutantReserved;                                                             
                  };                                                                                           
              };                                                                                               
/*0x004*/     LONG32       SignalState;                                                                        
/*0x008*/     struct _LIST_ENTRY WaitListHead;                             // 2 elements, 0x8 bytes (sizeof)   
          }DISPATCHER_HEADER, *PDISPATCHER_HEADER;                                                             
                                                                                                               
          typedef struct _KEVENT                // 1 elements, 0x10 bytes (sizeof)  
          {                                                                         
/*0x000*/     struct _DISPATCHER_HEADER Header; // 53 elements, 0x10 bytes (sizeof) 
          }KEVENT, *PKEVENT;                                                        
                                                                                    
          typedef struct _DEVICE_OBJECT                        // 25 elements, 0xB8 bytes (sizeof) 
          {                                                                                        
/*0x000*/     INT16        Type;                                                                   
/*0x002*/     UINT16       Size;                                                                   
/*0x004*/     LONG32       ReferenceCount;                                                         
/*0x008*/     struct _DRIVER_OBJECT* DriverObject;                                                 
/*0x00C*/     struct _DEVICE_OBJECT* NextDevice;                                                   
/*0x010*/     struct _DEVICE_OBJECT* AttachedDevice;                                               
/*0x014*/     struct _IRP* CurrentIrp;                                                             
/*0x018*/     struct _IO_TIMER* Timer;                                                             
/*0x01C*/     ULONG32      Flags;                                                                  
/*0x020*/     ULONG32      Characteristics;                                                        
/*0x024*/     struct _VPB* Vpb;                                                                    
/*0x028*/     VOID*        DeviceExtension;                                                        
/*0x02C*/     ULONG32      DeviceType;                                                             
/*0x030*/     CHAR         StackSize;                                                              
/*0x031*/     UINT8        _PADDING0_[0x3];                                                        
              union                                            // 2 elements, 0x28 bytes (sizeof)  
              {                                                                                    
/*0x034*/         struct _LIST_ENTRY ListEntry;                // 2 elements, 0x8 bytes (sizeof)   
/*0x034*/         struct _WAIT_CONTEXT_BLOCK Wcb;              // 13 elements, 0x28 bytes (sizeof) 
              }Queue;                                                                              
/*0x05C*/     ULONG32      AlignmentRequirement;                                                   
/*0x060*/     struct _KDEVICE_QUEUE DeviceQueue;               // 5 elements, 0x14 bytes (sizeof)  
/*0x074*/     struct _KDPC Dpc;                                // 11 elements, 0x20 bytes (sizeof) 
/*0x094*/     ULONG32      ActiveThreadCount;                                                      
/*0x098*/     VOID*        SecurityDescriptor;                                                     
/*0x09C*/     struct _KEVENT DeviceLock;                       // 1 elements, 0x10 bytes (sizeof)  
/*0x0AC*/     UINT16       SectorSize;                                                             
/*0x0AE*/     UINT16       Spare1;                                                                 
/*0x0B0*/     struct _DEVOBJ_EXTENSION* DeviceObjectExtension;                                     
/*0x0B4*/     VOID*        Reserved;                                                               
          }DEVICE_OBJECT, *PDEVICE_OBJECT;                                                         
                                                                                                   
typedef struct _DEVICE_OBJECT_POWER_EXTENSION // 0 elements, 0x0 bytes (sizeof) 
{                                                                               
}DEVICE_OBJECT_POWER_EXTENSION, *PDEVICE_OBJECT_POWER_EXTENSION;                                  
                                                                                
          typedef struct _DEVOBJ_EXTENSION                 // 15 elements, 0x38 bytes (sizeof) 
          {                                                                                    
/*0x000*/     INT16        Type;                                                               
/*0x002*/     UINT16       Size;                                                               
/*0x004*/     struct _DEVICE_OBJECT* DeviceObject;                                             
/*0x008*/     ULONG32      PowerFlags;                                                         
/*0x00C*/     struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;                                     
/*0x010*/     ULONG32      ExtensionFlags;                                                     
/*0x014*/     VOID*        DeviceNode;                                                         
/*0x018*/     struct _DEVICE_OBJECT* AttachedTo;                                               
/*0x01C*/     LONG32       StartIoCount;                                                       
/*0x020*/     LONG32       StartIoKey;                                                         
/*0x024*/     ULONG32      StartIoFlags;                                                       
/*0x028*/     struct _VPB* Vpb;                                                                
/*0x02C*/     VOID*        DependencyNode;                                                     
/*0x030*/     VOID*        InterruptContext;                                                   
/*0x034*/     VOID*        VerifierContext;                                                    
          }DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION;                                               
                                                                                               
          typedef struct _DPH_BLOCK_INFORMATION           // 9 elements, 0x20 bytes (sizeof) 
          {                                                                                  
/*0x000*/     ULONG32      StartStamp;                                                       
/*0x004*/     VOID*        Heap;                                                             
/*0x008*/     ULONG32      RequestedSize;                                                    
/*0x00C*/     ULONG32      ActualSize;                                                       
              union                                       // 3 elements, 0x8 bytes (sizeof)  
              {                                                                              
/*0x010*/         struct _LIST_ENTRY FreeQueue;           // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/         struct _SINGLE_LIST_ENTRY FreePushList; // 1 elements, 0x4 bytes (sizeof)  
/*0x010*/         UINT16       TraceIndex;                                                   
              };                                                                             
/*0x018*/     VOID*        StackTrace;                                                       
/*0x01C*/     ULONG32      EndStamp;                                                         
          }DPH_BLOCK_INFORMATION, *PDPH_BLOCK_INFORMATION;                                   
                                                                                             
          typedef struct _RTL_BALANCED_LINKS          // 5 elements, 0x10 bytes (sizeof) 
          {                                                                              
/*0x000*/     struct _RTL_BALANCED_LINKS* Parent;                                        
/*0x004*/     struct _RTL_BALANCED_LINKS* LeftChild;                                     
/*0x008*/     struct _RTL_BALANCED_LINKS* RightChild;                                    
/*0x00C*/     CHAR         Balance;                                                      
/*0x00D*/     UINT8        Reserved[3];                                                  
          }RTL_BALANCED_LINKS, *PRTL_BALANCED_LINKS;                                     
                                                                                         
          typedef struct _DPH_HEAP_BLOCK                 // 14 elements, 0x40 bytes (sizeof) 
          {                                                                                  
              union                                      // 3 elements, 0x10 bytes (sizeof)  
              {                                                                              
/*0x000*/         struct _DPH_HEAP_BLOCK* pNextAlloc;                                        
/*0x000*/         struct _LIST_ENTRY AvailableEntry;     // 2 elements, 0x8 bytes (sizeof)   
/*0x000*/         struct _RTL_BALANCED_LINKS TableLinks; // 5 elements, 0x10 bytes (sizeof)  
              };                                                                             
/*0x010*/     UINT8*       pUserAllocation;                                                  
/*0x014*/     UINT8*       pVirtualBlock;                                                    
/*0x018*/     ULONG32      nVirtualBlockSize;                                                
/*0x01C*/     ULONG32      nVirtualAccessSize;                                               
/*0x020*/     ULONG32      nUserRequestedSize;                                               
/*0x024*/     ULONG32      nUserActualSize;                                                  
/*0x028*/     VOID*        UserValue;                                                        
/*0x02C*/     ULONG32      UserFlags;                                                        
/*0x030*/     struct _RTL_TRACE_BLOCK* StackTrace;                                           
/*0x034*/     struct _LIST_ENTRY AdjacencyEntry;         // 2 elements, 0x8 bytes (sizeof)   
/*0x03C*/     UINT8*       pVirtualRegion;                                                   
          }DPH_HEAP_BLOCK, *PDPH_HEAP_BLOCK;                                                 
                                                                                             
          typedef struct _RTL_AVL_TABLE                         // 11 elements, 0x38 bytes (sizeof) 
          {                                                                                         
/*0x000*/     struct _RTL_BALANCED_LINKS BalancedRoot;          // 5 elements, 0x10 bytes (sizeof)  
/*0x010*/     VOID*        OrderedPointer;                                                          
/*0x014*/     ULONG32      WhichOrderedElement;                                                     
/*0x018*/     ULONG32      NumberGenericTableElements;                                              
/*0x01C*/     ULONG32      DepthOfTree;                                                             
/*0x020*/     struct _RTL_BALANCED_LINKS* RestartKey;                                               
/*0x024*/     ULONG32      DeleteCount;                                                             
/*0x028*/     FUNCT_1C1C_1C1B_CompareRoutine* CompareRoutine;                                       
/*0x02C*/     FUNCT_00CB_1C25_AllocateRoutine* AllocateRoutine;                                     
/*0x030*/     FUNCT_00C8_1C29_FreeRoutine* FreeRoutine;                                             
/*0x034*/     VOID*        TableContext;                                                            
          }RTL_AVL_TABLE, *PRTL_AVL_TABLE;                                                          
                                                                                                    
          typedef struct _DPH_HEAP_ROOT                        // 33 elements, 0xC0 bytes (sizeof) 
          {                                                                                        
/*0x000*/     ULONG32      Signature;                                                              
/*0x004*/     ULONG32      HeapFlags;                                                              
/*0x008*/     struct _RTL_CRITICAL_SECTION* HeapCritSect;                                          
/*0x00C*/     ULONG32      nRemoteLockAcquired;                                                    
/*0x010*/     struct _DPH_HEAP_BLOCK* pVirtualStorageListHead;                                     
/*0x014*/     struct _DPH_HEAP_BLOCK* pVirtualStorageListTail;                                     
/*0x018*/     ULONG32      nVirtualStorageRanges;                                                  
/*0x01C*/     ULONG32      nVirtualStorageBytes;                                                   
/*0x020*/     struct _RTL_AVL_TABLE BusyNodesTable;            // 11 elements, 0x38 bytes (sizeof) 
/*0x058*/     struct _DPH_HEAP_BLOCK* NodeToAllocate;                                              
/*0x05C*/     ULONG32      nBusyAllocations;                                                       
/*0x060*/     ULONG32      nBusyAllocationBytesCommitted;                                          
/*0x064*/     struct _DPH_HEAP_BLOCK* pFreeAllocationListHead;                                     
/*0x068*/     struct _DPH_HEAP_BLOCK* pFreeAllocationListTail;                                     
/*0x06C*/     ULONG32      nFreeAllocations;                                                       
/*0x070*/     ULONG32      nFreeAllocationBytesCommitted;                                          
/*0x074*/     struct _LIST_ENTRY AvailableAllocationHead;      // 2 elements, 0x8 bytes (sizeof)   
/*0x07C*/     ULONG32      nAvailableAllocations;                                                  
/*0x080*/     ULONG32      nAvailableAllocationBytesCommitted;                                     
/*0x084*/     struct _DPH_HEAP_BLOCK* pUnusedNodeListHead;                                         
/*0x088*/     struct _DPH_HEAP_BLOCK* pUnusedNodeListTail;                                         
/*0x08C*/     ULONG32      nUnusedNodes;                                                           
/*0x090*/     ULONG32      nBusyAllocationBytesAccessible;                                         
/*0x094*/     struct _DPH_HEAP_BLOCK* pNodePoolListHead;                                           
/*0x098*/     struct _DPH_HEAP_BLOCK* pNodePoolListTail;                                           
/*0x09C*/     ULONG32      nNodePools;                                                             
/*0x0A0*/     ULONG32      nNodePoolBytes;                                                         
/*0x0A4*/     struct _LIST_ENTRY NextHeap;                     // 2 elements, 0x8 bytes (sizeof)   
/*0x0AC*/     ULONG32      ExtraFlags;                                                             
/*0x0B0*/     ULONG32      Seed;                                                                   
/*0x0B4*/     VOID*        NormalHeap;                                                             
/*0x0B8*/     struct _RTL_TRACE_BLOCK* CreateStackTrace;                                           
/*0x0BC*/     VOID*        FirstThread;                                                            
          }DPH_HEAP_ROOT, *PDPH_HEAP_ROOT;                                                         
                                                                                                   
          typedef struct _DRIVER_EXTENSION                        // 9 elements, 0x28 bytes (sizeof) 
          {                                                                                          
/*0x000*/     struct _DRIVER_OBJECT* DriverObject;                                                   
/*0x004*/     FUNCT_0078_0C01_AddDevice* AddDevice;                                                  
/*0x008*/     ULONG32      Count;                                                                    
/*0x00C*/     struct _UNICODE_STRING ServiceKeyName;              // 3 elements, 0x8 bytes (sizeof)  
/*0x014*/     struct _IO_CLIENT_EXTENSION* ClientDriverExtension;                                    
/*0x018*/     struct _FS_FILTER_CALLBACKS* FsFilterCallbacks;                                        
/*0x01C*/     VOID*        KseCallbacks;                                                             
/*0x020*/     VOID*        DvCallbacks;                                                              
/*0x024*/     VOID*        VerifierContext;                                                          
          }DRIVER_EXTENSION, *PDRIVER_EXTENSION;                                                     
                                                                                                     
          typedef struct _DRIVER_OBJECT                                   // 15 elements, 0xA8 bytes (sizeof) 
          {                                                                                                   
/*0x000*/     INT16        Type;                                                                              
/*0x002*/     INT16        Size;                                                                              
/*0x004*/     struct _DEVICE_OBJECT* DeviceObject;                                                            
/*0x008*/     ULONG32      Flags;                                                                             
/*0x00C*/     VOID*        DriverStart;                                                                       
/*0x010*/     ULONG32      DriverSize;                                                                        
/*0x014*/     VOID*        DriverSection;                                                                     
/*0x018*/     struct _DRIVER_EXTENSION* DriverExtension;                                                      
/*0x01C*/     struct _UNICODE_STRING DriverName;                          // 3 elements, 0x8 bytes (sizeof)   
/*0x024*/     struct _UNICODE_STRING* HardwareDatabase;                                                       
/*0x028*/     struct _FAST_IO_DISPATCH* FastIoDispatch;                                                       
/*0x02C*/     FUNCT_0078_130E_DriverInit* DriverInit;                                                         
/*0x030*/     FUNCT_00C8_1054_DriverStartIo_CancelRoutine* DriverStartIo;                                     
/*0x034*/     FUNCT_00C8_1312_DriverUnload* DriverUnload;                                                     
/*0x038*/     FUNCT_0078_1316_MajorFunction* MajorFunction[28];                                               
          }DRIVER_OBJECT, *PDRIVER_OBJECT;                                                                    
                                                                                                              
typedef struct _ECP_LIST // 0 elements, 0x0 bytes (sizeof) 
{                                                          
}ECP_LIST, *PECP_LIST;                                     
                                                           
          typedef struct _KWAIT_CHAIN         // 1 elements, 0x4 bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _SINGLE_LIST_ENTRY Head; // 1 elements, 0x4 bytes (sizeof) 
          }KWAIT_CHAIN, *PKWAIT_CHAIN;                                          
                                                                                
          typedef struct _OWNER_ENTRY                        // 6 elements, 0x8 bytes (sizeof) 
          {                                                                                    
/*0x000*/     ULONG32      OwnerThread;                                                        
              union                                          // 2 elements, 0x4 bytes (sizeof) 
              {                                                                                
                  struct                                     // 4 elements, 0x4 bytes (sizeof) 
                  {                                                                            
/*0x004*/             ULONG32      IoPriorityBoosted : 1;    // 0 BitPosition                  
/*0x004*/             ULONG32      OwnerReferenced : 1;      // 1 BitPosition                  
/*0x004*/             ULONG32      IoQoSPriorityBoosted : 1; // 2 BitPosition                  
/*0x004*/             ULONG32      OwnerCount : 29;          // 3 BitPosition                  
                  };                                                                           
/*0x004*/         ULONG32      TableSize;                                                      
              };                                                                               
          }OWNER_ENTRY, *POWNER_ENTRY;                                                         
                                                                                               
          typedef struct _ERESOURCE                   // 16 elements, 0x38 bytes (sizeof) 
          {                                                                               
/*0x000*/     struct _LIST_ENTRY SystemResourcesList; // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     struct _OWNER_ENTRY* OwnerTable;                                            
/*0x00C*/     INT16        ActiveCount;                                                   
              union                                   // 2 elements, 0x2 bytes (sizeof)   
              {                                                                           
/*0x00E*/         UINT16       Flag;                                                      
                  struct                              // 2 elements, 0x2 bytes (sizeof)   
                  {                                                                       
/*0x00E*/             UINT8        ReservedLowFlags;                                      
/*0x00F*/             UINT8        WaiterPriority;                                        
                  };                                                                      
              };                                                                          
/*0x010*/     struct _KWAIT_CHAIN SharedWaiters;      // 1 elements, 0x4 bytes (sizeof)   
/*0x014*/     struct _KEVENT* ExclusiveWaiters;                                           
/*0x018*/     struct _OWNER_ENTRY OwnerEntry;         // 6 elements, 0x8 bytes (sizeof)   
/*0x020*/     ULONG32      ActiveEntries;                                                 
/*0x024*/     ULONG32      ContentionCount;                                               
/*0x028*/     ULONG32      NumberOfSharedWaiters;                                         
/*0x02C*/     ULONG32      NumberOfExclusiveWaiters;                                      
              union                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                           
/*0x030*/         VOID*        Address;                                                   
/*0x030*/         ULONG32      CreatorBackTraceIndex;                                     
              };                                                                          
/*0x034*/     ULONG32      SpinLock;                                                      
          }ERESOURCE, *PERESOURCE;                                                        
                                                                                          
          typedef struct _KAFFINITY_EX // 4 elements, 0xC bytes (sizeof) 
          {                                                              
/*0x000*/     UINT16       Count;                                        
/*0x002*/     UINT16       Size;                                         
/*0x004*/     ULONG32      Reserved;                                     
/*0x008*/     ULONG32      Bitmap[1];                                    
          }KAFFINITY_EX, *PKAFFINITY_EX;                                  
                                                                         
          typedef struct _PROCESS_DISK_COUNTERS // 5 elements, 0x28 bytes (sizeof) 
          {                                                                        
/*0x000*/     UINT64       BytesRead;                                              
/*0x008*/     UINT64       BytesWritten;                                           
/*0x010*/     UINT64       ReadOperationCount;                                     
/*0x018*/     UINT64       WriteOperationCount;                                    
/*0x020*/     UINT64       FlushOperationCount;                                    
          }PROCESS_DISK_COUNTERS, *PPROCESS_DISK_COUNTERS;                                   
                                                                                   
          typedef struct _WNF_STATE_NAME // 1 elements, 0x8 bytes (sizeof) 
          {                                                                
/*0x000*/     ULONG32      Data[2];                                        
          }WNF_STATE_NAME, *PWNF_STATE_NAME;                                  
                                                                           
          typedef struct _PS_WAKE_INFORMATION   // 3 elements, 0x38 bytes (sizeof) 
          {                                                                        
/*0x000*/     UINT64       NotificationChannel;                                    
/*0x008*/     UINT64       WakeCounters[5];                                        
/*0x030*/     UINT64       NoWakeCounter;                                          
          }PS_WAKE_INFORMATION, *PPS_WAKE_INFORMATION;                                   
                                                                                   
          typedef struct _JOBOBJECT_WAKE_FILTER // 2 elements, 0x8 bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      HighEdgeFilter;                                        
/*0x004*/     ULONG32      LowEdgeFilter;                                         
          }JOBOBJECT_WAKE_FILTER, *PJOBOBJECT_WAKE_FILTER;                                  
                                                                                  
          typedef struct _EPROCESS_VALUES       // 11 elements, 0x58 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT64       KernelTime;                                              
/*0x008*/     UINT64       UserTime;                                                
/*0x010*/     UINT64       ReadyTime;                                               
/*0x018*/     UINT64       CycleTime;                                               
/*0x020*/     UINT64       ContextSwitches;                                         
/*0x028*/     INT64        ReadOperationCount;                                      
/*0x030*/     INT64        WriteOperationCount;                                     
/*0x038*/     INT64        OtherOperationCount;                                     
/*0x040*/     INT64        ReadTransferCount;                                       
/*0x048*/     INT64        WriteTransferCount;                                      
/*0x050*/     INT64        OtherTransferCount;                                      
          }EPROCESS_VALUES, *PEPROCESS_VALUES;                                      
                                                                                    
          typedef struct _PS_PROPERTY_SET  // 2 elements, 0xC bytes (sizeof) 
          {                                                                  
/*0x000*/     struct _LIST_ENTRY ListHead; // 2 elements, 0x8 bytes (sizeof) 
/*0x008*/     ULONG32      Lock;                                             
          }PS_PROPERTY_SET, *PPS_PROPERTY_SET;                                  
                                                                             
          typedef struct _RTL_BALANCED_NODE               // 6 elements, 0xC bytes (sizeof) 
          {                                                                                 
              union                                       // 2 elements, 0x8 bytes (sizeof) 
              {                                                                             
/*0x000*/         struct _RTL_BALANCED_NODE* Children[2];                                   
                  struct                                  // 2 elements, 0x8 bytes (sizeof) 
                  {                                                                         
/*0x000*/             struct _RTL_BALANCED_NODE* Left;                                      
/*0x004*/             struct _RTL_BALANCED_NODE* Right;                                     
                  };                                                                        
              };                                                                            
              union                                       // 2 elements, 0x4 bytes (sizeof) 
              {                                                                             
                  struct                                  // 2 elements, 0x1 bytes (sizeof) 
                  {                                                                         
/*0x008*/             UINT8        Red : 1;               // 0 BitPosition                  
/*0x008*/             UINT8        Balance : 2;           // 0 BitPosition                  
                  };                                                                        
/*0x008*/         ULONG32      ParentValue;                                                 
              };                                                                            
          }RTL_BALANCED_NODE, *PRTL_BALANCED_NODE;                                          
                                                                                            
          typedef struct _EX_RUNDOWN_REF // 2 elements, 0x4 bytes (sizeof) 
          {                                                                
              union                      // 2 elements, 0x4 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      Count;                                      
/*0x000*/         VOID*        Ptr;                                        
              };                                                           
          }EX_RUNDOWN_REF, *PEX_RUNDOWN_REF;                                  
                                                                           
          typedef struct _PS_IO_CONTROL_ENTRY               // 7 elements, 0x1C bytes (sizeof) 
          {                                                                                    
              union                                         // 2 elements, 0xC bytes (sizeof)  
              {                                                                                
/*0x000*/         struct _RTL_BALANCED_NODE VolumeTreeNode; // 6 elements, 0xC bytes (sizeof)  
                  struct                                    // 2 elements, 0xC bytes (sizeof)  
                  {                                                                            
/*0x000*/             struct _LIST_ENTRY FreeListEntry;     // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/             ULONG32      ReservedForParentValue;                                     
                  };                                                                           
              };                                                                               
/*0x00C*/     ULONG32      VolumeKey;                                                          
/*0x010*/     struct _EX_RUNDOWN_REF Rundown;               // 2 elements, 0x4 bytes (sizeof)  
/*0x014*/     VOID*        IoControl;                                                          
/*0x018*/     VOID*        VolumeIoAttribution;                                                
          }PS_IO_CONTROL_ENTRY, *PPS_IO_CONTROL_ENTRY;                                         
                                                                                               
          typedef struct _RTL_RB_TREE          // 2 elements, 0x8 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _RTL_BALANCED_NODE* Root;                                   
/*0x004*/     struct _RTL_BALANCED_NODE* Min;                                    
          }RTL_RB_TREE, *PRTL_RB_TREE;                                           
                                                                                 
          typedef struct _WORK_QUEUE_ITEM                                                                                                           // 3 elements, 0x10 bytes (sizeof) 
          {                                                                                                                                                                            
/*0x000*/     struct _LIST_ENTRY List;                                                                                                              // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     FUNCT_00C8_076C_Free_WorkerRoutine_DeleteCallback_InterfaceReference_InterfaceDereference_DeleteProcedure_FreeRoutine* WorkerRoutine;                                    
/*0x00C*/     VOID*        Parameter;                                                                                                                                                  
          }WORK_QUEUE_ITEM, *PWORK_QUEUE_ITEM;                                                                                                                                         
                                                                                                                                                                                       
          typedef struct _EJOB                                            // 144 elements, 0x358 bytes (sizeof) 
          {                                                                                                     
/*0x000*/     struct _KEVENT Event;                                       // 1 elements, 0x10 bytes (sizeof)    
/*0x010*/     struct _LIST_ENTRY JobLinks;                                // 2 elements, 0x8 bytes (sizeof)     
/*0x018*/     struct _LIST_ENTRY ProcessListHead;                         // 2 elements, 0x8 bytes (sizeof)     
/*0x020*/     struct _ERESOURCE JobLock;                                  // 16 elements, 0x38 bytes (sizeof)   
/*0x058*/     union _LARGE_INTEGER TotalUserTime;                         // 4 elements, 0x8 bytes (sizeof)     
/*0x060*/     union _LARGE_INTEGER TotalKernelTime;                       // 4 elements, 0x8 bytes (sizeof)     
/*0x068*/     union _LARGE_INTEGER TotalCycleTime;                        // 4 elements, 0x8 bytes (sizeof)     
/*0x070*/     union _LARGE_INTEGER ThisPeriodTotalUserTime;               // 4 elements, 0x8 bytes (sizeof)     
/*0x078*/     union _LARGE_INTEGER ThisPeriodTotalKernelTime;             // 4 elements, 0x8 bytes (sizeof)     
/*0x080*/     UINT64       TotalContextSwitches;                                                                
/*0x088*/     ULONG32      TotalPageFaultCount;                                                                 
/*0x08C*/     ULONG32      TotalProcesses;                                                                      
/*0x090*/     ULONG32      ActiveProcesses;                                                                     
/*0x094*/     ULONG32      TotalTerminatedProcesses;                                                            
/*0x098*/     union _LARGE_INTEGER PerProcessUserTimeLimit;               // 4 elements, 0x8 bytes (sizeof)     
/*0x0A0*/     union _LARGE_INTEGER PerJobUserTimeLimit;                   // 4 elements, 0x8 bytes (sizeof)     
/*0x0A8*/     ULONG32      MinimumWorkingSetSize;                                                               
/*0x0AC*/     ULONG32      MaximumWorkingSetSize;                                                               
/*0x0B0*/     ULONG32      LimitFlags;                                                                          
/*0x0B4*/     ULONG32      ActiveProcessLimit;                                                                  
/*0x0B8*/     struct _KAFFINITY_EX Affinity;                              // 4 elements, 0xC bytes (sizeof)     
/*0x0C4*/     struct _JOB_ACCESS_STATE* AccessState;                                                            
/*0x0C8*/     VOID*        AccessStateQuotaReference;                                                           
/*0x0CC*/     ULONG32      UIRestrictionsClass;                                                                 
/*0x0D0*/     ULONG32      EndOfJobTimeAction;                                                                  
/*0x0D4*/     VOID*        CompletionPort;                                                                      
/*0x0D8*/     VOID*        CompletionKey;                                                                       
/*0x0DC*/     UINT8        _PADDING0_[0x4];                                                                     
/*0x0E0*/     UINT64       CompletionCount;                                                                     
/*0x0E8*/     ULONG32      SessionId;                                                                           
/*0x0EC*/     ULONG32      SchedulingClass;                                                                     
/*0x0F0*/     UINT64       ReadOperationCount;                                                                  
/*0x0F8*/     UINT64       WriteOperationCount;                                                                 
/*0x100*/     UINT64       OtherOperationCount;                                                                 
/*0x108*/     UINT64       ReadTransferCount;                                                                   
/*0x110*/     UINT64       WriteTransferCount;                                                                  
/*0x118*/     UINT64       OtherTransferCount;                                                                  
/*0x120*/     struct _PROCESS_DISK_COUNTERS DiskIoInfo;                   // 5 elements, 0x28 bytes (sizeof)    
/*0x148*/     ULONG32      ProcessMemoryLimit;                                                                  
/*0x14C*/     ULONG32      JobMemoryLimit;                                                                      
/*0x150*/     ULONG32      JobTotalMemoryLimit;                                                                 
/*0x154*/     ULONG32      PeakProcessMemoryUsed;                                                               
/*0x158*/     ULONG32      PeakJobMemoryUsed;                                                                   
/*0x15C*/     struct _KAFFINITY_EX EffectiveAffinity;                     // 4 elements, 0xC bytes (sizeof)     
/*0x168*/     union _LARGE_INTEGER EffectivePerProcessUserTimeLimit;      // 4 elements, 0x8 bytes (sizeof)     
/*0x170*/     ULONG32      EffectiveMinimumWorkingSetSize;                                                      
/*0x174*/     ULONG32      EffectiveMaximumWorkingSetSize;                                                      
/*0x178*/     ULONG32      EffectiveProcessMemoryLimit;                                                         
/*0x17C*/     struct _EJOB* EffectiveProcessMemoryLimitJob;                                                     
/*0x180*/     struct _EJOB* EffectivePerProcessUserTimeLimitJob;                                                
/*0x184*/     struct _EJOB* EffectiveNetIoRateLimitJob;                                                         
/*0x188*/     struct _EJOB* EffectiveHeapAttributionJob;                                                        
/*0x18C*/     ULONG32      EffectiveLimitFlags;                                                                 
/*0x190*/     ULONG32      EffectiveSchedulingClass;                                                            
/*0x194*/     ULONG32      EffectiveFreezeCount;                                                                
/*0x198*/     ULONG32      EffectiveBackgroundCount;                                                            
/*0x19C*/     ULONG32      EffectiveSwapCount;                                                                  
/*0x1A0*/     ULONG32      EffectiveNotificationLimitCount;                                                     
/*0x1A4*/     UINT8        EffectivePriorityClass;                                                              
/*0x1A5*/     UINT8        PriorityClass;                                                                       
/*0x1A6*/     UINT8        NestingDepth;                                                                        
/*0x1A7*/     UINT8        Reserved1[1];                                                                        
/*0x1A8*/     ULONG32      CompletionFilter;                                                                    
/*0x1AC*/     UINT8        _PADDING1_[0x4];                                                                     
              union                                                       // 2 elements, 0x38 bytes (sizeof)    
              {                                                                                                 
/*0x1B0*/         struct _WNF_STATE_NAME WakeChannel;                     // 1 elements, 0x8 bytes (sizeof)     
/*0x1B0*/         struct _PS_WAKE_INFORMATION WakeInfo;                   // 3 elements, 0x38 bytes (sizeof)    
              };                                                                                                
/*0x1E8*/     struct _JOBOBJECT_WAKE_FILTER WakeFilter;                   // 2 elements, 0x8 bytes (sizeof)     
/*0x1F0*/     ULONG32      LowEdgeLatchFilter;                                                                  
/*0x1F4*/     ULONG32      OwnedHighEdgeFilters;                                                                
/*0x1F8*/     struct _EJOB* NotificationLink;                                                                   
/*0x1FC*/     UINT8        _PADDING2_[0x4];                                                                     
/*0x200*/     UINT64       CurrentJobMemoryUsed;                                                                
/*0x208*/     struct _JOB_NOTIFICATION_INFORMATION* NotificationInfo;                                           
/*0x20C*/     VOID*        NotificationInfoQuotaReference;                                                      
/*0x210*/     struct _IO_MINI_COMPLETION_PACKET_USER* NotificationPacket;                                       
/*0x214*/     struct _JOB_CPU_RATE_CONTROL* CpuRateControl;                                                     
/*0x218*/     VOID*        EffectiveSchedulingGroup;                                                            
/*0x21C*/     UINT8        _PADDING3_[0x4];                                                                     
/*0x220*/     UINT64       ReadyTime;                                                                           
/*0x228*/     struct _EX_PUSH_LOCK MemoryLimitsLock;                      // 7 elements, 0x4 bytes (sizeof)     
/*0x22C*/     struct _LIST_ENTRY SiblingJobLinks;                         // 2 elements, 0x8 bytes (sizeof)     
/*0x234*/     struct _LIST_ENTRY ChildJobListHead;                        // 2 elements, 0x8 bytes (sizeof)     
/*0x23C*/     struct _EJOB* ParentJob;                                                                          
/*0x240*/     struct _EJOB* ParentSilo;                                                                         
/*0x244*/     struct _EJOB* RootJob;                                                                            
/*0x248*/     struct _LIST_ENTRY IteratorListHead;                        // 2 elements, 0x8 bytes (sizeof)     
/*0x250*/     ULONG32      AncestorCount;                                                                       
              union                                                       // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                 
/*0x254*/         struct _EJOB** Ancestors;                                                                     
/*0x254*/         VOID*        SessionObject;                                                                   
              };                                                                                                
/*0x258*/     ULONG32      TimerListLock;                                                                       
/*0x25C*/     struct _LIST_ENTRY TimerListHead;                           // 2 elements, 0x8 bytes (sizeof)     
/*0x264*/     UINT8        _PADDING4_[0x4];                                                                     
/*0x268*/     struct _EPROCESS_VALUES Accounting;                         // 11 elements, 0x58 bytes (sizeof)   
/*0x2C0*/     ULONG32      ShadowActiveProcessCount;                                                            
/*0x2C4*/     ULONG32      ActiveAuxiliaryProcessCount;                                                         
/*0x2C8*/     ULONG32      SequenceNumber;                                                                      
/*0x2CC*/     ULONG32      JobId;                                                                               
/*0x2D0*/     struct _GUID ContainerId;                                   // 4 elements, 0x10 bytes (sizeof)    
/*0x2E0*/     struct _ESERVERSILO_GLOBALS* ServerSiloGlobals;                                                   
/*0x2E4*/     struct _PS_PROPERTY_SET PropertySet;                        // 2 elements, 0xC bytes (sizeof)     
/*0x2F0*/     struct _PSP_STORAGE* Storage;                                                                     
/*0x2F4*/     struct _JOB_NET_RATE_CONTROL* NetRateControl;                                                     
              union                                                       // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                 
/*0x2F8*/         ULONG32      JobFlags;                                                                        
                  struct                                                  // 32 elements, 0x4 bytes (sizeof)    
                  {                                                                                             
/*0x2F8*/             ULONG32      CloseDone : 1;                         // 0 BitPosition                      
/*0x2F8*/             ULONG32      MultiGroup : 1;                        // 1 BitPosition                      
/*0x2F8*/             ULONG32      OutstandingNotification : 1;           // 2 BitPosition                      
/*0x2F8*/             ULONG32      NotificationInProgress : 1;            // 3 BitPosition                      
/*0x2F8*/             ULONG32      UILimits : 1;                          // 4 BitPosition                      
/*0x2F8*/             ULONG32      CpuRateControlActive : 1;              // 5 BitPosition                      
/*0x2F8*/             ULONG32      OwnCpuRateControl : 1;                 // 6 BitPosition                      
/*0x2F8*/             ULONG32      Terminating : 1;                       // 7 BitPosition                      
/*0x2F8*/             ULONG32      WorkingSetLock : 1;                    // 8 BitPosition                      
/*0x2F8*/             ULONG32      JobFrozen : 1;                         // 9 BitPosition                      
/*0x2F8*/             ULONG32      Background : 1;                        // 10 BitPosition                     
/*0x2F8*/             ULONG32      WakeNotificationAllocated : 1;         // 11 BitPosition                     
/*0x2F8*/             ULONG32      WakeNotificationEnabled : 1;           // 12 BitPosition                     
/*0x2F8*/             ULONG32      WakeNotificationPending : 1;           // 13 BitPosition                     
/*0x2F8*/             ULONG32      LimitNotificationRequired : 1;         // 14 BitPosition                     
/*0x2F8*/             ULONG32      ZeroCountNotificationRequired : 1;     // 15 BitPosition                     
/*0x2F8*/             ULONG32      CycleTimeNotificationRequired : 1;     // 16 BitPosition                     
/*0x2F8*/             ULONG32      CycleTimeNotificationPending : 1;      // 17 BitPosition                     
/*0x2F8*/             ULONG32      TimersVirtualized : 1;                 // 18 BitPosition                     
/*0x2F8*/             ULONG32      JobSwapped : 1;                        // 19 BitPosition                     
/*0x2F8*/             ULONG32      ViolationDetected : 1;                 // 20 BitPosition                     
/*0x2F8*/             ULONG32      EmptyJobNotified : 1;                  // 21 BitPosition                     
/*0x2F8*/             ULONG32      NoSystemCharge : 1;                    // 22 BitPosition                     
/*0x2F8*/             ULONG32      DropNoWakeCharges : 1;                 // 23 BitPosition                     
/*0x2F8*/             ULONG32      NoWakeChargePolicyDecided : 1;         // 24 BitPosition                     
/*0x2F8*/             ULONG32      NetRateControlActive : 1;              // 25 BitPosition                     
/*0x2F8*/             ULONG32      OwnNetRateControl : 1;                 // 26 BitPosition                     
/*0x2F8*/             ULONG32      IoRateControlActive : 1;               // 27 BitPosition                     
/*0x2F8*/             ULONG32      OwnIoRateControl : 1;                  // 28 BitPosition                     
/*0x2F8*/             ULONG32      DisallowNewProcesses : 1;              // 29 BitPosition                     
/*0x2F8*/             ULONG32      Silo : 1;                              // 30 BitPosition                     
/*0x2F8*/             ULONG32      Spare : 1;                             // 31 BitPosition                     
                  };                                                                                            
              };                                                                                                
/*0x2FC*/     ULONG32      EffectiveHighEdgeFilters;                                                            
/*0x300*/     struct _PROCESS_ENERGY_VALUES* EnergyValues;                                                      
/*0x304*/     ULONG32      SharedCommitCharge;                                                                  
/*0x308*/     struct _EJOB* WakeRoot;                                                                           
/*0x30C*/     ULONG32      DiskIoAttributionUserRefCount;                                                       
/*0x310*/     ULONG32      DiskIoAttributionRefCount;                                                           
              union                                                       // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                 
/*0x314*/         VOID*        DiskIoAttributionContext;                                                        
/*0x314*/         struct _EJOB* DiskIoAttributionOwnerJob;                                                      
              };                                                                                                
/*0x318*/     struct _PS_IO_CONTROL_ENTRY GlobalIoControl;                // 7 elements, 0x1C bytes (sizeof)    
/*0x334*/     LONG32       VolumeIoControlLock;                                                                 
/*0x338*/     struct _RTL_RB_TREE VolumeIoControlTree;                    // 2 elements, 0x8 bytes (sizeof)     
/*0x340*/     struct _EX_PUSH_LOCK IoControlLock;                         // 7 elements, 0x4 bytes (sizeof)     
/*0x344*/     ULONG32      SiloHardReferenceCount;                                                              
/*0x348*/     struct _WORK_QUEUE_ITEM RundownWorkItem;                    // 3 elements, 0x10 bytes (sizeof)    
          }EJOB, *PEJOB;                                                                                        
                                                                                                                
          typedef struct _GROUP_AFFINITY // 3 elements, 0xC bytes (sizeof) 
          {                                                                
/*0x000*/     ULONG32      Mask;                                           
/*0x004*/     UINT16       Group;                                          
/*0x006*/     UINT16       Reserved[3];                                    
          }GROUP_AFFINITY, *PGROUP_AFFINITY;                                  
                                                                           
          typedef struct _flags                      // 5 elements, 0x1 bytes (sizeof) 
          {                                                                            
/*0x000*/     UINT8        Removable : 1;            // 0 BitPosition                  
/*0x000*/     UINT8        GroupAssigned : 1;        // 1 BitPosition                  
/*0x000*/     UINT8        GroupCommitted : 1;       // 2 BitPosition                  
/*0x000*/     UINT8        GroupAssignmentFixed : 1; // 3 BitPosition                  
/*0x000*/     UINT8        Fill : 4;                 // 4 BitPosition                  
          }flags, *Pflags;                                                             
                                                                                       
          typedef struct _KHETERO_PROCESSOR_SET // 3 elements, 0xC bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      IdealMask;                                             
/*0x004*/     ULONG32      PreferredMask;                                         
/*0x008*/     ULONG32      AvailableMask;                                         
          }KHETERO_PROCESSOR_SET, *PKHETERO_PROCESSOR_SET;                                  
                                                                                  
          typedef struct _KNODE                            // 23 elements, 0x100 bytes (sizeof) 
          {                                                                                     
/*0x000*/     ULONG32      IdleNonParkedCpuSet;                                                 
/*0x004*/     ULONG32      IdleSmtSet;                                                          
/*0x008*/     ULONG32      IdleCpuSet;                                                          
/*0x00C*/     UINT8        _PADDING0_[0x34];                                                    
/*0x040*/     ULONG32      DeepIdleSet;                                                         
/*0x044*/     ULONG32      IdleConstrainedSet;                                                  
/*0x048*/     ULONG32      NonParkedSet;                                                        
/*0x04C*/     LONG32       ParkLock;                                                            
/*0x050*/     ULONG32      Seed;                                                                
/*0x054*/     UINT8        _PADDING1_[0x2C];                                                    
/*0x080*/     ULONG32      SiblingMask;                                                         
              union                                        // 2 elements, 0xC bytes (sizeof)    
              {                                                                                 
/*0x084*/         struct _GROUP_AFFINITY Affinity;         // 3 elements, 0xC bytes (sizeof)    
                  struct                                   // 5 elements, 0xC bytes (sizeof)    
                  {                                                                             
/*0x084*/             UINT8        AffinityFill[6];                                             
/*0x08A*/             UINT16       NodeNumber;                                                  
/*0x08C*/             UINT16       PrimaryNodeNumber;                                           
/*0x08E*/             UINT8        Stride;                                                      
/*0x08F*/             UINT8        Spare0;                                                      
                  };                                                                            
              };                                                                                
/*0x090*/     ULONG32      SharedReadyQueueLeaders;                                             
/*0x094*/     ULONG32      ProximityId;                                                         
/*0x098*/     ULONG32      Lowest;                                                              
/*0x09C*/     ULONG32      Highest;                                                             
/*0x0A0*/     UINT8        MaximumProcessors;                                                   
/*0x0A1*/     struct _flags Flags;                         // 5 elements, 0x1 bytes (sizeof)    
/*0x0A2*/     UINT8        Spare10;                                                             
/*0x0A3*/     UINT8        _PADDING2_[0x1];                                                     
/*0x0A4*/     struct _KHETERO_PROCESSOR_SET HeteroSets[5];                                      
/*0x0E0*/     UINT8        _PADDING3_[0x20];                                                    
          }KNODE, *PKNODE;                                                                      
                                                                                                
          typedef struct _KPRIQUEUE                 // 5 elements, 0x19C bytes (sizeof) 
          {                                                                             
/*0x000*/     struct _DISPATCHER_HEADER Header;     // 53 elements, 0x10 bytes (sizeof) 
/*0x010*/     struct _LIST_ENTRY EntryListHead[32];                                     
/*0x110*/     LONG32       CurrentCount[32];                                            
/*0x190*/     ULONG32      MaximumCount;                                                
/*0x194*/     struct _LIST_ENTRY ThreadListHead;    // 2 elements, 0x8 bytes (sizeof)   
          }KPRIQUEUE, *PKPRIQUEUE;                                                      
                                                                                        
          typedef struct _EX_WORK_QUEUE                    // 9 elements, 0x1B8 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _KPRIQUEUE WorkPriQueue;              // 5 elements, 0x19C bytes (sizeof) 
/*0x19C*/     struct _ENODE* Node;                                                             
/*0x1A0*/     ULONG32      WorkItemsProcessed;                                                 
/*0x1A4*/     ULONG32      WorkItemsProcessedLastPass;                                         
/*0x1A8*/     LONG32       ThreadCount;                                                        
/*0x1AC*/     LONG32       MinThreads : 31;                // 0 BitPosition                    
/*0x1B0*/     UINT8        _PADDING0_[0xFFFFFFFFFFFFFFFC];                                     
/*0x1AC*/     ULONG32      TryFailed : 1;                  // 31 BitPosition                   
/*0x1B0*/     LONG32       MaxThreads;                                                         
/*0x1B4*/     enum _EXQUEUEINDEX QueueIndex;                                                   
          }EX_WORK_QUEUE, *PEX_WORK_QUEUE;                                                     
                                                                                               
          typedef union _ULARGE_INTEGER  // 4 elements, 0x8 bytes (sizeof) 
          {                                                                
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         ULONG32      HighPart;                                   
              };                                                           
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         ULONG32      HighPart;                                   
              }u;                                                          
/*0x000*/     UINT64       QuadPart;                                       
          }ULARGE_INTEGER, *PULARGE_INTEGER;                                  
                                                                           
          typedef struct _KTIMER                 // 5 elements, 0x28 bytes (sizeof)  
          {                                                                          
/*0x000*/     struct _DISPATCHER_HEADER Header;  // 53 elements, 0x10 bytes (sizeof) 
/*0x010*/     union _ULARGE_INTEGER DueTime;     // 4 elements, 0x8 bytes (sizeof)   
/*0x018*/     struct _LIST_ENTRY TimerListEntry; // 2 elements, 0x8 bytes (sizeof)   
/*0x020*/     struct _KDPC* Dpc;                                                     
/*0x024*/     ULONG32      Period;                                                   
          }KTIMER, *PKTIMER;                                                         
                                                                                     
          typedef struct _KWAIT_BLOCK                // 8 elements, 0x18 bytes (sizeof) 
          {                                                                             
/*0x000*/     struct _LIST_ENTRY WaitListEntry;      // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     UINT8        WaitType;                                                    
/*0x009*/     UINT8        BlockState;                                                  
/*0x00A*/     UINT16       WaitKey;                                                     
              union                                  // 2 elements, 0x4 bytes (sizeof)  
              {                                                                         
/*0x00C*/         struct _KTHREAD* Thread;                                              
/*0x00C*/         struct _KQUEUE* NotificationQueue;                                    
              };                                                                        
/*0x010*/     VOID*        Object;                                                      
/*0x014*/     VOID*        SparePtr;                                                    
          }KWAIT_BLOCK, *PKWAIT_BLOCK;                                                  
                                                                                        
          typedef struct _ENODE                                  // 13 elements, 0x540 bytes (sizeof) 
          {                                                                                           
/*0x000*/     struct _KNODE Ncb;                                 // 23 elements, 0x100 bytes (sizeof) 
/*0x100*/     struct _EX_WORK_QUEUE* ExWorkQueues[8];                                                 
/*0x120*/     struct _EX_WORK_QUEUE ExWorkQueue;                 // 9 elements, 0x1B8 bytes (sizeof)  
/*0x2D8*/     struct _EX_WORK_QUEUE IoWorkQueue;                 // 9 elements, 0x1B8 bytes (sizeof)  
/*0x490*/     struct _KEVENT ExpThreadSetManagerEvent;           // 1 elements, 0x10 bytes (sizeof)   
/*0x4A0*/     struct _KTIMER ExpDeadlockTimer;                   // 5 elements, 0x28 bytes (sizeof)   
/*0x4C8*/     struct _KEVENT ExpThreadReaperEvent;               // 1 elements, 0x10 bytes (sizeof)   
/*0x4D8*/     struct _KWAIT_BLOCK WaitBlocks[3];                                                      
/*0x520*/     struct _ETHREAD* ExpWorkerThreadBalanceManagerPtr;                                      
/*0x524*/     ULONG32      ExpWorkerSeed;                                                             
              union                                              // 2 elements, 0x18 bytes (sizeof)   
              {                                                                                       
                  struct                                         // 2 elements, 0x4 bytes (sizeof)    
                  {                                                                                   
/*0x528*/             ULONG32      ExWorkerFullInit : 1;         // 0 BitPosition                     
/*0x528*/             ULONG32      ExWorkerStructInit : 1;       // 1 BitPosition                     
                  };                                                                                  
/*0x528*/         ULONG32      ExWorkerFlags;                                                         
              };                                                                                      
          }ENODE, *PENODE;                                                                            
                                                                                                      
          typedef struct _KGDTENTRY                 // 3 elements, 0x8 bytes (sizeof)  
          {                                                                            
/*0x000*/     UINT16       LimitLow;                                                   
/*0x002*/     UINT16       BaseLow;                                                    
              union                                 // 2 elements, 0x4 bytes (sizeof)  
              {                                                                        
                  struct                            // 4 elements, 0x4 bytes (sizeof)  
                  {                                                                    
/*0x004*/             UINT8        BaseMid;                                            
/*0x005*/             UINT8        Flags1;                                             
/*0x006*/             UINT8        Flags2;                                             
/*0x007*/             UINT8        BaseHi;                                             
                  }Bytes;                                                              
                  struct                            // 10 elements, 0x4 bytes (sizeof) 
                  {                                                                    
/*0x004*/             ULONG32      BaseMid : 8;     // 0 BitPosition                   
/*0x004*/             ULONG32      Type : 5;        // 8 BitPosition                   
/*0x004*/             ULONG32      Dpl : 2;         // 13 BitPosition                  
/*0x004*/             ULONG32      Pres : 1;        // 15 BitPosition                  
/*0x004*/             ULONG32      LimitHi : 4;     // 16 BitPosition                  
/*0x004*/             ULONG32      Sys : 1;         // 20 BitPosition                  
/*0x004*/             ULONG32      Reserved_0 : 1;  // 21 BitPosition                  
/*0x004*/             ULONG32      Default_Big : 1; // 22 BitPosition                  
/*0x004*/             ULONG32      Granularity : 1; // 23 BitPosition                  
/*0x004*/             ULONG32      BaseHi : 8;      // 24 BitPosition                  
                  }Bits;                                                               
              }HighWord;                                                               
          }KGDTENTRY, *PKGDTENTRY;                                                     
                                                                                       
          typedef struct _KIDTENTRY        // 4 elements, 0x8 bytes (sizeof) 
          {                                                                  
/*0x000*/     UINT16       Offset;                                           
/*0x002*/     UINT16       Selector;                                         
/*0x004*/     UINT16       Access;                                           
/*0x006*/     UINT16       ExtendedOffset;                                   
          }KIDTENTRY, *PKIDTENTRY;                                           
                                                                             
          typedef union _KEXECUTE_OPTIONS                           // 10 elements, 0x1 bytes (sizeof) 
          {                                                                                            
              struct                                                // 8 elements, 0x1 bytes (sizeof)  
              {                                                                                        
/*0x000*/         UINT8        ExecuteDisable : 1;                  // 0 BitPosition                   
/*0x000*/         UINT8        ExecuteEnable : 1;                   // 1 BitPosition                   
/*0x000*/         UINT8        DisableThunkEmulation : 1;           // 2 BitPosition                   
/*0x000*/         UINT8        Permanent : 1;                       // 3 BitPosition                   
/*0x000*/         UINT8        ExecuteDispatchEnable : 1;           // 4 BitPosition                   
/*0x000*/         UINT8        ImageDispatchEnable : 1;             // 5 BitPosition                   
/*0x000*/         UINT8        DisableExceptionChainValidation : 1; // 6 BitPosition                   
/*0x000*/         UINT8        Spare : 1;                           // 7 BitPosition                   
              };                                                                                       
/*0x000*/     UINT8        ExecuteOptions;                                                             
/*0x000*/     UINT8        ExecuteOptionsNV;                                                           
          }KEXECUTE_OPTIONS, *PKEXECUTE_OPTIONS;                                                       
                                                                                                       
          typedef union _KSTACK_COUNT           // 3 elements, 0x4 bytes (sizeof) 
          {                                                                       
/*0x000*/     LONG32       Value;                                                 
              struct                            // 2 elements, 0x4 bytes (sizeof) 
              {                                                                   
/*0x000*/         ULONG32      State : 3;       // 0 BitPosition                  
/*0x000*/         ULONG32      StackCount : 29; // 3 BitPosition                  
              };                                                                  
          }KSTACK_COUNT, *PKSTACK_COUNT;                                          
                                                                                  
          typedef struct _KPROCESS                          // 40 elements, 0xA8 bytes (sizeof) 
          {                                                                                     
/*0x000*/     struct _DISPATCHER_HEADER Header;             // 53 elements, 0x10 bytes (sizeof) 
/*0x010*/     struct _LIST_ENTRY ProfileListHead;           // 2 elements, 0x8 bytes (sizeof)   
/*0x018*/     ULONG32      DirectoryTableBase;                                                  
/*0x01C*/     struct _KGDTENTRY LdtDescriptor;              // 3 elements, 0x8 bytes (sizeof)   
/*0x024*/     struct _KIDTENTRY Int21Descriptor;            // 4 elements, 0x8 bytes (sizeof)   
/*0x02C*/     struct _LIST_ENTRY ThreadListHead;            // 2 elements, 0x8 bytes (sizeof)   
/*0x034*/     ULONG32      ProcessLock;                                                         
/*0x038*/     UINT64       DeepFreezeStartTime;                                                 
/*0x040*/     struct _KAFFINITY_EX Affinity;                // 4 elements, 0xC bytes (sizeof)   
/*0x04C*/     struct _LIST_ENTRY ReadyListHead;             // 2 elements, 0x8 bytes (sizeof)   
/*0x054*/     struct _SINGLE_LIST_ENTRY SwapListEntry;      // 1 elements, 0x4 bytes (sizeof)   
/*0x058*/     struct _KAFFINITY_EX ActiveProcessors;        // 4 elements, 0xC bytes (sizeof)   
              union                                         // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                 
                  struct                                    // 9 elements, 0x4 bytes (sizeof)   
                  {                                                                             
/*0x064*/             LONG32       AutoAlignment : 1;       // 0 BitPosition                    
/*0x064*/             LONG32       DisableBoost : 1;        // 1 BitPosition                    
/*0x064*/             LONG32       DisableQuantum : 1;      // 2 BitPosition                    
/*0x064*/             ULONG32      DeepFreeze : 1;          // 3 BitPosition                    
/*0x064*/             ULONG32      TimerVirtualization : 1; // 4 BitPosition                    
/*0x064*/             ULONG32      CheckStackExtents : 1;   // 5 BitPosition                    
/*0x064*/             ULONG32      SpareFlags0 : 2;         // 6 BitPosition                    
/*0x064*/             ULONG32      ActiveGroupsMask : 1;    // 8 BitPosition                    
/*0x064*/             LONG32       ReservedFlags : 23;      // 9 BitPosition                    
                  };                                                                            
/*0x064*/         LONG32       ProcessFlags;                                                    
              };                                                                                
/*0x068*/     CHAR         BasePriority;                                                        
/*0x069*/     CHAR         QuantumReset;                                                        
/*0x06A*/     UINT8        Visited;                                                             
/*0x06B*/     union _KEXECUTE_OPTIONS Flags;                // 10 elements, 0x1 bytes (sizeof)  
/*0x06C*/     ULONG32      ThreadSeed[1];                                                       
/*0x070*/     UINT16       IdealNode[1];                                                        
/*0x072*/     UINT16       IdealGlobalNode;                                                     
/*0x074*/     UINT16       Spare1;                                                              
/*0x076*/     UINT16       IopmOffset;                                                          
/*0x078*/     struct _KSCHEDULING_GROUP* SchedulingGroup;                                       
/*0x07C*/     union _KSTACK_COUNT StackCount;               // 3 elements, 0x4 bytes (sizeof)   
/*0x080*/     struct _LIST_ENTRY ProcessListEntry;          // 2 elements, 0x8 bytes (sizeof)   
/*0x088*/     UINT64       CycleTime;                                                           
/*0x090*/     UINT64       ContextSwitches;                                                     
/*0x098*/     ULONG32      FreezeCount;                                                         
/*0x09C*/     ULONG32      KernelTime;                                                          
/*0x0A0*/     ULONG32      UserTime;                                                            
/*0x0A4*/     VOID*        VdmTrapcHandler;                                                     
          }KPROCESS, *PKPROCESS;                                                                
                                                                                                
          typedef struct _EX_FAST_REF      // 3 elements, 0x4 bytes (sizeof) 
          {                                                                  
              union                        // 3 elements, 0x4 bytes (sizeof) 
              {                                                              
/*0x000*/         VOID*        Object;                                       
/*0x000*/         ULONG32      RefCnt : 3; // 0 BitPosition                  
/*0x000*/         ULONG32      Value;                                        
              };                                                             
          }EX_FAST_REF, *PEX_FAST_REF;                                       
                                                                             
          typedef struct _RTL_AVL_TREE         // 1 elements, 0x4 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _RTL_BALANCED_NODE* Root;                                   
          }RTL_AVL_TREE, *PRTL_AVL_TREE;                                         
                                                                                 
          typedef struct _SE_AUDIT_PROCESS_CREATION_INFO      // 1 elements, 0x4 bytes (sizeof) 
          {                                                                                     
/*0x000*/     struct _OBJECT_NAME_INFORMATION* ImageFileName;                                   
          }SE_AUDIT_PROCESS_CREATION_INFO, *PSE_AUDIT_PROCESS_CREATION_INFO;                                  
                                                                                                
          typedef struct _MMSUPPORT_FLAGS                         // 18 elements, 0x4 bytes (sizeof) 
          {                                                                                          
              union                                               // 2 elements, 0x2 bytes (sizeof)  
              {                                                                                      
                  struct                                          // 2 elements, 0x2 bytes (sizeof)  
                  {                                                                                  
                      struct                                      // 4 elements, 0x1 bytes (sizeof)  
                      {                                                                              
/*0x000*/                 UINT8        WorkingSetType : 3;        // 0 BitPosition                   
/*0x000*/                 UINT8        Reserved0 : 3;             // 3 BitPosition                   
/*0x000*/                 UINT8        MaximumWorkingSetHard : 1; // 6 BitPosition                   
/*0x000*/                 UINT8        MinimumWorkingSetHard : 1; // 7 BitPosition                   
                      };                                                                             
                      struct                                      // 4 elements, 0x1 bytes (sizeof)  
                      {                                                                              
/*0x001*/                 UINT8        SessionMaster : 1;         // 0 BitPosition                   
/*0x001*/                 UINT8        TrimmerState : 2;          // 1 BitPosition                   
/*0x001*/                 UINT8        Reserved : 1;              // 3 BitPosition                   
/*0x001*/                 UINT8        PageStealers : 4;          // 4 BitPosition                   
                      };                                                                             
                  };                                                                                 
/*0x000*/         UINT16       u1;                                                                   
              };                                                                                     
/*0x002*/     UINT8        MemoryPriority;                                                           
              union                                               // 2 elements, 0x1 bytes (sizeof)  
              {                                                                                      
                  struct                                          // 7 elements, 0x1 bytes (sizeof)  
                  {                                                                                  
/*0x003*/             UINT8        WsleDeleted : 1;               // 0 BitPosition                   
/*0x003*/             UINT8        VmExiting : 1;                 // 1 BitPosition                   
/*0x003*/             UINT8        ExpansionFailed : 1;           // 2 BitPosition                   
/*0x003*/             UINT8        SvmEnabled : 1;                // 3 BitPosition                   
/*0x003*/             UINT8        ForceAge : 1;                  // 4 BitPosition                   
/*0x003*/             UINT8        NewMaximum : 1;                // 5 BitPosition                   
/*0x003*/             UINT8        CommitReleaseState : 2;        // 6 BitPosition                   
                  };                                                                                 
/*0x003*/         UINT8        u2;                                                                   
              };                                                                                     
          }MMSUPPORT_FLAGS, *PMMSUPPORT_FLAGS;                                                       
                                                                                                     
          typedef struct _MMSUPPORT_INSTANCE               // 19 elements, 0x64 bytes (sizeof) 
          {                                                                                    
/*0x000*/     UINT16       NextPageColor;                                                      
/*0x002*/     UINT16       LastTrimStamp;                                                      
/*0x004*/     ULONG32      PageFaultCount;                                                     
/*0x008*/     ULONG32      TrimmedPageCount;                                                   
/*0x00C*/     struct _MMWSL_INSTANCE* VmWorkingSetList;                                        
/*0x010*/     struct _LIST_ENTRY WorkingSetExpansionLinks; // 2 elements, 0x8 bytes (sizeof)   
/*0x018*/     ULONG32      AgeDistribution[7];                                                 
/*0x034*/     struct _KGATE* ExitOutswapGate;                                                  
/*0x038*/     ULONG32      MinimumWorkingSetSize;                                              
/*0x03C*/     ULONG32      WorkingSetLeafSize;                                                 
/*0x040*/     ULONG32      WorkingSetLeafPrivateSize;                                          
/*0x044*/     ULONG32      WorkingSetSize;                                                     
/*0x048*/     ULONG32      WorkingSetPrivateSize;                                              
/*0x04C*/     ULONG32      MaximumWorkingSetSize;                                              
/*0x050*/     ULONG32      PeakWorkingSetSize;                                                 
/*0x054*/     ULONG32      HardFaultCount;                                                     
              union                                        // 1 elements, 0x4 bytes (sizeof)   
              {                                                                                
/*0x058*/         VOID*        InstancedWorkingSet;                                            
              }u1;                                                                             
/*0x05C*/     ULONG32      Reserved0;                                                          
/*0x060*/     struct _MMSUPPORT_FLAGS Flags;               // 18 elements, 0x4 bytes (sizeof)  
          }MMSUPPORT_INSTANCE, *PMMSUPPORT_INSTANCE;                                           
                                                                                               
          typedef struct _MMSUPPORT_SHARED            // 9 elements, 0x24 bytes (sizeof) 
          {                                                                              
/*0x000*/     LONG32       WorkingSetLock;                                               
/*0x004*/     ULONG32      ReleasedCommitDebt;                                           
/*0x008*/     ULONG32      ResetPagesRepurposedCount;                                    
/*0x00C*/     VOID*        WsSwapSupport;                                                
/*0x010*/     VOID*        CommitReleaseContext;                                         
/*0x014*/     VOID*        AccessLog;                                                    
/*0x018*/     ULONG32      ChargedWslePages;                                             
/*0x01C*/     ULONG32      ActualWslePages;                                              
/*0x020*/     ULONG32      WorkingSetSizeOverhead;                                       
          }MMSUPPORT_SHARED, *PMMSUPPORT_SHARED;                                         
                                                                                         
          typedef struct _MMSUPPORT_FULL           // 2 elements, 0x88 bytes (sizeof)  
          {                                                                            
/*0x000*/     struct _MMSUPPORT_INSTANCE Instance; // 19 elements, 0x64 bytes (sizeof) 
/*0x064*/     struct _MMSUPPORT_SHARED Shared;     // 9 elements, 0x24 bytes (sizeof)  
          }MMSUPPORT_FULL, *PMMSUPPORT_FULL;                                           
                                                                                       
          typedef struct _PS_PROTECTION        // 4 elements, 0x1 bytes (sizeof) 
          {                                                                      
              union                            // 2 elements, 0x1 bytes (sizeof) 
              {                                                                  
/*0x000*/         UINT8        Level;                                            
                  struct                       // 3 elements, 0x1 bytes (sizeof) 
                  {                                                              
/*0x000*/             UINT8        Type : 3;   // 0 BitPosition                  
/*0x000*/             UINT8        Audit : 1;  // 3 BitPosition                  
/*0x000*/             UINT8        Signer : 4; // 4 BitPosition                  
                  };                                                             
              };                                                                 
          }PS_PROTECTION, *PPS_PROTECTION;                                       
                                                                                 
          typedef struct _EPROCESS                                               // 206 elements, 0x388 bytes (sizeof) 
          {                                                                                                            
/*0x000*/     struct _KPROCESS Pcb;                                              // 40 elements, 0xA8 bytes (sizeof)   
/*0x0A8*/     struct _EX_PUSH_LOCK ProcessLock;                                  // 7 elements, 0x4 bytes (sizeof)     
/*0x0AC*/     struct _EX_RUNDOWN_REF RundownProtect;                             // 2 elements, 0x4 bytes (sizeof)     
/*0x0B0*/     VOID*        VdmObjects;                                                                                 
/*0x0B4*/     VOID*        UniqueProcessId;                                                                            
/*0x0B8*/     struct _LIST_ENTRY ActiveProcessLinks;                             // 2 elements, 0x8 bytes (sizeof)     
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x0C0*/         ULONG32      Flags2;                                                                                 
                  struct                                                         // 28 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x0C0*/             ULONG32      JobNotReallyActive : 1;                       // 0 BitPosition                      
/*0x0C0*/             ULONG32      AccountingFolded : 1;                         // 1 BitPosition                      
/*0x0C0*/             ULONG32      NewProcessReported : 1;                       // 2 BitPosition                      
/*0x0C0*/             ULONG32      ExitProcessReported : 1;                      // 3 BitPosition                      
/*0x0C0*/             ULONG32      ReportCommitChanges : 1;                      // 4 BitPosition                      
/*0x0C0*/             ULONG32      LastReportMemory : 1;                         // 5 BitPosition                      
/*0x0C0*/             ULONG32      ForceWakeCharge : 1;                          // 6 BitPosition                      
/*0x0C0*/             ULONG32      CrossSessionCreate : 1;                       // 7 BitPosition                      
/*0x0C0*/             ULONG32      NeedsHandleRundown : 1;                       // 8 BitPosition                      
/*0x0C0*/             ULONG32      RefTraceEnabled : 1;                          // 9 BitPosition                      
/*0x0C0*/             ULONG32      DisableDynamicCode : 1;                       // 10 BitPosition                     
/*0x0C0*/             ULONG32      EmptyJobEvaluated : 1;                        // 11 BitPosition                     
/*0x0C0*/             ULONG32      DefaultPagePriority : 3;                      // 12 BitPosition                     
/*0x0C0*/             ULONG32      PrimaryTokenFrozen : 1;                       // 15 BitPosition                     
/*0x0C0*/             ULONG32      ProcessVerifierTarget : 1;                    // 16 BitPosition                     
/*0x0C0*/             ULONG32      StackRandomizationDisabled : 1;               // 17 BitPosition                     
/*0x0C0*/             ULONG32      AffinityPermanent : 1;                        // 18 BitPosition                     
/*0x0C0*/             ULONG32      AffinityUpdateEnable : 1;                     // 19 BitPosition                     
/*0x0C0*/             ULONG32      PropagateNode : 1;                            // 20 BitPosition                     
/*0x0C0*/             ULONG32      ExplicitAffinity : 1;                         // 21 BitPosition                     
/*0x0C0*/             ULONG32      ProcessExecutionState : 2;                    // 22 BitPosition                     
/*0x0C0*/             ULONG32      DisallowStrippedImages : 1;                   // 24 BitPosition                     
/*0x0C0*/             ULONG32      HighEntropyASLREnabled : 1;                   // 25 BitPosition                     
/*0x0C0*/             ULONG32      ExtensionPointDisable : 1;                    // 26 BitPosition                     
/*0x0C0*/             ULONG32      ForceRelocateImages : 1;                      // 27 BitPosition                     
/*0x0C0*/             ULONG32      ProcessStateChangeRequest : 2;                // 28 BitPosition                     
/*0x0C0*/             ULONG32      ProcessStateChangeInProgress : 1;             // 30 BitPosition                     
/*0x0C0*/             ULONG32      DisallowWin32kSystemCalls : 1;                // 31 BitPosition                     
                  };                                                                                                   
              };                                                                                                       
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x0C4*/         ULONG32      Flags;                                                                                  
                  struct                                                         // 29 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x0C4*/             ULONG32      CreateReported : 1;                           // 0 BitPosition                      
/*0x0C4*/             ULONG32      NoDebugInherit : 1;                           // 1 BitPosition                      
/*0x0C4*/             ULONG32      ProcessExiting : 1;                           // 2 BitPosition                      
/*0x0C4*/             ULONG32      ProcessDelete : 1;                            // 3 BitPosition                      
/*0x0C4*/             ULONG32      ControlFlowGuardEnabled : 1;                  // 4 BitPosition                      
/*0x0C4*/             ULONG32      VmDeleted : 1;                                // 5 BitPosition                      
/*0x0C4*/             ULONG32      OutswapEnabled : 1;                           // 6 BitPosition                      
/*0x0C4*/             ULONG32      Outswapped : 1;                               // 7 BitPosition                      
/*0x0C4*/             ULONG32      FailFastOnCommitFail : 1;                     // 8 BitPosition                      
/*0x0C4*/             ULONG32      Wow64VaSpace4Gb : 1;                          // 9 BitPosition                      
/*0x0C4*/             ULONG32      AddressSpaceInitialized : 2;                  // 10 BitPosition                     
/*0x0C4*/             ULONG32      SetTimerResolution : 1;                       // 12 BitPosition                     
/*0x0C4*/             ULONG32      BreakOnTermination : 1;                       // 13 BitPosition                     
/*0x0C4*/             ULONG32      DeprioritizeViews : 1;                        // 14 BitPosition                     
/*0x0C4*/             ULONG32      WriteWatch : 1;                               // 15 BitPosition                     
/*0x0C4*/             ULONG32      ProcessInSession : 1;                         // 16 BitPosition                     
/*0x0C4*/             ULONG32      OverrideAddressSpace : 1;                     // 17 BitPosition                     
/*0x0C4*/             ULONG32      HasAddressSpace : 1;                          // 18 BitPosition                     
/*0x0C4*/             ULONG32      LaunchPrefetched : 1;                         // 19 BitPosition                     
/*0x0C4*/             ULONG32      Background : 1;                               // 20 BitPosition                     
/*0x0C4*/             ULONG32      VmTopDown : 1;                                // 21 BitPosition                     
/*0x0C4*/             ULONG32      ImageNotifyDone : 1;                          // 22 BitPosition                     
/*0x0C4*/             ULONG32      PdeUpdateNeeded : 1;                          // 23 BitPosition                     
/*0x0C4*/             ULONG32      VdmAllowed : 1;                               // 24 BitPosition                     
/*0x0C4*/             ULONG32      ProcessRundown : 1;                           // 25 BitPosition                     
/*0x0C4*/             ULONG32      ProcessInserted : 1;                          // 26 BitPosition                     
/*0x0C4*/             ULONG32      DefaultIoPriority : 3;                        // 27 BitPosition                     
/*0x0C4*/             ULONG32      ProcessSelfDelete : 1;                        // 30 BitPosition                     
/*0x0C4*/             ULONG32      SetTimerResolutionLink : 1;                   // 31 BitPosition                     
                  };                                                                                                   
              };                                                                                                       
/*0x0C8*/     union _LARGE_INTEGER CreateTime;                                   // 4 elements, 0x8 bytes (sizeof)     
/*0x0D0*/     ULONG32      ProcessQuotaUsage[2];                                                                       
/*0x0D8*/     ULONG32      ProcessQuotaPeak[2];                                                                        
/*0x0E0*/     ULONG32      PeakVirtualSize;                                                                            
/*0x0E4*/     ULONG32      VirtualSize;                                                                                
/*0x0E8*/     struct _LIST_ENTRY SessionProcessLinks;                            // 2 elements, 0x8 bytes (sizeof)     
              union                                                              // 3 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x0F0*/         VOID*        ExceptionPortData;                                                                      
/*0x0F0*/         ULONG32      ExceptionPortValue;                                                                     
/*0x0F0*/         ULONG32      ExceptionPortState : 3;                           // 0 BitPosition                      
              };                                                                                                       
/*0x0F4*/     struct _EX_FAST_REF Token;                                         // 3 elements, 0x4 bytes (sizeof)     
/*0x0F8*/     ULONG32      WorkingSetPage;                                                                             
/*0x0FC*/     struct _EX_PUSH_LOCK AddressCreationLock;                          // 7 elements, 0x4 bytes (sizeof)     
/*0x100*/     struct _EX_PUSH_LOCK PageTableCommitmentLock;                      // 7 elements, 0x4 bytes (sizeof)     
/*0x104*/     struct _ETHREAD* RotateInProgress;                                                                       
/*0x108*/     struct _ETHREAD* ForkInProgress;                                                                         
/*0x10C*/     struct _EJOB* CommitChargeJob;                                                                           
/*0x110*/     struct _RTL_AVL_TREE CloneRoot;                                    // 1 elements, 0x4 bytes (sizeof)     
/*0x114*/     ULONG32      NumberOfPrivatePages;                                                                       
/*0x118*/     ULONG32      NumberOfLockedPages;                                                                        
/*0x11C*/     VOID*        Win32Process;                                                                               
/*0x120*/     struct _EJOB* Job;                                                                                       
/*0x124*/     VOID*        SectionObject;                                                                              
/*0x128*/     VOID*        SectionBaseAddress;                                                                         
/*0x12C*/     ULONG32      Cookie;                                                                                     
/*0x130*/     struct _PAGEFAULT_HISTORY* WorkingSetWatch;                                                              
/*0x134*/     VOID*        Win32WindowStation;                                                                         
/*0x138*/     VOID*        InheritedFromUniqueProcessId;                                                               
/*0x13C*/     VOID*        LdtInformation;                                                                             
/*0x140*/     ULONG32      OwnerProcessId;                                                                             
/*0x144*/     struct _PEB* Peb;                                                                                        
/*0x148*/     struct _MM_SESSION_SPACE* Session;                                                                       
/*0x14C*/     VOID*        AweInfo;                                                                                    
/*0x150*/     struct _EPROCESS_QUOTA_BLOCK* QuotaBlock;                                                                
/*0x154*/     struct _HANDLE_TABLE* ObjectTable;                                                                       
/*0x158*/     VOID*        DebugPort;                                                                                  
/*0x15C*/     VOID*        PaeTop;                                                                                     
/*0x160*/     VOID*        DeviceMap;                                                                                  
/*0x164*/     VOID*        EtwDataSource;                                                                              
/*0x168*/     UINT64       PageDirectoryPte;                                                                           
/*0x170*/     struct _FILE_OBJECT* ImageFilePointer;                                                                   
/*0x174*/     UINT8        ImageFileName[15];                                                                          
/*0x183*/     UINT8        PriorityClass;                                                                              
/*0x184*/     VOID*        SecurityPort;                                                                               
/*0x188*/     struct _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo; // 1 elements, 0x4 bytes (sizeof)     
/*0x18C*/     struct _LIST_ENTRY JobLinks;                                       // 2 elements, 0x8 bytes (sizeof)     
/*0x194*/     VOID*        HighestUserAddress;                                                                         
/*0x198*/     struct _LIST_ENTRY ThreadListHead;                                 // 2 elements, 0x8 bytes (sizeof)     
/*0x1A0*/     ULONG32      ActiveThreads;                                                                              
/*0x1A4*/     ULONG32      ImagePathHash;                                                                              
/*0x1A8*/     ULONG32      DefaultHardErrorProcessing;                                                                 
/*0x1AC*/     LONG32       LastThreadExitStatus;                                                                       
/*0x1B0*/     struct _EX_FAST_REF PrefetchTrace;                                 // 3 elements, 0x4 bytes (sizeof)     
/*0x1B4*/     VOID*        LockedPagesList;                                                                            
/*0x1B8*/     union _LARGE_INTEGER ReadOperationCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x1C0*/     union _LARGE_INTEGER WriteOperationCount;                          // 4 elements, 0x8 bytes (sizeof)     
/*0x1C8*/     union _LARGE_INTEGER OtherOperationCount;                          // 4 elements, 0x8 bytes (sizeof)     
/*0x1D0*/     union _LARGE_INTEGER ReadTransferCount;                            // 4 elements, 0x8 bytes (sizeof)     
/*0x1D8*/     union _LARGE_INTEGER WriteTransferCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x1E0*/     union _LARGE_INTEGER OtherTransferCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x1E8*/     ULONG32      CommitChargeLimit;                                                                          
/*0x1EC*/     ULONG32      CommitCharge;                                                                               
/*0x1F0*/     ULONG32      CommitChargePeak;                                                                           
/*0x1F4*/     struct _MMSUPPORT_FULL Vm;                                         // 2 elements, 0x88 bytes (sizeof)    
/*0x27C*/     struct _LIST_ENTRY MmProcessLinks;                                 // 2 elements, 0x8 bytes (sizeof)     
/*0x284*/     ULONG32      ModifiedPageCount;                                                                          
/*0x288*/     LONG32       ExitStatus;                                                                                 
/*0x28C*/     struct _RTL_AVL_TREE VadRoot;                                      // 1 elements, 0x4 bytes (sizeof)     
/*0x290*/     VOID*        VadHint;                                                                                    
/*0x294*/     ULONG32      VadCount;                                                                                   
/*0x298*/     ULONG32      VadPhysicalPages;                                                                           
/*0x29C*/     ULONG32      VadPhysicalPagesLimit;                                                                      
/*0x2A0*/     struct _ALPC_PROCESS_CONTEXT AlpcContext;                          // 3 elements, 0x10 bytes (sizeof)    
/*0x2B0*/     struct _LIST_ENTRY TimerResolutionLink;                            // 2 elements, 0x8 bytes (sizeof)     
/*0x2B8*/     struct _PO_DIAG_STACK_RECORD* TimerResolutionStackRecord;                                                
/*0x2BC*/     ULONG32      RequestedTimerResolution;                                                                   
/*0x2C0*/     ULONG32      SmallestTimerResolution;                                                                    
/*0x2C4*/     UINT8        _PADDING0_[0x4];                                                                            
/*0x2C8*/     union _LARGE_INTEGER ExitTime;                                     // 4 elements, 0x8 bytes (sizeof)     
/*0x2D0*/     ULONG32      ActiveThreadsHighWatermark;                                                                 
/*0x2D4*/     ULONG32      LargePrivateVadCount;                                                                       
/*0x2D8*/     struct _EX_PUSH_LOCK ThreadListLock;                               // 7 elements, 0x4 bytes (sizeof)     
/*0x2DC*/     VOID*        WnfContext;                                                                                 
/*0x2E0*/     ULONG32      Spare0;                                                                                     
/*0x2E4*/     UINT8        SignatureLevel;                                                                             
/*0x2E5*/     UINT8        SectionSignatureLevel;                                                                      
/*0x2E6*/     struct _PS_PROTECTION Protection;                                  // 4 elements, 0x1 bytes (sizeof)     
/*0x2E7*/     UINT8        HangCount;                                                                                  
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x2E8*/         ULONG32      Flags3;                                                                                 
                  struct                                                         // 23 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x2E8*/             ULONG32      Minimal : 1;                                  // 0 BitPosition                      
/*0x2E8*/             ULONG32      ReplacingPageRoot : 1;                        // 1 BitPosition                      
/*0x2E8*/             ULONG32      DisableNonSystemFonts : 1;                    // 2 BitPosition                      
/*0x2E8*/             ULONG32      AuditNonSystemFontLoading : 1;                // 3 BitPosition                      
/*0x2E8*/             ULONG32      Crashed : 1;                                  // 4 BitPosition                      
/*0x2E8*/             ULONG32      JobVadsAreTracked : 1;                        // 5 BitPosition                      
/*0x2E8*/             ULONG32      VadTrackingDisabled : 1;                      // 6 BitPosition                      
/*0x2E8*/             ULONG32      AuxiliaryProcess : 1;                         // 7 BitPosition                      
/*0x2E8*/             ULONG32      SubsystemProcess : 1;                         // 8 BitPosition                      
/*0x2E8*/             ULONG32      IndirectCpuSets : 1;                          // 9 BitPosition                      
/*0x2E8*/             ULONG32      InPrivate : 1;                                // 10 BitPosition                     
/*0x2E8*/             ULONG32      ProhibitRemoteImageMap : 1;                   // 11 BitPosition                     
/*0x2E8*/             ULONG32      ProhibitLowILImageMap : 1;                    // 12 BitPosition                     
/*0x2E8*/             ULONG32      SignatureMitigationOptIn : 1;                 // 13 BitPosition                     
/*0x2E8*/             ULONG32      DisableDynamicCodeAllowOptOut : 1;            // 14 BitPosition                     
/*0x2E8*/             ULONG32      EnableFilteredWin32kAPIs : 1;                 // 15 BitPosition                     
/*0x2E8*/             ULONG32      AuditFilteredWin32kAPIs : 1;                  // 16 BitPosition                     
/*0x2E8*/             ULONG32      PreferSystem32Images : 1;                     // 17 BitPosition                     
/*0x2E8*/             ULONG32      RelinquishedCommit : 1;                       // 18 BitPosition                     
/*0x2E8*/             ULONG32      AutomaticallyOverrideChildProcessPolicy : 1;  // 19 BitPosition                     
/*0x2E8*/             ULONG32      HighGraphicsPriority : 1;                     // 20 BitPosition                     
/*0x2E8*/             ULONG32      CommitFailLogged : 1;                         // 21 BitPosition                     
/*0x2E8*/             ULONG32      ReserveFailLogged : 1;                        // 22 BitPosition                     
                  };                                                                                                   
              };                                                                                                       
/*0x2EC*/     LONG32       DeviceAsid;                                                                                 
/*0x2F0*/     VOID*        SvmData;                                                                                    
/*0x2F4*/     struct _EX_PUSH_LOCK SvmProcessLock;                               // 7 elements, 0x4 bytes (sizeof)     
/*0x2F8*/     ULONG32      SvmLock;                                                                                    
/*0x2FC*/     struct _LIST_ENTRY SvmProcessDeviceListHead;                       // 2 elements, 0x8 bytes (sizeof)     
/*0x304*/     UINT8        _PADDING1_[0x4];                                                                            
/*0x308*/     UINT64       LastFreezeInterruptTime;                                                                    
/*0x310*/     struct _PROCESS_DISK_COUNTERS* DiskCounters;                                                             
/*0x314*/     VOID*        PicoContext;                                                                                
/*0x318*/     ULONG32      KeepAliveCounter;                                                                           
/*0x31C*/     ULONG32      NoWakeKeepAliveCounter;                                                                     
/*0x320*/     ULONG32      HighPriorityFaultsAllowed;                                                                  
/*0x324*/     VOID*        InstrumentationCallback;                                                                    
/*0x328*/     struct _PROCESS_ENERGY_VALUES* EnergyValues;                                                             
/*0x32C*/     VOID*        VmContext;                                                                                  
/*0x330*/     UINT64       SequenceNumber;                                                                             
/*0x338*/     UINT64       CreateInterruptTime;                                                                        
/*0x340*/     UINT64       CreateUnbiasedInterruptTime;                                                                
/*0x348*/     UINT64       TotalUnbiasedFrozenTime;                                                                    
/*0x350*/     UINT64       LastAppStateUpdateTime;                                                                     
              struct                                                             // 2 elements, 0x8 bytes (sizeof)     
              {                                                                                                        
/*0x358*/         UINT64       LastAppStateUptime : 61;                          // 0 BitPosition                      
/*0x358*/         UINT64       LastAppState : 3;                                 // 61 BitPosition                     
              };                                                                                                       
/*0x360*/     ULONG32      SharedCommitCharge;                                                                         
/*0x364*/     struct _EX_PUSH_LOCK SharedCommitLock;                             // 7 elements, 0x4 bytes (sizeof)     
/*0x368*/     struct _LIST_ENTRY SharedCommitLinks;                              // 2 elements, 0x8 bytes (sizeof)     
              union                                                              // 2 elements, 0x8 bytes (sizeof)     
              {                                                                                                        
                  struct                                                         // 2 elements, 0x8 bytes (sizeof)     
                  {                                                                                                    
/*0x370*/             ULONG32      AllowedCpuSets;                                                                     
/*0x374*/             ULONG32      DefaultCpuSets;                                                                     
                  };                                                                                                   
                  struct                                                         // 2 elements, 0x8 bytes (sizeof)     
                  {                                                                                                    
/*0x370*/             ULONG32*     AllowedCpuSetsIndirect;                                                             
/*0x374*/             ULONG32*     DefaultCpuSetsIndirect;                                                             
                  };                                                                                                   
              };                                                                                                       
/*0x378*/     VOID*        DiskIoAttribution;                                                                          
/*0x37C*/     ULONG32      ReadyTime;                                                                                  
/*0x380*/     VOID*        DxgProcess;                                                                                 
/*0x384*/     UINT8        _PADDING2_[0x4];                                                                            
          }EPROCESS, *PEPROCESS;                                                                                       
                                                                                                                       
typedef struct _EPROCESS_QUOTA_BLOCK // 0 elements, 0x0 bytes (sizeof) 
{                                                                      
}EPROCESS_QUOTA_BLOCK, *PEPROCESS_QUOTA_BLOCK;                                  
                                                                       
          typedef struct _OBP_SYSTEM_DOS_DEVICE_STATE // 2 elements, 0x6C bytes (sizeof) 
          {                                                                              
/*0x000*/     ULONG32      GlobalDeviceMap;                                              
/*0x004*/     ULONG32      LocalDeviceCount[26];                                         
          }OBP_SYSTEM_DOS_DEVICE_STATE, *POBP_SYSTEM_DOS_DEVICE_STATE;                                   
                                                                                         
          typedef struct _OBJECT_NAMESPACE_LOOKUPTABLE // 3 elements, 0x130 bytes (sizeof) 
          {                                                                                
/*0x000*/     struct _LIST_ENTRY HashBuckets[37];                                          
/*0x128*/     struct _EX_PUSH_LOCK Lock;               // 7 elements, 0x4 bytes (sizeof)   
/*0x12C*/     ULONG32      NumberOfPrivateSpaces;                                          
          }OBJECT_NAMESPACE_LOOKUPTABLE, *POBJECT_NAMESPACE_LOOKUPTABLE;                                    
                                                                                           
          typedef struct _OBP_SILODRIVERSTATE                                   // 4 elements, 0x1A4 bytes (sizeof) 
          {                                                                                                         
/*0x000*/     struct _DEVICE_MAP* SystemDeviceMap;                                                                  
/*0x004*/     struct _OBP_SYSTEM_DOS_DEVICE_STATE SystemDosDeviceState;         // 2 elements, 0x6C bytes (sizeof)  
/*0x070*/     struct _EX_PUSH_LOCK DeviceMapLock;                               // 7 elements, 0x4 bytes (sizeof)   
/*0x074*/     struct _OBJECT_NAMESPACE_LOOKUPTABLE PrivateNamespaceLookupTable; // 3 elements, 0x130 bytes (sizeof) 
          }OBP_SILODRIVERSTATE, *POBP_SILODRIVERSTATE;                                                              
                                                                                                                    
          typedef struct _SEP_SILOSTATE                                    // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                                   
/*0x000*/     struct _SEP_LOGON_SESSION_REFERENCES* SystemLogonSession;                                       
/*0x004*/     struct _SEP_LOGON_SESSION_REFERENCES* AnonymousLogonSession;                                    
/*0x008*/     VOID*        AnonymousLogonToken;                                                               
/*0x00C*/     VOID*        AnonymousLogonTokenNoEveryone;                                                     
          }SEP_SILOSTATE, *PSEP_SILOSTATE;                                                                    
                                                                                                              
          typedef struct _SEP_RM_LSA_CONNECTION_STATE         // 11 elements, 0x30 bytes (sizeof) 
          {                                                                                       
/*0x000*/     VOID*        LsaProcessHandle;                                                      
/*0x004*/     VOID*        LsaCommandPortHandle;                                                  
/*0x008*/     VOID*        SepRmThreadHandle;                                                     
/*0x00C*/     VOID*        RmCommandPortHandle;                                                   
/*0x010*/     VOID*        RmCommandServerPortHandle;                                             
/*0x014*/     VOID*        LsaCommandPortSectionHandle;                                           
/*0x018*/     union _LARGE_INTEGER LsaCommandPortSectionSize; // 4 elements, 0x8 bytes (sizeof)   
/*0x020*/     VOID*        LsaViewPortMemory;                                                     
/*0x024*/     VOID*        RmViewPortMemory;                                                      
/*0x028*/     LONG32       LsaCommandPortMemoryDelta;                                             
/*0x02C*/     UINT8        LsaCommandPortActive;                                                  
/*0x02D*/     UINT8        _PADDING0_[0x3];                                                       
          }SEP_RM_LSA_CONNECTION_STATE, *PSEP_RM_LSA_CONNECTION_STATE;                                    
                                                                                                  
          typedef struct _WNF_LOCK           // 1 elements, 0x4 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _EX_PUSH_LOCK PushLock; // 7 elements, 0x4 bytes (sizeof) 
          }WNF_LOCK, *PWNF_LOCK;                                               
                                                                               
          typedef struct _WNF_SILODRIVERSTATE                   // 7 elements, 0x30 bytes (sizeof) 
          {                                                                                        
/*0x000*/     struct _WNF_SCOPE_MAP* ScopeMap;                                                     
/*0x004*/     VOID*        PermanentNameStoreRootKey;                                              
/*0x008*/     VOID*        PersistentNameStoreRootKey;                                             
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                        
/*0x010*/     INT64        PermanentNameSequenceNumber;                                            
/*0x018*/     struct _WNF_LOCK PermanentNameSequenceNumberLock; // 1 elements, 0x4 bytes (sizeof)  
/*0x01C*/     UINT8        _PADDING1_[0x4];                                                        
/*0x020*/     INT64        PermanentNameSequenceNumberPool;                                        
/*0x028*/     INT64        RuntimeNameSequenceNumber;                                              
          }WNF_SILODRIVERSTATE, *PWNF_SILODRIVERSTATE;                                             
                                                                                                   
          typedef struct _SILO_USER_SHARED_DATA               // 6 elements, 0x20 bytes (sizeof) 
          {                                                                                      
/*0x000*/     ULONG32      ServiceSessionId;                                                     
/*0x004*/     ULONG32      ActiveConsoleId;                                                      
/*0x008*/     INT64        ConsoleSessionForegroundProcessId;                                    
/*0x010*/     enum _NT_PRODUCT_TYPE NtProductType;                                               
/*0x014*/     ULONG32      SuiteMask;                                                            
/*0x018*/     UINT8        IsMultiSessionSku;                                                    
/*0x019*/     UINT8        _PADDING0_[0x7];                                                      
          }SILO_USER_SHARED_DATA, *PSILO_USER_SHARED_DATA;                                       
                                                                                                 
          typedef struct _ESERVERSILO_GLOBALS                    // 19 elements, 0x288 bytes (sizeof) 
          {                                                                                           
/*0x000*/     struct _OBP_SILODRIVERSTATE ObSiloState;           // 4 elements, 0x1A4 bytes (sizeof)  
/*0x1A4*/     struct _SEP_SILOSTATE SeSiloState;                 // 4 elements, 0x10 bytes (sizeof)   
/*0x1B4*/     UINT8        _PADDING0_[0x4];                                                           
/*0x1B8*/     struct _SEP_RM_LSA_CONNECTION_STATE SeRmSiloState; // 11 elements, 0x30 bytes (sizeof)  
/*0x1E8*/     struct _ETW_SILODRIVERSTATE* EtwSiloState;                                              
/*0x1EC*/     struct _EPROCESS* MiSessionLeaderProcess;                                               
/*0x1F0*/     struct _EPROCESS* ExpDefaultErrorPortProcess;                                           
/*0x1F4*/     VOID*        ExpDefaultErrorPort;                                                       
/*0x1F8*/     ULONG32      HardErrorState;                                                            
/*0x1FC*/     UINT8        _PADDING1_[0x4];                                                           
/*0x200*/     struct _WNF_SILODRIVERSTATE WnfSiloState;          // 7 elements, 0x30 bytes (sizeof)   
/*0x230*/     VOID*        ApiSetSection;                                                             
/*0x234*/     VOID*        ApiSetSchema;                                                              
/*0x238*/     UINT8        OneCoreForwardersEnabled;                                                  
/*0x239*/     UINT8        _PADDING2_[0x3];                                                           
/*0x23C*/     struct _UNICODE_STRING SiloRootDirectoryName;      // 3 elements, 0x8 bytes (sizeof)    
/*0x244*/     struct _PSP_STORAGE* Storage;                                                           
/*0x248*/     enum _SERVERSILO_STATE State;                                                           
/*0x24C*/     LONG32       ExitStatus;                                                                
/*0x250*/     struct _KEVENT* DeleteEvent;                                                            
/*0x254*/     UINT8        _PADDING3_[0x4];                                                           
/*0x258*/     struct _SILO_USER_SHARED_DATA UserSharedData;      // 6 elements, 0x20 bytes (sizeof)   
/*0x278*/     struct _WORK_QUEUE_ITEM TerminateWorkItem;         // 3 elements, 0x10 bytes (sizeof)   
          }ESERVERSILO_GLOBALS, *PESERVERSILO_GLOBALS;                                                
                                                                                                      
          typedef union _KWAIT_STATUS_REGISTER // 7 elements, 0x1 bytes (sizeof) 
          {                                                                      
/*0x000*/     UINT8        Flags;                                                
              struct                           // 6 elements, 0x1 bytes (sizeof) 
              {                                                                  
/*0x000*/         UINT8        State : 3;      // 0 BitPosition                  
/*0x000*/         UINT8        Affinity : 1;   // 3 BitPosition                  
/*0x000*/         UINT8        Priority : 1;   // 4 BitPosition                  
/*0x000*/         UINT8        Apc : 1;        // 5 BitPosition                  
/*0x000*/         UINT8        UserApc : 1;    // 6 BitPosition                  
/*0x000*/         UINT8        Alert : 1;      // 7 BitPosition                  
              };                                                                 
          }KWAIT_STATUS_REGISTER, *PKWAIT_STATUS_REGISTER;                                  
                                                                                 
          typedef struct _KAPC_STATE                         // 7 elements, 0x18 bytes (sizeof) 
          {                                                                                     
/*0x000*/     struct _LIST_ENTRY ApcListHead[2];                                                
/*0x010*/     struct _KPROCESS* Process;                                                        
              union                                          // 2 elements, 0x1 bytes (sizeof)  
              {                                                                                 
/*0x014*/         UINT8        InProgressFlags;                                                 
                  struct                                     // 2 elements, 0x1 bytes (sizeof)  
                  {                                                                             
/*0x014*/             UINT8        KernelApcInProgress : 1;  // 0 BitPosition                   
/*0x014*/             UINT8        SpecialApcInProgress : 1; // 1 BitPosition                   
                  };                                                                            
              };                                                                                
/*0x015*/     UINT8        KernelApcPending;                                                    
/*0x016*/     UINT8        UserApcPending;                                                      
/*0x017*/     UINT8        _PADDING0_[0x1];                                                     
          }KAPC_STATE, *PKAPC_STATE;                                                            
                                                                                                
          typedef struct _KAPC                                        // 17 elements, 0x30 bytes (sizeof) 
          {                                                                                               
/*0x000*/     UINT8        Type;                                                                          
/*0x001*/     UINT8        SpareByte0;                                                                    
/*0x002*/     UINT8        Size;                                                                          
/*0x003*/     UINT8        SpareByte1;                                                                    
/*0x004*/     ULONG32      SpareLong0;                                                                    
/*0x008*/     struct _KTHREAD* Thread;                                                                    
/*0x00C*/     struct _LIST_ENTRY ApcListEntry;                        // 2 elements, 0x8 bytes (sizeof)   
              union                                                   // 2 elements, 0xC bytes (sizeof)   
              {                                                                                           
                  struct                                              // 3 elements, 0xC bytes (sizeof)   
                  {                                                                                       
/*0x014*/             FUNCT_00C8_0697_KernelRoutine* KernelRoutine;                                       
/*0x018*/             FUNCT_00C8_06A5_RundownRoutine* RundownRoutine;                                     
/*0x01C*/             FUNCT_00C8_06A0_NormalRoutine* NormalRoutine;                                       
                  };                                                                                      
/*0x014*/         VOID*        Reserved[3];                                                               
              };                                                                                          
/*0x020*/     VOID*        NormalContext;                                                                 
/*0x024*/     VOID*        SystemArgument1;                                                               
/*0x028*/     VOID*        SystemArgument2;                                                               
/*0x02C*/     CHAR         ApcStateIndex;                                                                 
/*0x02D*/     CHAR         ApcMode;                                                                       
/*0x02E*/     UINT8        Inserted;                                                                      
/*0x02F*/     UINT8        _PADDING0_[0x1];                                                               
          }KAPC, *PKAPC;                                                                                  
                                                                                                          
          typedef struct _KLOCK_ENTRY_LOCK_STATE              // 7 elements, 0x8 bytes (sizeof) 
          {                                                                                     
              union                                           // 2 elements, 0x4 bytes (sizeof) 
              {                                                                                 
                  struct                                      // 4 elements, 0x4 bytes (sizeof) 
                  {                                                                             
/*0x000*/             ULONG32      CrossThreadReleasable : 1; // 0 BitPosition                  
/*0x000*/             ULONG32      Busy : 1;                  // 1 BitPosition                  
/*0x000*/             ULONG32      Reserved : 29;             // 2 BitPosition                  
/*0x000*/             ULONG32      InTree : 1;                // 31 BitPosition                 
                  };                                                                            
/*0x000*/         VOID*        LockState;                                                       
              };                                                                                
              union                                           // 2 elements, 0x4 bytes (sizeof) 
              {                                                                                 
/*0x004*/         VOID*        SessionState;                                                    
/*0x004*/         ULONG32      SessionId;                                                       
              };                                                                                
          }KLOCK_ENTRY_LOCK_STATE, *PKLOCK_ENTRY_LOCK_STATE;                                    
                                                                                                
          typedef struct _KLOCK_ENTRY                                   // 33 elements, 0x30 bytes (sizeof) 
          {                                                                                                 
              union                                                     // 2 elements, 0xC bytes (sizeof)   
              {                                                                                             
/*0x000*/         struct _RTL_BALANCED_NODE TreeNode;                   // 6 elements, 0xC bytes (sizeof)   
/*0x000*/         struct _SINGLE_LIST_ENTRY FreeListEntry;              // 1 elements, 0x4 bytes (sizeof)   
              };                                                                                            
              union                                                     // 3 elements, 0x4 bytes (sizeof)   
              {                                                                                             
/*0x00C*/         ULONG32      EntryFlags;                                                                  
                  struct                                                // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                         
/*0x00C*/             UINT8        EntryOffset;                                                             
                      union                                             // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                     
/*0x00D*/                 UINT8        ThreadLocalFlags;                                                    
                          struct                                        // 2 elements, 0x1 bytes (sizeof)   
                          {                                                                                 
/*0x00D*/                     UINT8        WaitingBit : 1;              // 0 BitPosition                    
/*0x00D*/                     UINT8        Spare0 : 7;                  // 1 BitPosition                    
                          };                                                                                
                      };                                                                                    
                      union                                             // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                     
/*0x00E*/                 UINT8        AcquiredByte;                                                        
/*0x00E*/                 UINT8        AcquiredBit : 1;                 // 0 BitPosition                    
                      };                                                                                    
                      union                                             // 2 elements, 0x1 bytes (sizeof)   
                      {                                                                                     
/*0x00F*/                 UINT8        CrossThreadFlags;                                                    
                          struct                                        // 4 elements, 0x1 bytes (sizeof)   
                          {                                                                                 
/*0x00F*/                     UINT8        HeadNodeBit : 1;             // 0 BitPosition                    
/*0x00F*/                     UINT8        IoPriorityBit : 1;           // 1 BitPosition                    
/*0x00F*/                     UINT8        IoQoSWaiter : 1;             // 2 BitPosition                    
/*0x00F*/                     UINT8        Spare1 : 5;                  // 3 BitPosition                    
                          };                                                                                
                      };                                                                                    
                  };                                                                                        
                  struct                                                // 2 elements, 0x4 bytes (sizeof)   
                  {                                                                                         
/*0x00C*/             ULONG32      StaticState : 8;                     // 0 BitPosition                    
/*0x00C*/             ULONG32      AllFlags : 24;                       // 8 BitPosition                    
                  };                                                                                        
              };                                                                                            
              union                                                     // 3 elements, 0x8 bytes (sizeof)   
              {                                                                                             
/*0x010*/         struct _KLOCK_ENTRY_LOCK_STATE LockState;             // 7 elements, 0x8 bytes (sizeof)   
/*0x010*/         VOID*        LockUnsafe;                                                                  
                  struct                                                // 4 elements, 0x8 bytes (sizeof)   
                  {                                                                                         
/*0x010*/             UINT8        CrossThreadReleasableAndBusyByte;                                        
/*0x011*/             UINT8        Reserved[2];                                                             
/*0x013*/             UINT8        InTreeByte;                                                              
                      union                                             // 2 elements, 0x4 bytes (sizeof)   
                      {                                                                                     
/*0x014*/                 VOID*        SessionState;                                                        
/*0x014*/                 ULONG32      SessionId;                                                           
                      };                                                                                    
                  };                                                                                        
              };                                                                                            
              union                                                     // 2 elements, 0x10 bytes (sizeof)  
              {                                                                                             
                  struct                                                // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                         
/*0x018*/             struct _RTL_RB_TREE OwnerTree;                    // 2 elements, 0x8 bytes (sizeof)   
/*0x020*/             struct _RTL_RB_TREE WaiterTree;                   // 2 elements, 0x8 bytes (sizeof)   
                  };                                                                                        
/*0x018*/         CHAR         CpuPriorityKey;                                                              
              };                                                                                            
/*0x028*/     ULONG32      EntryLock;                                                                       
              union                                                     // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                             
/*0x02C*/         ULONG32      AllBoosts : 17;                          // 0 BitPosition                    
                  struct                                                // 1 elements, 0x4 bytes (sizeof)   
                  {                                                                                         
                      struct                                            // 2 elements, 0x2 bytes (sizeof)   
                      {                                                                                     
/*0x02C*/                 UINT16       CpuBoostsBitmap : 15;            // 0 BitPosition                    
/*0x02C*/                 UINT16       IoBoost : 1;                     // 15 BitPosition                   
                      };                                                                                    
                      struct                                            // 3 elements, 0x2 bytes (sizeof)   
                      {                                                                                     
/*0x02E*/                 UINT16       IoQoSBoost : 1;                  // 0 BitPosition                    
/*0x02E*/                 UINT16       IoNormalPriorityWaiterCount : 8; // 1 BitPosition                    
/*0x02E*/                 UINT16       IoQoSWaiterCount : 7;            // 9 BitPosition                    
                      };                                                                                    
                  };                                                                                        
              };                                                                                            
          }KLOCK_ENTRY, *PKLOCK_ENTRY;                                                                      
                                                                                                            
          typedef struct _KTHREAD                                            // 165 elements, 0x348 bytes (sizeof) 
          {                                                                                                        
/*0x000*/     struct _DISPATCHER_HEADER Header;                              // 53 elements, 0x10 bytes (sizeof)   
/*0x010*/     VOID*        SListFaultAddress;                                                                      
/*0x014*/     UINT8        _PADDING0_[0x4];                                                                        
/*0x018*/     UINT64       QuantumTarget;                                                                          
/*0x020*/     VOID*        InitialStack;                                                                           
/*0x024*/     VOID*        StackLimit;                                                                             
/*0x028*/     VOID*        StackBase;                                                                              
/*0x02C*/     ULONG32      ThreadLock;                                                                             
/*0x030*/     UINT64       CycleTime;                                                                              
/*0x038*/     ULONG32      HighCycleTime;                                                                          
/*0x03C*/     VOID*        ServiceTable;                                                                           
/*0x040*/     ULONG32      CurrentRunTime;                                                                         
/*0x044*/     ULONG32      ExpectedRunTime;                                                                        
/*0x048*/     VOID*        KernelStack;                                                                            
/*0x04C*/     struct _XSAVE_FORMAT* StateSaveArea;                                                                 
/*0x050*/     struct _KSCHEDULING_GROUP* SchedulingGroup;                                                          
/*0x054*/     union _KWAIT_STATUS_REGISTER WaitRegister;                     // 7 elements, 0x1 bytes (sizeof)     
/*0x055*/     UINT8        Running;                                                                                
/*0x056*/     UINT8        Alerted[2];                                                                             
              union                                                          // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                    
                  struct                                                     // 21 elements, 0x4 bytes (sizeof)    
                  {                                                                                                
/*0x058*/             ULONG32      AutoBoostActive : 1;                      // 0 BitPosition                      
/*0x058*/             ULONG32      ReadyTransition : 1;                      // 1 BitPosition                      
/*0x058*/             ULONG32      WaitNext : 1;                             // 2 BitPosition                      
/*0x058*/             ULONG32      SystemAffinityActive : 1;                 // 3 BitPosition                      
/*0x058*/             ULONG32      Alertable : 1;                            // 4 BitPosition                      
/*0x058*/             ULONG32      UserStackWalkActive : 1;                  // 5 BitPosition                      
/*0x058*/             ULONG32      ApcInterruptRequest : 1;                  // 6 BitPosition                      
/*0x058*/             ULONG32      QuantumEndMigrate : 1;                    // 7 BitPosition                      
/*0x058*/             ULONG32      UmsDirectedSwitchEnable : 1;              // 8 BitPosition                      
/*0x058*/             ULONG32      TimerActive : 1;                          // 9 BitPosition                      
/*0x058*/             ULONG32      SystemThread : 1;                         // 10 BitPosition                     
/*0x058*/             ULONG32      ProcessDetachActive : 1;                  // 11 BitPosition                     
/*0x058*/             ULONG32      CalloutActive : 1;                        // 12 BitPosition                     
/*0x058*/             ULONG32      ScbReadyQueue : 1;                        // 13 BitPosition                     
/*0x058*/             ULONG32      ApcQueueable : 1;                         // 14 BitPosition                     
/*0x058*/             ULONG32      ReservedStackInUse : 1;                   // 15 BitPosition                     
/*0x058*/             ULONG32      UmsPerformingSyscall : 1;                 // 16 BitPosition                     
/*0x058*/             ULONG32      TimerSuspended : 1;                       // 17 BitPosition                     
/*0x058*/             ULONG32      SuspendedWaitMode : 1;                    // 18 BitPosition                     
/*0x058*/             ULONG32      SuspendSchedulerApcWait : 1;              // 19 BitPosition                     
/*0x058*/             ULONG32      Reserved : 12;                            // 20 BitPosition                     
                  };                                                                                               
/*0x058*/         LONG32       MiscFlags;                                                                          
              };                                                                                                   
              union                                                          // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                    
                  struct                                                     // 22 elements, 0x4 bytes (sizeof)    
                  {                                                                                                
/*0x05C*/             ULONG32      AutoAlignment : 1;                        // 0 BitPosition                      
/*0x05C*/             ULONG32      DisableBoost : 1;                         // 1 BitPosition                      
/*0x05C*/             ULONG32      ThreadFlagsSpare0 : 1;                    // 2 BitPosition                      
/*0x05C*/             ULONG32      AlertedByThreadId : 1;                    // 3 BitPosition                      
/*0x05C*/             ULONG32      QuantumDonation : 1;                      // 4 BitPosition                      
/*0x05C*/             ULONG32      EnableStackSwap : 1;                      // 5 BitPosition                      
/*0x05C*/             ULONG32      GuiThread : 1;                            // 6 BitPosition                      
/*0x05C*/             ULONG32      DisableQuantum : 1;                       // 7 BitPosition                      
/*0x05C*/             ULONG32      ChargeOnlySchedulingGroup : 1;            // 8 BitPosition                      
/*0x05C*/             ULONG32      DeferPreemption : 1;                      // 9 BitPosition                      
/*0x05C*/             ULONG32      QueueDeferPreemption : 1;                 // 10 BitPosition                     
/*0x05C*/             ULONG32      ForceDeferSchedule : 1;                   // 11 BitPosition                     
/*0x05C*/             ULONG32      SharedReadyQueueAffinity : 1;             // 12 BitPosition                     
/*0x05C*/             ULONG32      FreezeCount : 1;                          // 13 BitPosition                     
/*0x05C*/             ULONG32      TerminationApcRequest : 1;                // 14 BitPosition                     
/*0x05C*/             ULONG32      AutoBoostEntriesExhausted : 1;            // 15 BitPosition                     
/*0x05C*/             ULONG32      KernelStackResident : 1;                  // 16 BitPosition                     
/*0x05C*/             ULONG32      CommitFailTerminateRequest : 1;           // 17 BitPosition                     
/*0x05C*/             ULONG32      ProcessStackCountDecremented : 1;         // 18 BitPosition                     
/*0x05C*/             ULONG32      RestrictedGuiThread : 1;                  // 19 BitPosition                     
/*0x05C*/             ULONG32      ThreadFlagsSpare : 4;                     // 20 BitPosition                     
/*0x05C*/             ULONG32      EtwStackTraceApcInserted : 8;             // 24 BitPosition                     
                  };                                                                                               
/*0x05C*/         LONG32       ThreadFlags;                                                                        
              };                                                                                                   
/*0x060*/     UINT8        Tag;                                                                                    
/*0x061*/     UINT8        SystemHeteroCpuPolicy;                                                                  
              struct                                                         // 2 elements, 0x1 bytes (sizeof)     
              {                                                                                                    
/*0x062*/         UINT8        UserHeteroCpuPolicy : 7;                      // 0 BitPosition                      
/*0x062*/         UINT8        ExplicitSystemHeteroCpuPolicy : 1;            // 7 BitPosition                      
              };                                                                                                   
/*0x063*/     UINT8        Spare0;                                                                                 
/*0x064*/     ULONG32      SystemCallNumber;                                                                       
/*0x068*/     VOID*        FirstArgument;                                                                          
/*0x06C*/     struct _KTRAP_FRAME* TrapFrame;                                                                      
              union                                                          // 2 elements, 0x18 bytes (sizeof)    
              {                                                                                                    
/*0x070*/         struct _KAPC_STATE ApcState;                               // 7 elements, 0x18 bytes (sizeof)    
                  struct                                                     // 2 elements, 0x18 bytes (sizeof)    
                  {                                                                                                
/*0x070*/             UINT8        ApcStateFill[23];                                                               
/*0x087*/             CHAR         Priority;                                                                       
                  };                                                                                               
              };                                                                                                   
/*0x088*/     ULONG32      UserIdealProcessor;                                                                     
/*0x08C*/     ULONG32      ContextSwitches;                                                                        
/*0x090*/     UINT8        State;                                                                                  
/*0x091*/     CHAR         Spare12;                                                                                
/*0x092*/     UINT8        WaitIrql;                                                                               
/*0x093*/     CHAR         WaitMode;                                                                               
/*0x094*/     LONG32       WaitStatus;                                                                             
/*0x098*/     struct _KWAIT_BLOCK* WaitBlockList;                                                                  
              union                                                          // 2 elements, 0x8 bytes (sizeof)     
              {                                                                                                    
/*0x09C*/         struct _LIST_ENTRY WaitListEntry;                          // 2 elements, 0x8 bytes (sizeof)     
/*0x09C*/         struct _SINGLE_LIST_ENTRY SwapListEntry;                   // 1 elements, 0x4 bytes (sizeof)     
              };                                                                                                   
/*0x0A4*/     struct _DISPATCHER_HEADER* Queue;                                                                    
/*0x0A8*/     VOID*        Teb;                                                                                    
/*0x0AC*/     UINT8        _PADDING1_[0x4];                                                                        
/*0x0B0*/     UINT64       RelativeTimerBias;                                                                      
/*0x0B8*/     struct _KTIMER Timer;                                          // 5 elements, 0x28 bytes (sizeof)    
              union                                                          // 5 elements, 0x60 bytes (sizeof)    
              {                                                                                                    
/*0x0E0*/         struct _KWAIT_BLOCK WaitBlock[4];                                                                
                  struct                                                     // 2 elements, 0x60 bytes (sizeof)    
                  {                                                                                                
/*0x0E0*/             UINT8        WaitBlockFill8[20];                                                             
/*0x0F4*/             struct _KTHREAD_COUNTERS* ThreadCounters;                                                    
/*0x0F8*/             UINT8        _PADDING2_[0x48];                                                               
                  };                                                                                               
                  struct                                                     // 2 elements, 0x60 bytes (sizeof)    
                  {                                                                                                
/*0x0E0*/             UINT8        WaitBlockFill9[44];                                                             
/*0x10C*/             struct _XSTATE_SAVE* XStateSave;                                                             
/*0x110*/             UINT8        _PADDING3_[0x30];                                                               
                  };                                                                                               
                  struct                                                     // 2 elements, 0x60 bytes (sizeof)    
                  {                                                                                                
/*0x0E0*/             UINT8        WaitBlockFill10[68];                                                            
/*0x124*/             VOID*        Win32Thread;                                                                    
/*0x128*/             UINT8        _PADDING4_[0x18];                                                               
                  };                                                                                               
                  struct                                                     // 3 elements, 0x60 bytes (sizeof)    
                  {                                                                                                
/*0x0E0*/             UINT8        WaitBlockFill11[88];                                                            
/*0x138*/             ULONG32      WaitTime;                                                                       
                      union                                                  // 2 elements, 0x4 bytes (sizeof)     
                      {                                                                                            
                          struct                                             // 2 elements, 0x4 bytes (sizeof)     
                          {                                                                                        
/*0x13C*/                     INT16        KernelApcDisable;                                                       
/*0x13E*/                     INT16        SpecialApcDisable;                                                      
                          };                                                                                       
/*0x13C*/                 ULONG32      CombinedApcDisable;                                                         
                      };                                                                                           
                  };                                                                                               
              };                                                                                                   
/*0x140*/     struct _LIST_ENTRY QueueListEntry;                             // 2 elements, 0x8 bytes (sizeof)     
              union                                                          // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                    
/*0x148*/         ULONG32      NextProcessor;                                                                      
